Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/contract_metadata.po
Languages: es, fr, it

source: Compilation Artifacts
es: Artefactos de compilación
it: Artefatti di Compilazione

source: When a compilation for a Solidity file succeeds, Remix creates three JSON files for each compiled contract. Files can be seen in the `File Explorers plugin` as:
es: Cuando una compilación para un archivo Solidity tiene éxito, Remix crea tres archivos JSON para cada contrato compilado. Los archivos pueden verse en el `File Explorers plugin` como:
fr: Lorsque la compilation d'un fichier Solidity réussit, Remix crée trois fichiers JSON pour chaque contrat compilé. Les fichiers peuvent être vus dans le plugin `File Explorers` comme :
it: Quando la compilazione di un file Solidity ha successo, Remix crea tre file JSON per ogni contratto compilato. I file sono visibili nel `File Explorers plugin`(plugin Esplora File) come:

source: `artifacts/<contractName>.json`: contains the link to the libraries, the bytecode, the deployed bytecode, the gas estimation, the method identifiers, and the ABI. It is used for linking a library address to the file.
es: `artifacts/<contractName>.json`: contiene el enlace a las bibliotecas, el bytecode, el bytecode desplegado, la estimación del gas, los identificadores del método y la ABI. Se utiliza para vincular una dirección de biblioteca al archivo.
fr: `artifacts/<contractName>.json` : contient le lien vers les bibliothèques, le bytecode, le bytecode déployé, l'estimation des gaz, les identifiants de méthode et l'ABI. Il est utilisé pour lier l'adresse d'une bibliothèque au fichier.
it: `artifacts/<contractName>.json`: contiene il collegamento alle librerie, il bytecode, il bytecode distribuito, l'estimazione del gas, il metodo degli identificatori, e l'ABI. È utilizzato per collegare l'indirizzo di una libreria al file.

source: `artifacts/<contractName_metadata>.json`: contains the metadata from the output of Solidity compilation.
es: `artifacts/<contractName_metadata>.json`: contiene los metadatos de la salida de la compilación de Solidity.
fr: `artifacts/<contractName_metadata>.json` : contient les métadonnées issues de la compilation de Solidity.
it: `artifacts/<contractName_metadata>.json`: contiene il metadata dal risultato di una compilazione Solidity.

source: `artifacts/build-info/<dynamic_hash>.json`: contains info about `solc` compiler version, compiler input and output. This file is generated similar to the files generated through Hardhat compilation. You can also try [Hardhat compilation](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) from Remix.
es: `artifacts/build-info/<dynamic_hash>.json`: contiene información sobre la versión del compilador `solc`, la entrada y la salida del compilador. Este archivo se genera de forma similar a los archivos generados mediante la compilación Hardhat. También puede probar [Compilación Hardhat](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) de Remix.
fr: `artifacts/build-info/<dynamic_hash>.json` : contient des informations sur la version du compilateur `solc`, les entrées et sorties du compilateur. Ce fichier est généré de la même manière que les fichiers générés par la compilation Hardhat. Vous pouvez également essayer [Hardhat compilation](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) à partir de Remix.
it: `artifacts/build-info/<dynamic_hash>.json`: contiene informazioni sulla versione del compilatore `solc`, sull'input e sull'output del compilatore. Questo file è generato in modo simile ai file generati dalla compilazione di Hardhat. Si può anche provare [Compilazione Hardhat](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) da Remix.

source: Please note that in order to generate these artifact files, the **Generate contract metadata** box in the **General settings** section of the **Settings** module needs to be checked. By default, it is checked.
es: Tenga en cuenta que para generar estos archivos de artefactos, es necesario marcar la casilla **Generar metadatos de contrato** en la sección **Configuración general** del módulo **Configuración**. Por defecto, está marcada.
fr: Veuillez noter que pour générer ces fichiers d'artefacts, la case **Générer les métadonnées du contrat** dans la section **Paramètres généraux** du module **Paramètres** doit être cochée. Par défaut, elle est cochée.
it: Si prega di notare che per generare questi file di artefatti, è necessario selezionare la casella **Generate contract metadata** (Generare i metadati del contratto) nella sezione **General settings** (Impostazioni generali) del modulo **Settings** (Impostazioni). Per impostazione predefinita, è selezionata.

source: You can write scripts that can access either of these files.
es: Puede escribir scripts que tengan acceso a cualquiera de estos archivos.
fr: Vous pouvez écrire des scripts qui peuvent accéder à l'un ou l'autre de ces fichiers.
it: Puoi scrivere script che possono accedere a uno di questi file.

source: Library Deployment with filename.json
es: Despliegue de la biblioteca con filename.json
fr: Déploiement de bibliothèques avec filename.json
it: Distribuzione della libreria con filename.json

source: By default Remix automatically deploys needed libraries.
es: Por defecto, Remix implementa automáticamente las bibliotecas necesarias.
fr: Par défaut, Remix déploie automatiquement les bibliothèques nécessaires.
it: Per impostazione predefinita, Remix distribuisce automaticamente le librerie necessarie.

source: When you open the metadata file for the libraries - **artifact/filename.json** you will see the following sections:
es: Cuando abra el archivo de metadatos de las bibliotecas - **artifact/filename.json** verá las siguientes secciones:
fr: Lorsque vous ouvrez le fichier de métadonnées des bibliothèques - **artifact/filename.json** vous verrez les sections suivantes :
it: Quando si apre il file dei metadati delle librerie - **artifact/filename.json** - si vedranno le seguenti sezioni:

source: `linkReferences` contains a map representing libraries which depend on the current contract. Values are addresses of libraries used for linking the contract.
es: `linkReferences` contiene un mapa que representa las bibliotecas que dependen del contrato actual. Los valores son direcciones de bibliotecas utilizadas para enlazar el contrato.
fr: `linkReferences` contient une carte représentant les bibliothèques qui dépendent du contrat en cours. Les valeurs sont les adresses des bibliothèques utilisées pour lier le contrat.
it: `linkReferences` contiene una mappa che rappresenta le librerie che dipendono dal contratto corrente. I valori sono gli indirizzi delle librerie utilizzate per il collegamento del contratto.

source: `autoDeployLib` defines if the libraries should be auto deployed by Remix or if the contract should be linked with libraries described in `linkReferences`
es: `autoDeployLib` define si las librerías deben ser autodesplegadas por Remix o si el contrato debe enlazarse con librerías descritas en `linkReferences`.
fr: `autoDeployLib` définit si les bibliothèques doivent être déployées automatiquement par Remix ou si le contrat doit être lié avec les bibliothèques décrites dans `linkReferences`.
it: `autoDeployLib` definisce se le librerie devono essere distribuite automaticamente da Remix o se il contratto deve essere collegato alle librerie descritte in `linkReferences`

source: Note that Remix will resolve addresses corresponding to the current network. By default, a configuration key follows the form: `<network_name>:<networkd_id>`, but it is also possible to define `<network_name>` or `<network_id>` as keys.
es: Tenga en cuenta que Remix resolverá las direcciones correspondientes a la red actual. Por defecto, una clave de configuración sigue la forma `<network_name>:<networkd_id>`, pero también es posible definir `<network_name>` o `<network_id>` como claves.
fr: Notez que Remix résoudra les adresses correspondant au réseau actuel. Par défaut, une clé de configuration suit la forme : `<network_name>:<networkd_id>`, mais il est également possible de définir `<network_name>` ou `<network_id>` comme clés.
it: Si noti che Remix risolverà gli indirizzi corrispondenti alla rete corrente. Per impostazione predefinita, una chiave di configurazione segue la forma: `<network_name>:<networkd_id>` (<nome_rete>:<id_rete>), ma è anche possibile definire `<network_name>` (<nome_rete>) o `<network_id>` (<id_rete>) come chiavi.

source: Here is a sample metadata file for linking a library:
es: Aquí hay un archivo de metadatos de ejemplo para enlazar una biblioteca:
fr: Voici un exemple de fichier de métadonnées pour lier une bibliothèque :
it: Ecco un esempio di file di metadati per il collegamento a una libreria:

source: Generate Artifact
fr: Générer un artefact
