Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/contract_verification.po
Languages: es, it

source: Contract Verification
es: Verificación de contrato
it: Verifica del Contratto

source: There are two contract verification services in Remix, Sourcify and Etherscan and the extended [Etherscan family](https://etherscan.io/eaas) of block explorers.
es: Hay dos servicios de verificación de contratos en Remix, Sourcify y Etherscan y la [familia Etherscan](https://etherscan.io/eaas) extendida de exploradores de bloques.
it: In Remix ci sono due servizi di verifica dei contratti, Sourcify ed Etherscan e la [famiglia Etherscan](https://etherscan.io/eaas) estesa di esploratori di blocchi.

source: Sourcify
es: fuente

source: Documentation about Sourcify is found [here]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
es: La documentación sobre Sourcify se encuentra [here](https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
it: La documentazione di Sourcify si trova [qui]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).

source: The Etherscan plugin is called: **CONTRACT VERIFICATION - ETHERSCAN**.
es: El complemento de Etherscan se llama: **VERIFICACIÓN DE CONTRATO - ETHERSCAN**.
it: Il plugin di Etherscan si chiama: *CONTRACT VERIFICATION - ETHERSCAN** (VERIFICA DEL CONTRATTO - ETHERSCAN).

source: You can access it from the Plugin Manager.
es: Puede acceder a él desde el Administrador de complementos.
it: È possibile accedervi dal Gestore dei Plugin.

source: The plugin has 3 pages, the **verification** page, the **receipts** page, and the **settings** page.
es: El complemento tiene 3 páginas, la página de **verificación**, la página de **recibos** y la página de **configuración**.
it: Il plugin ha 3 pagine, la pagina **verification* (verifica), la pagina **receipts** (ricevute) e la pagina **settings** (impostazioni).

source: When you go to the plugin for the first time, the settings page will load for inputting the API key.
es: Cuando acceda al complemento por primera vez, se cargará la página de configuración para ingresar la clave API.
it: Quando si accede al plugin per la prima volta, la pagina delle impostazioni viene caricata per l'inserimento della chiave API.

source: ![](images/a-cv-etherscan-plugin-api-needed.png)
es: ![](imagenes/a-cv-etherscan-plugin-api-needed.png)

source: Etherscan API Key - settings page
es: Clave API de Etherscan: página de configuración
it: Chiave API Etherscan - pagina delle impostazioni

source: Etherscan is a block explorer for Ethereum mainnet and they make block explorers for other chains.
es: Etherscan es un explorador de bloques para la red principal de Ethereum y crean exploradores de bloques para otras cadenas.
it: Etherscan è un esploratore di blocchi per la rete principale (mainnet) di Ethereum e fa l'esploratore di blocchi anche per altre catene.

source: For Ethereum testnets like Goerli or Sepolia, the same API key works.
es: Para las redes de prueba de Ethereum como Goerli o Sepolia, funciona la misma clave API.
it: Per le reti di test di Ethereum come Goerli o Sepolia, funziona la stessa chiave API.

source: If you are trying to verify on L2 chains like Optimism, a different API key is needed for their block explorer. Not all of the block explorers made by Etherscan have API keys. The Remix Contract Verification - Etherscan plugin only works where you can login to that block explorer to get the API key.
es: Si está intentando verificar en cadenas L2 como Optimism, se necesita una clave API diferente para su explorador de bloques. No todos los exploradores de bloques creados por Etherscan tienen claves API. El complemento Remix Contract Verification - Etherscan solo funciona cuando puede iniciar sesión en ese explorador de bloques para obtener la clave API.
it: Se si sta cercando di verificare su catene L2 come Optimism, è necessaria una chiave API diversa per il loro esploratore di blocchi. Non tutti gli esploratori di blocchi realizzati da Etherscan hanno le chiavi API. Il plugin Remix di Verifica Contratti - Etherscan funziona solo dove è possibile accedere a quell'esploratore di blocchi per ottenere la chiave API.

source: Once the API key is input, the verification page (the homepage) is opened.
es: Una vez que se ingresa la clave API, se abre la página de verificación (la página de inicio).
it: Una volta inserita la chiave API, si apre la pagina di verifica (la homepage).

source: Verification page
es: Página de verificación
it: Pagina di verifica

source: ![](images/a-cv-etherscan-verify-page1.png)
es: ![](imagenes/a-cv-etherscan-verify-page1.png)

source: The network is NOT selected in the Etherscan plugin. The network is chosen in the Deploy & Run plugin and in your browser's wallet (if using).
es: La red NO está seleccionada en el complemento Etherscan. La red se elige en el complemento Deploy & Run y en la billetera de su navegador (si la usa).
it: La rete NON è selezionata nel plugin Etherscan. La rete viene scelta nel plugin Distribuisci & Avvia e nel portafoglio del browser (se in uso).

source: The prerequisites for verification are:
es: Los requisitos previos para la verificación son:
it: I prerequisiti per la verifica sono:

source: The address of a deployed contract on a public network
es: La dirección de un contrato implementado en una red pública.
it: L'indirizzo di un contratto distribuito su una rete pubblica

source: That same contract compiled in Remix
es: Ese mismo contrato compilado en Remix.
it: Lo stesso contratto compilato in Remix

source: Constructor parameters same as used during deployment (if required)
es: Parámetros del constructor iguales a los utilizados durante la implementación (si es necesario)
it: I parametri del costruttore uguali a quelli utilizzati durante la distribuzione (se necessari)

source: Receipts page
es: Página de recibos
it: Pagina delle ricevute

source: Verification receipts are found on the receipts page.
es: Los recibos de verificación se encuentran en la página de recibos.
it: Le ricevute di verifica si trovano nella pagina delle ricevute.

source: ![](images/a-cv-etherscan-receipts.png)
es: ![](imagenes/a-cv-etherscan-receipts.png)

source: Verification with constructor arguments
es: Verificación con argumentos del constructor.
it: Verifica con gli argomenti del costruttore

source: When a contract has arguments in the constructor, a text box will show for inputting the same constructor inputs as the deployed contract.
es: Cuando un contrato tiene argumentos en el constructor, se mostrará un cuadro de texto para ingresar las mismas entradas del constructor que el contrato implementado.
it: Quando un contratto ha gli argomenti nel costruttore, viene mostrata una casella di testo per inserire gli stessi input del costruttore del contratto distribuito.

source: ![](images/a-cv-etherscan-constructor-args.png)
es: ![](imagenes/a-cv-etherscan-constructor-args.png)

source: Verifying a proxy contract
es: Verificación de un contrato de representación
it: Verifica di un contratto proxy

source: Before verifying a proxy contract, the associated implementation contract must already be verified.
es: Antes de verificar un contrato de proxy, el contrato de implementación asociado ya debe estar verificado.
it: Prima di verificare un contratto proxy, il contratto di implementazione associato deve essere già verificato.

source: Just for review, the implementation contract is you wrote or adapted and the proxy is, for example, an ERC1967Proxy.
es: Solo para revisar, el contrato de implementación lo escribió o adaptó usted y el proxy es, por ejemplo, un ERC1967Proxy.
it: Solo per informazione, il contratto di implementazione è quello scritto o adattato da voi ed il proxy è, ad esempio, un ERC1967Proxy.

source: **Do not check the proxy box when verifying the implementation.** Then after verifying the implementation contract:
es: **No marque la casilla de proxy al verificar la implementación.** Luego, después de verificar el contrato de implementación:
it: **Non selezionare la casella del proxy quando si verifica l'implementazione.** Poi, dopo aver verificato il contratto di implementazione:

source: Cut out the implementation contract's address from the Contract Address box.
es: Recorte la dirección del contrato de implementación del cuadro Dirección del contrato.
it: Tagliare l'indirizzo del contratto di implementazione dalla casella Contract Address (Indirizzo del contratto).

source: Click the "It's a proxy contract address" checkbox.
es: Haga clic en la casilla de verificación "Es una dirección de contrato de proxy".
it: Fare clic sulla casella di controllo "È un indirizzo di contratto proxy".

source: Paste the verified implementation contract's address in the Expected Implementation Address box.
es: Pegue la dirección del contrato de implementación verificado en el cuadro Dirección de implementación esperada.
it: Incollare l'indirizzo del contratto di implementazione verificato nella casella Expected Implementation Address (Indirizzo di implementazione previsto).

source: Paste in the proxy contract address into the Contract Address box.
es: Pegue la dirección del contrato de representación en el cuadro Dirección del contrato.
it: Incolla l'indirizzo del contratto proxy nella casella Indirizzo del Contratto.

source: To explain this visually, verify the implmentation contract:
es: Para explicar esto visualmente, verifique el contrato de implementación:
it: Per spiegarlo visivamente, verificate il contratto di implementazione:

source: ![](images/a-cv-etherscan-verify-implementation.png)
es: ![](imagenes/a-cv-etherscan-verify-implementation.png)

source: Then check the "It's a proxy contract" checkbox and cut and paste the implementation address from the contract address to the implementation contract box:
es: Luego marque la casilla de verificación "Es un contrato de proxy" y corte y pegue la dirección de implementación desde la dirección del contrato en la casilla del contrato de implementación:
it: Seleziona quindi la casella di controllo "È un contratto proxy" e taglia e incolla l'indirizzo di implementazione dall'indirizzo del contratto alla casella del contratto di implementazione:

source: ![](images/a-cv-etherscan-move-addr.png)
es: ![](imagenes/a-cv-etherscan-move-addr.png)

source: And then paste the address of the proxy contract into the Contract Address box. ![](images/a-cv-etherscan-verify-proxy2.png)
es: Y luego pegue la dirección del contrato de representación en el cuadro Dirección del contrato. ![](imagenes/a-cv-etherscan-verify-proxy2.png)
it: E poi incolla l'indirizzo del contratto proxy nella casella Indirizzo del Contratto. ![](images/a-cv-etherscan-verify-proxy2.png)

source: Generate Verfication Scripts
es: Generar scripts de verificación
it: Generare script di verifica

source: Clicking the Generate Verification Scripts on the Verification page, will create a folder named etherscan in the Workspace's scripts folder that contains .ts files for verifying and returning the receipt status.
es: Al hacer clic en Generar secuencias de comandos de verificación en la página Verificación, se creará una carpeta llamada etherscan en la carpeta de secuencias de comandos del espacio de trabajo que contiene archivos .ts para verificar y devolver el estado del recibo.
it: Facendo clic su Genera Script di Verifica nella pagina di Verifica, verrà creata una cartella denominata etherscan nella cartella script dell'Area di lavoro, contenente i file .ts per la verifica e la restituzione dello stato di ricezione.

source: ![](images/a-cv-etherscan-gen-scripts.png)
es: ![](imagenes/a-cv-etherscan-gen-scripts.png)
