Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/create_deploy.po
Languages: es, fr, it

source: Creating and Deploying a Contract
es: Crear y desplegar un contrato
fr: Création et déploiement d'un contrat
it: Creazione e Distribuzione di un contratto

source: This page contains the process of creating a contract, compiling it, deploying and then interacting with it.
es: Esta página contiene el proceso de creación de un contrato, su compilación, despliegue y posterior interacción con él.
fr: Cette page décrit le processus de création d'un contrat, de compilation, de déploiement et d'interaction avec celui-ci.
it: Questa pagina contiene il processo di creazione di un contratto, di compilazione, di distribuzione e di interazione con esso.

source: A sample contract
es: Un modelo de contrato
fr: Un exemple de contrat
it: Un contratto campione

source: This contract is very basic. The goal is to quickly start to create and to interact with a sample contract.
es: Este contrato es muy básico, el objetivo es comenzar rápidamente a crear e interactuar con un contrato de muestra.
fr: Ce contrat est très basique. L'objectif est de commencer rapidement à créer et à interagir avec un exemple de contrat.
it: Questo contratto è molto semplice. L'obiettivo è quello di iniziare rapidamente a creare e interagire con un contratto di esempio.

source: ![](images/a-file-explorer-new-file2.png)
fr: ![](images/a-explorateur-de-fichiers-nouveau-fichier2.png)

source: Go to the File Explorer, create a new file, name it and in the editor paste the contract below.
es: Vaya al Explorador de archivos, cree un nuevo archivo, póngale un nombre y en el editor pegue el contrato que aparece a continuación.
fr: Allez dans l'explorateur de fichiers, créez un nouveau fichier, nommez-le et dans l'éditeur collez le contrat ci-dessous.
it: Vai in Esplora file, crea un nuovo file, dagli un nome e nell'editor incolla il contratto qui sotto.

source: Compile the Contract
es: Redactar el contrato
fr: Compilation du contrat
it: Compila il Contratto

source: With the contract above as the active tab in the Editor, compile the contract.
es: Con el contrato anterior como pestaña activa en el Editor, compile el contrato.
fr: Avec le contrat ci-dessus comme onglet actif dans l'éditeur, compilez le contrat.
it: Con il contratto di cui sopra come scheda attiva nell'Editor, compila il contratto.

source: **For More Info** see the docs on the ([Solidity Compiler](compile.html)).
es: **Para más información** consulte la documentación del ([Solidity Compiler](compile.html)).
fr: **Pour plus d'informations, consultez la documentation sur le ([Solidity Compiler](compile.html)).
it: **Per ulteriori informazioni** consultare la documentazione del ([Compilatore di Solidity](compile.html)).

source: Deploy the contract
es: Despliegue del contrato
fr: Déployer le contrat
it: Distribuire il contratto

source: Go to the **Deploy & Run Transactions** plugin.
es: Vaya al plugin **Desplegar y ejecutar transacciones**.
fr: Allez dans le plugin **Deploy & Run Transactions**.
it: Vai al plugin **Distribuisci & Esegui transazioni**.

source: There are 3 type of environments Remix can be plugged to:
es: Hay 3 tipos de entornos a los que se puede conectar Remix:
fr: Il y a 3 types d'environnements sur lesquels Remix peut être branché :
it: Ci sono 3 tipi di ambienti a cui Remix può essere collegato:

source: Injected Web3
es: Web3 inyectada
fr: Injecté Web3
it: Web3 Iniettato

source: Web3 Provider
es: Proveedor de Web3
fr: Fournisseur Web3
it: Provider Web3

source: (For details see [Running transactions](https://remix-ide.readthedocs.io/en/latest/run.html))
es: (Para más detalles, consulte [Transacciones en curso](https://remix-ide.readthedocs.io/en/latest/run.html))
fr: (Pour plus de détails, voir [Running transactions] (https://remix-ide.readthedocs.io/en/latest/run.html))
it: (Per i dettagli, vedere [Esecuzione di transazioni](https://remix-ide.readthedocs.io/en/latest/run.html))

source: Both **Injected Web3** and **Web3 Provider** require the use of an external tool.
es: Tanto **Web3 inyectado** como **Proveedor Web3** requieren el uso de una herramienta externa.
fr: Tant **Injected Web3** que **Web3 Provider** nécessitent l'utilisation d'un outil externe.
it: Sia **Injected Web3** che **Provider Web3** richiedono l'uso di uno strumento esterno.

source: An external tool for **Injected provider** is Metamask. Some external tools used with **Web3 provider** are a Truffle Ganache-CLI, Hardhat node, or an Ethereum node itself.
es: Una herramienta externa para el **proveedor inyectado** es Metamask. Algunas herramientas externas utilizadas con **Proveedor Web3** son un Ganache-CLI de Truffle, un nodo Hardhat o un nodo Ethereum propiamente dicho.
fr: Un outil externe pour le **Fournisseur injecté** est Metamask. Certains outils externes utilisés avec le **FournisseurWeb3** sont un Truffle Ganache-CLI, un nœud Hardhat ou un nœud Ethereum lui-même.
it: Uno strumento esterno per **Injected provider** è Metamask. Alcuni strumenti esterni utilizzati con **Provider Web3** sono una Ganache-CLI di Truffle, un nodo Hardhat o un nodo Ethereum stesso.

source: The **JavaScript VM** is convenient because it is a blockchain that runs in your browser and you don't need any other software or Ethereum node to run it.
es: El **JavaScript VM** es conveniente porque es un blockchain que se ejecuta en su navegador y no necesita ningún otro software o nodo Ethereum para ejecutarlo.
fr: La **JavaScript VM** est pratique car il s'agit d'une blockchain qui fonctionne dans votre navigateur et vous n'avez pas besoin d'un autre logiciel ou d'un nœud Ethereum pour la faire fonctionner.
it: La **Macchina Virtuale JavaScript** è comoda perché è una blockchain che gira nel browser e non ha bisogno di altri software o nodi Ethereum per essere eseguita.

source: **NOTE:** When you are in the **Javascript VM** and you reload the browser - the **Javascript VM** will restart to its fresh & default state.
es: **NOTA:** Cuando esté en la **VM de Javascript** y recargue el navegador - la **VM de Javascript** se reiniciará a su estado fresco y por defecto.
fr: **REMARQUE:** Lorsque vous êtes dans la **VM javascript** et que vous rechargez le navigateur, la **VM javascript** redémarre à l'état neuf et par défaut.
it: **NOTA:** Quando si è nella **Macchina Virtuale Javascript** e si ricarica il browser, la **Macchina Virtuale Javascript** si riavvia al suo stato nuovo e predefinito.

source: For performance purposes ( which is to say - for testing in an environment that is closest to the mainnet), it can be better to use an external node.
es: A efectos de rendimiento (es decir, para realizar pruebas en un entorno lo más cercano posible a la red principal), puede ser mejor utilizar un nodo externo.
fr: Pour des raisons de performance (c'est-à-dire pour des tests dans un environnement qui est le plus proche du réseau principal), il peut être préférable d'utiliser un nœud externe.
it: Ai fini delle prestazioni (cioè per i test in un ambiente più simile alla rete principale), può essere meglio utilizzare un nodo esterno.

source: Select the VM environment
es: Seleccione el entorno VM
fr: Sélectionnez l'environnement de la VM
it: Seleziona l'ambiente VM

source: Make sure the VM mode is selected. All accounts displayed in **ACCOUNT** should have 100 ether.
es: Asegúrese de que está seleccionado el modo VM. Todas las cuentas mostradas en **ACCOUNT** deben tener 100 ether.
fr: Assurez-vous que le mode VM est sélectionné. Tous les comptes affichés dans **ACCOUNT** doivent avoir 100 éther.
it: Assicurarsi che sia selezionata la modalità Macchina Virtuale. Tutti i conti visualizzati in **CONTO** devono avere 100 ether.

source: Deploying a contract
es: Desplegar un contrato
fr: Déployer un contrat
it: Distribuire un contratto

source: ![](images/a-run-testContract.png)
fr: ![](images/a-run-testContrat.png)

source: The constructor of `testContract` needs a parameter (of type `uint256`). Input a uint256 and click on `Deploy`.
es: El constructor de `testContract` necesita un parámetro (de tipo `uint256`). Introduzca un uint256 y haga clic en `Deploy`.
fr: Le constructeur de `testContract` a besoin d'un paramètre (de type `uint256`). Entrez un uint256 et cliquez sur `Deploy`.
it: Il costruttore di `testContract ` ha bisogno di un parametro (di tipo `uint256`). Inserire un uint256 e fare clic su `Distribuisci`.

source: The transaction is created which deploys the instance of `testContract` .
es: Se crea la transacción que despliega la instancia de `testContract` .
fr: La transaction est créée et déploie l'instance de `testContract`.
it: Viene creata una transazione che distribuisce l'istanza di `testContract`.

source: In a "normal" blockchain, you would have to wait for the transaction to be mined. However, because we are using the `JavaScript VM`, our execution is immediate.
es: En una blockchain "normal", habría que esperar a que se minara la transacción. Sin embargo, como estamos utilizando la `JavaScript VM`, nuestra ejecución es inmediata.
fr: Dans une blockchain "normale", vous devriez attendre que la transaction soit minée. Cependant, comme nous utilisons la VM JavaScript, notre exécution est immédiate.
it: In una blockchain "normale", si dovrebbe aspettare che la transazione venga processata. Tuttavia, poiché stiamo utilizzando la `Macchina Virtuale JavaScript`, la nostra esecuzione è immediata.

source: The terminal will give information about the transaction.
es: El terminal dará información sobre la transacción.
fr: Le terminal donne des informations sur la transaction.
it: Il terminale fornirà informazioni sulla transazione.

source: The newly created instance is displayed in the **Deployed Contracts** section.
es: La instancia recién creada aparece en la sección **Contratos desplegados**.
fr: L'instance nouvellement créée est affichée dans la section **Contrats déployés**.
it: L'istanza appena creata viene visualizzata nella sezione **Contratti distribuiti**.

source: Interacting with an instance
es: Interactuar con una instancia
fr: Interagir avec une instance
it: Interagire con un'istanza

source: Clicking on the caret to the left of the instance of TESTCONTRACT will open it up so you can see its function.
es: Si hace clic en el signo de intercalación situado a la izquierda de la instancia de TESTCONTRACT, se abrirá para que pueda ver su función.
fr: En cliquant sur la flèche à gauche de l'instance de TESTCONTRACT, vous l'ouvrirez pour voir sa fonction.
it: Facendo clic sul puntatore a sinistra dell'istanza di TESTCONTRACT, la si aprirà in modo da poterne vedere la funzione.

source: This new instance contains 3 actions which corresponds to the 3 functions (`setP`, `setPN`, `get`). Clicking on `setP` or `setPN` will create a new transaction.
es: Esta nueva instancia contiene 3 acciones que corresponden a las 3 funciones (`setP`, `setPN`, `get`). Al hacer clic en `setP` o `setPN` se creará una nueva transacción.
fr: Cette nouvelle instance contient 3 actions qui correspondent aux 3 fonctions (`setP`, `setPN`, `get`). En cliquant sur `setP` ou `setPN`, vous créez une nouvelle transaction.
it: Questa nuova istanza contiene 3 azioni che corrispondono alle 3 funzioni (`setP`, `setPN`, `get`). Facendo clic su `setP` o `setPN` si crea una nuova transazione.

source: Note that `setP` is `payable` (red button) : it is possible to send value (Ether) to the contract.
es: Observe que `setP` es `pagable` (botón rojo) : es posible enviar valor (Ether) al contrato.
fr: Notez que `setP` est `payable` (bouton rouge) : il est possible d'envoyer de la valeur (Ether) au contrat.
it: Si noti che `setP` è `pagabile` (pulsante rosso): è possibile inviare valore (Ether) al contratto.

source: `setPN` is not payable (orange button - depending on the theme) : it is not possible to send value (Ether) to the contract.
es: `setPN` no es pagable (botón naranja - según el tema) : no es posible enviar valor (Ether) al contrato.
fr: `setPN` n'est pas payable (bouton orange - selon le thème) : il n'est pas possible d'envoyer de la valeur (Ether) au contrat.
it: `setPN` non è pagabile (pulsante arancione - a seconda del tema): non è possibile inviare valore (Ether) al contratto.

source: Clicking on `get` will not execute a transaction (usually its a blue button - depending on the theme). It doesn't execute a transaction because a `get` does not modify the state (the variable `value`) of this instance.
es: Al hacer clic en `get` no se ejecuta una transacción (normalmente es un botón azul - dependiendo del tema). No ejecuta una transacción porque `get` no modifica el estado (la variable `value`) de esta instancia.
fr: Cliquer sur `get` n'exécutera pas de transaction (habituellement c'est un bouton bleu - selon le thème). Il n'exécute pas de transaction parce que `get` ne modifie pas l'état (la variable `value`) de cette instance.
it: Cliccando su `ottieni` non si esegue una transazione (di solito è un pulsante blu, a seconda del tema). Non esegue una transazione perché un `ottieni` non modifica lo stato (la variabile `valore`) di questa istanza.

source: Because `get` is a **view function**, you can see the return value just below the `get` button.
es: Como `get` es una **función vista**, puede ver el valor de retorno justo debajo del botón `get`.
fr: Comme `get` est une **fonction de vue**, vous pouvez voir la valeur de retour juste en dessous du bouton `get`.
it: Poiché `ottieni` è una **funzione di visualizzazione**, è possibile vedere il valore di ritorno proprio sotto il pulsante `ottieni`.
