Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/debugger.po
Languages: es, fr, it

source: Debugger
es: Depurador
fr: Débogueur

source: The Debugger shows the contract's state while stepping through a transaction.
es: El depurador muestra el estado del contrato mientras recorre una transacción.
fr: Le débogueur montre l'état du contrat lors de l'exécution d'une transaction.
it: Il Debugger mostra lo stato del contratto durante lo svolgimento di una transazione.

source: It can be used on transactions created on Remix or by providing a transaction's hash. The latter assumes that you have the contract's source code or that you have input the address of a verified contract.
es: Puede utilizarse en transacciones creadas en Remix o proporcionando el hash de una transacción. Esto último supone que usted dispone del código fuente del contrato o que ha introducido la dirección de un contrato verificado.
fr: Il peut être utilisé pour les transactions créées sur Remix ou en fournissant le hachage d'une transaction. Cette dernière solution suppose que vous disposiez du code source du contrat ou que vous ayez saisi l'adresse d'un contrat vérifié.
it: Può essere utilizzato su transazioni create su Remix o fornendo l'hash di una transazione. Quest'ultima condizione presuppone che si disponga del codice sorgente del contratto o che si sia inserito l'indirizzo di un contratto verificato.

source: To start a debugging session either:
es: Para iniciar una sesión de depuración
fr: Pour démarrer une session de débogage, vous pouvez soit
it: Per avviare una sessione di debug:

source: **Click** the debug button in the Terminal when a successful or failed transaction appears there. The Debugger will be activated and will gain the focus in the **Side Panel**.
es: **Haga clic** en el botón de depuración en el Terminal cuando aparezca allí una transacción exitosa o fallida. El depurador se activará y ganará el foco en el **panel lateral**.
fr: **Cliquez** sur le bouton de débogage dans le terminal lorsqu'une transaction réussie ou échouée y apparaît. Le débogueur sera activé et prendra le focus dans le **Panneau latéral**.
it: Fare **click** sul pulsante di debug nel Terminale quando viene visualizzata una transazione riuscita o fallita. Il Debugger verrà attivato e portato in primo piano nel **Pannello laterale**.

source: **Activate** the Debugger in the Plugin Manager and then click the bug in the icon panel. To start the debugging session, input the address of a deployed transaction - while having the source code in the editor and then click the **Start debugging** button.
es: **Active** el depurador en el Gestor de complementos y, a continuación, haga clic en el error del panel de iconos. Para iniciar la sesión de depuración, introduzca la dirección de una operación desplegada -mientras tiene el código fuente en el editor y, a continuación, haga clic en el botón **Iniciar depuración**.
fr: **Activez** le débogueur dans le gestionnaire de plugins et cliquez ensuite sur le bogue dans le panneau d'icônes. Pour démarrer la session de débogage, saisissez l'adresse d'une transaction déployée - tout en ayant le code source dans l'éditeur - puis cliquez sur le bouton **Débogage**.
it: **Attivare** il Debugger nel Plugin Manager e poi fare clic sul bug nel pannello delle icone. Per avviare la sessione di debug, inserire l'indirizzo di una transazione distribuita, mentre il codice sorgente è nell'editor, quindi fare clic sul pulsante **Avvia il debug**.

source: The debugger will highlight the relevant code in the Editor. If you want to go back to editing the code without the Debugger's highlights, then click the **Stop Debugging** button.
es: El depurador resaltará el código relevante en el Editor. Si desea volver a editar el código sin que el depurador lo resalte, haga clic en el botón **Detener depuración**.
fr: Le débogueur met en évidence le code concerné dans l'éditeur. Si vous souhaitez revenir à l'édition du code sans les surbrillances du débogueur, cliquez sur le bouton **Arrêter le débogage**.
it: Il debugger evidenzierà il codice pertinente nell'editor. Se si desidera tornare a modificare il codice senza le evidenziazioni del Debugger, fare clic sul pulsante **Ferma il debug**.

source: To learn more about how to use this tool go to the [Debugging Transactions](tutorial_debug.html) page.
es: Para saber más sobre cómo utilizar esta herramienta vaya a la página [Depuración de transacciones](tutorial_debug.html).
fr: Pour en savoir plus sur l'utilisation de cet outil, consultez la page [Debugging Transactions](tutorial_debug.html).
it: Per saperne di più sull'uso di questo strumento, consultare la pagina [Debug delle transazioni] (tutorial_debug.html).

source: This page will go over the Debugger's *Use generated sources* option, its navigation and its panels.
es: Esta página repasará la opción *Usar fuentes generadas* del depurador, su navegación y sus paneles.
fr: Cette page présente l'option *Utiliser les sources générées* du débogueur, sa navigation et ses panneaux.
it: Questa pagina illustra l'opzione *Usa sorgenti generate* del Debugger, la sua navigazione e i suoi pannelli.

source: Use generated sources
es: Utilizar fuentes generadas
fr: Utiliser les sources générées
it: Usa sorgenti generate

source: This option is available for contracts using Solidity 0.7.2 or greater. See the solidity blog for more details about [generated sourcess](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).
es: Esta opción está disponible para contratos que utilicen Solidity 0.7.2 o superior. Consulte el blog de solidity para obtener más detalles sobre [generated sourcess](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).
fr: Cette option est disponible pour les contrats utilisant Solidity 0.7.2 ou plus. Consultez le blog de Solidity pour plus de détails sur [generated sourcess](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).
it: Questa opzione è disponibile per i contratti che utilizzano Solidity 0.7.2 o superiore. Per maggiori dettagli su [generated sources](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features), consultare il blog di Solidity.

source: Using **generated sources** will make it easier to audit your contracts. When the option is checked, you can step into those compiler outputs — while debugging.
es: Utilizar **fuentes generadas** facilitará la auditoría de sus contratos. Cuando la opción está marcada, puede entrar en esas salidas del compilador - mientras depura.
fr: L'utilisation des **sources générées** facilitera l'audit de vos contrats. Lorsque l'option est cochée, vous pouvez accéder aux sorties du compilateur - pendant le débogage.
it: L'uso di **sorgenti generati** renderà più facile la verifica dei contratti. Quando l'opzione è selezionata, è possibile accedere ai risultati del compilatore durante il debug.

source: These compiler outputs will appear in a separate .yul file in the Remix editor.
es: Estas salidas del compilador aparecerán en un archivo .yul separado en el editor Remix.
fr: Ces sorties du compilateur apparaîtront dans un fichier .yul séparé dans l'éditeur Remix.
it: Questi output del compilatore appariranno in un file .yul separato nell'editor di Remix.

source: The Debugger's Navigation
es: La navegación del depurador
fr: Navigation dans le débogueur
it: La Navigazione del Debugger

source: Slider & buttons
es: Deslizador y botones
fr: Slider et boutons
it: Cursore & pulsanti

source: Slider
es: Deslizador
fr: Curseur
it: Cursore

source: Moving the slider will highlight the relevant code in the **Editor**. On the most granular level, it scrolls through a transaction's opcodes (**see the opcode section below**). At each opcode, the transaction's state changes and these changes are reflected in the **Debugger's panels**.
es: Al mover el control deslizante se resaltará el código correspondiente en el **Editor**. En el nivel más granular, se desplaza por los opcodes de una transacción (**véase la sección de opcodes más abajo**). En cada opcode, el estado de la transacción cambia y estos cambios se reflejan en los **paneles del depurador**.
fr: En déplaçant le curseur, vous mettez en évidence le code correspondant dans l'**Éditeur**. Au niveau le plus granulaire, il fait défiler les opcodes d'une transaction (**voir la section opcode ci-dessous**). À chaque opcode, l'état de la transaction change et ces changements sont reflétés dans les **panneaux du débogueur**.
it: Spostando il cursore si evidenzia il codice corrispondente nell'**Editor**. Al livello più fine, il cursore scorre i codici operativi di una transazione (**vedi la sezione codici operativi qui sotto**). Ad ogni codice operativo, lo stato della transazione cambia e questi cambiamenti si riflettono nei **pannelli del Debugger**.

source: Step over back
es: Paso atrás
fr: Enjamber le dossier
it: Passa sopra indietro

source: This button goes to the previous opcode. If the previous step involves a **function call**, function will not be entered.
es: Este botón va al opcode anterior. Si el paso anterior implica una **llamada a función**, no se introducirá la función.
fr: Ce bouton permet de passer à l'opcode précédent. Si l'étape précédente implique un **appel de fonction**, la fonction ne sera pas saisie.
it: Questo pulsante passa al codice operativo precedente. Se il passo precedente comporta una **invocazione di funzione**, la funzione non verrà inserita.

source: Step back
es: Paso atrás
fr: Reculez
it: Passo indietro

source: This button steps back to the previous opcode.
es: Este botón retrocede al opcode anterior.
fr: Ce bouton permet de revenir à l'opcode précédent.
it: Questo pulsante consente di tornare al codice operativo precedente.

source: Step into
es: Entre en
fr: Entrez dans
it: Passo avanti

source: This button advances to the next opcode. If the next line contains a function call, **Step into** will go into the function.
es: Este botón avanza al siguiente opcode. Si la siguiente línea contiene una llamada a una función, **Step into** entrará en la función.
fr: Ce bouton permet de passer à l'opcode suivant. Si la ligne suivante contient un appel de fonction, **Step into** passe à la fonction.
it: Questo pulsante consente di passare al codice operativo successivo. Se la riga successiva contiene una invocazione di funzione, **Passo avanti** entrerà nella funzione.

source: Step over forward
es: Paso adelante
fr: Avancez d'un pas
it: Passa sopra avanti

source: This button advances to the next opcode. If the next step involves a **function call**, function will not be entered.
es: Este botón avanza al siguiente opcode. Si el siguiente paso implica una **llamada a función**, no se introducirá la función.
fr: Ce bouton permet de passer à l'opcode suivant. Si l'étape suivante implique un **appel de fonction**, la fonction ne sera pas saisie.
it: Questo pulsante consente di passare al codice operativo successivo. Se il passo successivo comporta una **invocazione di funzione**, la funzione non verrà inserita.

source: Jump to the previous breakpoint
es: Saltar al punto de interrupción anterior
fr: Sauter au point d'arrêt précédent
it: Vai al punto di interruzione precedente

source: Breakpoints can be placed in the gutter of the Editor. If the current step in the call has passed a breakpoint, this button will move the slider to the most recently passed breakpoint.
es: Los puntos de ruptura pueden colocarse en el canalón del Editor. Si el paso actual de la llamada ha superado un punto de interrupción, este botón desplazará el control deslizante hasta el punto de interrupción superado más recientemente.
fr: Les points d'arrêt peuvent être placés dans la gouttière de l'éditeur. Si l'étape actuelle de l'appel a passé un point d'arrêt, ce bouton déplacera le curseur vers le dernier point d'arrêt passé.
it: I punti di interruzione possono essere posizionati nel riquadro dell'Editor. Se il passaggio corrente dell'invocazione ha superato un punto di interruzione, questo pulsante sposterà il cursore sul punto di interruzione superato più di recente.

source: Jump out
es: Salte
fr: Sauter
it: Salta fuori

source: When you are in a call and click on this button, the slider will be moved to the end of the call.
es: Cuando esté en una llamada y pulse este botón, el deslizador se desplazará al final de la llamada.
fr: Lorsque vous êtes en communication et que vous cliquez sur ce bouton, le curseur est déplacé à la fin de la communication.
it: Quando sei in un'invocazione e fai clic su questo pulsante, il cursore verrà spostato alla fine dell'invocazione.

source: Jump to the next breakpoint
es: Saltar al siguiente punto de interrupción
fr: Sauter au point d'arrêt suivant
it: Vai al prossimo breakpoint

source: If a breakpoint is ahead in the code, this button will advance to that point.
es: Si hay un punto de ruptura por delante en el código, este botón avanzará hasta ese punto.
fr: Si un point d'arrêt est avancé dans le code, ce bouton permet d'avancer jusqu'à ce point.
it: Se un punto di interruzione è più avanti nel codice, questo pulsante avanzerà a quel punto.

source: The Debugger's Panels
es: Los paneles del depurador
fr: Les panneaux du débogueur
it: I Pannelli del Debugger

source: Function Stack
es: Pila de funciones
fr: Pile de fonctions
it: Pila delle Funzioni

source: The Function stack lists the functions that the transaction is interacting with.
es: La pila de funciones enumera las funciones con las que interactúa la transacción.
fr: La pile de fonctions répertorie les fonctions avec lesquelles la transaction interagit.
it: Lo pila delle funzioni elenca le funzioni con cui la transazione sta interagendo.

source: Solidity Locals
es: Locales Solidarios
fr: Solidité Locale

source: The Solidity Locals are the local variables inside a function.
es: Las Solidity Locals son las variables locales dentro de una función.
fr: Les Solidity Locals sont les variables locales à l'intérieur d'une fonction.
it: Le "Solidity Locals" sono le variabili locali all'interno di una funzione.

source: Solidity State
es: Estado de solidez
fr: État de Solidité
it: Stato di Solidity

source: These are the state variables of the contract.
es: Estas son las variables de estado del contrato.
fr: Il s'agit des variables d'état du contrat.
it: Queste sono le variabili di stato del contratto.

source: This panel shows the step number and the **opcode** that the debugger is currently on.
es: Este panel muestra el número de paso y el **código de operación** en el que se encuentra actualmente el depurador.
fr: Ce panneau affiche le numéro d'étape et le **opcode** sur lequel le débogueur se trouve actuellement.
it: Questo pannello mostra il numero di passaggio e il **codice operativo** su cui si trova attualmente il debugger.

source: As you drag the **slider** (which is above the navigation buttons), the focussed step number & opcode changes.
es: Al arrastrar el **deslizador** (que está encima de los botones de navegación), el número de paso enfocado y el opcode cambian.
fr: Lorsque vous faites glisser le **slider** (qui se trouve au-dessus des boutons de navigation), le numéro d'étape et l'opcode focalisés changent.
it: Trascinando il **cursore** (che si trova sopra i pulsanti di navigazione), il numero del passaggio selezionato e il codice operativo cambiano.

source: Step details
es: Detalles del paso
fr: Détails des étapes
it: Dettagli del passaggio

source: Step details shows more info about the opcode step.
es: Detalles del paso muestra más información sobre el paso opcode.
fr: Détails de l'étape affiche plus d'informations sur l'étape de l'opcode.
it: I dettagli del passaggio mostrano ulteriori informazioni sul passaggio del codice operativo.

source: Stack
es: Pila
fr: Pile
it: Pila

source: This panel shows the EVM Stack.
es: Este panel muestra la pila EVM.
fr: Ce panneau présente la pile EVM.
it: Questo pannello mostra la pila EVM.

source: For more info about the [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).
es: Para más información sobre el [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).
fr: Pour plus d'informations sur le site [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).
it: Per maggiori informazioni sulla [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).

source: Memory
es: Memoria
fr: Mémoire
it: Memoria

source: Memory is cleared for each new message call. Memory is linear and can be addressed at byte level. **Reads** are limited to a width of 256 bits while **writes** can be either 8 bits or 256 bits wide.
es: La memoria se vacía para cada nueva llamada de mensaje. La memoria es lineal y puede direccionarse a nivel de byte. Las **lecturas** están limitadas a un ancho de 256 bits, mientras que las **escrituras** pueden tener un ancho de 8 bits o de 256 bits.
fr: La mémoire est vidée à chaque nouvel appel de message. La mémoire est linéaire et peut être adressée au niveau de l'octet. Les **lectures** sont limitées à une largeur de 256 bits tandis que les **écritures** peuvent avoir une largeur de 8 bits ou de 256 bits.
it: La memoria viene svuotata per ogni nuova invocazione di messaggio. La memoria è lineare e ci si può rivolgere a livello di byte. Le **letture** sono limitate a una larghezza di 256 bit, mentre le **scritture** possono essere di 8 o 256 bit.

source: The Memory panel consists of 3 columns. You might need to make Remix's side panel a bit wider to get the formatting to be correct. (Drag the border between the main panel and the side panel to the right).
es: El panel Memoria consta de 3 columnas. Puede que necesite hacer el panel lateral de Remix un poco más ancho para que el formato sea correcto. (Arrastre el borde entre el panel principal y el panel lateral hacia la derecha).
fr: Le panneau "Mémoire" se compose de 3 colonnes. Il se peut que vous deviez élargir un peu le panneau latéral de Remix pour que le formatage soit correct. (Faites glisser la bordure entre le panneau principal et le panneau latéral vers la droite).
it: Il pannello Memoria è composto da 3 colonne. Potrebbe essere necessario allargare un po' il pannello laterale di Remix per ottenere una formattazione corretta. (Trascina il bordo tra il pannello principale e quello laterale verso destra).

source: The 1st column is the location in memory. The 2nd column is the hex encoded value. The 3rd column is the decoded value. If there is nothing, then the question marks (**?**) will show - like this:
es: La 1ª columna es la ubicación en memoria. La 2ª columna es el valor codificado hexadecimal. La 3ª columna es el valor descodificado. Si no hay nada, aparecerán los signos de interrogación (**?**) - así:
fr: La première colonne est l'emplacement dans la mémoire. La 2ème colonne est la valeur codée en hexadécimal. La troisième colonne est la valeur décodée. S'il n'y a rien, les points d'interrogation (**?**) s'affichent - comme ceci :
it: La prima colonna è la posizione in memoria. La seconda colonna è il valore codificato in esadecimale. La terza colonna è il valore decodificato. Se non c'è nulla, vengono mostrati dei punti interrogativi (**?**), come in questo caso:

source: Here is a full example of the **Memory** panel,
es: Aquí tiene un ejemplo completo del panel **Memoria**,
fr: Voici un exemple complet du panneau **Mémoire**,
it: Ecco un esempio completo del pannello **Memoria**

source: Some address slots have hex encoded values and those values are then decoded. For example, check position **0xa0** and **0x140**.
es: Algunas posiciones de dirección tienen valores codificados en hexadecimal y esos valores se descodifican a continuación. Por ejemplo, compruebe la posición **0xa0** y **0x140**.
fr: Certains emplacements d'adresse ont des valeurs codées en hexadécimal et ces valeurs sont ensuite décodées. Par exemple, vérifiez les positions **0xa0** et **0x140**.
it: Alcuni slot di indirizzo hanno valori codificati in esadecimale e tali valori vengono poi decodificati. Ad esempio, controllare le posizioni **0xa0** e **0x140**.

source: Storage
es: Almacenamiento
fr: Stockage
it: Archiviazione

source: This is the persistant storage.
es: Se trata del almacenamiento persistente.
fr: Il s'agit du stockage persistant.
it: Questa è l'archiviazione permanente.

source: Call Stack
es: Pila de llamadas
fr: Pile d'appels
it: Stack di Chiamata

source: All computations are performed on a data array called the **call stack**. It has a maximum size of 1024 elements and contains words of 256 bits.
es: Todos los cálculos se realizan en una matriz de datos denominada **pila de llamadas**. Tiene un tamaño máximo de 1024 elementos y contiene palabras de 256 bits.
fr: Tous les calculs sont effectués sur un tableau de données appelé **pile d'appel**. Il a une taille maximale de 1024 éléments et contient des mots de 256 bits.
it: Tutte le computazioni sono eseguite su un array di dati chiamato **call stack**. Ha una grandezza massima di 1024 elementi e contiene parole di 256 bits.

source: Call Data
es: Datos de llamada
fr: Données d'appel
it: Dati di Chiamata

source: The call data contains the functions parameters.
es: Los datos de la llamada contienen los parámetros de las funciones.
fr: Les données d'appel contiennent les paramètres des fonctions.
it: I dati di chiamata contengono i parametri delle funzioni.

source: Return Value
es: Valor de retorno
fr: Valeur de retour
it: Valore Restituito

source: The refers to the value that the function will return.
es: Se refiere al valor que devolverá la función.
fr: Le fait référence à la valeur que la fonction renverra.
it: Si riferisce al valore che la funzione restituirà.

source: Full Storage Changes
es: Cambios en el almacenamiento completo
fr: Changements dans le stockage complet
it: Modifiche Complete dell'Archiviazione

source: This shows the persistant storage at the end of the function.
es: Esto muestra el almacenamiento persistente al final de la función.
fr: Cela montre le stockage persistant à la fin de la fonction.
it: Questo mostra l'archiviazione permanente alla fine della funzione.

source: Breakpoints
es: Puntos de interrupción
fr: Points d'arrêt
it: Punti di interruzione

source: Breakpoints can be placed in the gutter of the Editor to pause the debugger.
es: Se pueden colocar puntos de interrupción en el canalón del Editor para pausar el depurador.
fr: Des points d'arrêt peuvent être placés dans la gouttière de l'éditeur pour mettre le débogueur en pause.
it: Per mettere in pausa il debugger, è possibile posizionare dei punti di interruzione nel riquadro dell'editor.

source: Additional Info
es: Información adicional
fr: Informations complémentaires
it: Ulteriori Informazioni

source: The debugger's granular information gives users detailed information about what is happening in a transaction - so not only is the debugger good for debugging, it is also an excellent teaching tool.
es: La información granular del depurador ofrece a los usuarios información detallada sobre lo que ocurre en una transacción, por lo que no sólo es bueno para depurar, sino que también es una excelente herramienta de enseñanza.
fr: Les informations granulaires du débogueur donnent aux utilisateurs des informations détaillées sur ce qui se passe dans une transaction. Le débogueur n'est donc pas seulement utile pour le débogage, c'est aussi un excellent outil d'enseignement.
it: Le informazioni minuziose del debugger forniscono agli utenti informazioni dettagliate su ciò che accade in una transazione, quindi non solo il debugger è utile per il debugging, ma è anche un eccellente strumento didattico.
