Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/debugger.po
Languages: es, fr, it

source: To learn about using the debugger, go to [Debugging Transactions](tutorial_debug.html).
es: Para aprender a utilizar el depurador, vaya a [Depuración de transacciones](tutorial_debug.html).
fr: Pour en savoir plus sur l'utilisation du débogueur, consultez [Déboguer les transactions] (tutorial_debug.html).
it: Per imparare a usare il debugger, consultare [Debug delle transazioni] (tutorial_debug.html).

source: Opcodes
it: Codici operativi
