Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/FAQ.po
Languages: es, fr, it, zh_cn

source: FAQ
es: Preguntas Frecuentes (FAQ)
zh_cn: 常见问题

source: Supported devices & Browsers
es: Dispositivos soportados y navegadores
fr: Appareils et navigateurs pris en charge
it: Dispositivi e browser supportati
zh_cn: 支持的设备和浏览器

source: **Q:** What browsers will Remix work on?
es: **P:** ¿En qué navegadores funcionará Remix?
fr: **Q:** Quels sont les navigateurs sur lesquels Remix fonctionne ?
it: **D:** Su quali browser funzionerà Remix?
zh_cn: **问:** Remix可以在哪个浏览器上工作？

source: **A:** We support Firefox, Chrome, and Brave. We do not test or look for errors in Safari, Edge or other browsers.
es: **A:** Admitimos Firefox, Chrome y Brave. No probamos ni buscamos errores en Safari, Edge u otros navegadores.
fr: **A:** Nous prenons en charge Firefox, Chrome et Brave. Nous ne testons pas et ne recherchons pas les erreurs dans Safari, Edge ou d'autres navigateurs.
it: **R:** Supportiamo Firefox, Chrome e Brave. Non testiamo o cerchiamo errori in Safari, Edge o altri browser.
zh_cn: **答:** 我们支持Firefox、Chrome和Brave。我们没有测试和调查Safari、Edge或其他浏览器中的错误。

source: **Q:** Will Remix work on a tablet or mobile device?
es: **Q:** ¿Funcionará Remix en una tableta o dispositivo móvil?
fr: **Q:** Remix fonctionnera-t-il sur une tablette ou un appareil mobile ?
it: **D:** Remix funziona su un tablet o un dispositivo mobile?
zh_cn: **Q:** Remix会在平板电脑或移动设备上工作吗？

source: **A:** We do not support the use of Remix on tablets or mobile phones.
es: **A:** No admitimos el uso de Remix en tabletas o teléfonos móviles.
fr: **A:** Nous n'encourageons pas l'utilisation de Remix sur les tablettes ou les téléphones portables.
it: **R:** Non supportiamo l'uso di Remix su tablet o telefoni cellulari.
zh_cn: **答:** 我们不支持在平板电脑或移动设备上使用Remix。

source: General
fr: Général
it: Generali
zh_cn: 常规

source: **Q:** Are there keyboard shortcuts in Remix?
es: **Q:** ¿Existen atajos de teclado en Remix?
fr: **Q:** Y a-t-il des raccourcis clavier dans Remix ?
it: **D:** Ci sono scorciatoie da tastiera in Remix?
zh_cn: **问:** Remix中是否有键盘快捷键？

source: **A:** Yes - here is the list of keyboard shortcuts:
es: **A:** Sí - aquí está la lista de atajos de teclado:
fr: **A:** Oui - voici la liste des raccourcis clavier :
it: **R:** Sì, ecco l'elenco delle scorciatoie da tastiera:
zh_cn: **答:** 是 - 这里是键盘快捷键列表：

source: `Ctrl+Shift+F` : Opens the File Explorer
es: `Ctrl+Mayús+F` : Abre el Explorador de archivos
fr: Ctrl+Shift+F` : Ouvre l'explorateur de fichiers
it: `Ctrl+Shift+F` : Apre l'Esplora File
zh_cn: `Ctrl+Shift+F`: 打开文件浏览器

source: `Ctrl+Shift+A` : Opens the Plugin Manager
es: `Ctrl+Mayús+A` : Abre el Gestor de Plugins
fr: `Ctrl+Shift+A` : Ouvre le gestionnaire de plugins
it: `Ctrl+Shift+A` : Apre il Gestore dei Plugin
zh_cn: `Ctrl+Shift+A` : 打开插件管理器

source: `Ctrl+S`: Compiles the active Solidity file
es: `Ctrl+S`: Compila el archivo Solidity activo
fr: `Ctrl+S` : Compile le fichier Solidity actif
it: `Ctrl+S`: Compila il file Solidity attivo
zh_cn: `Ctrl+S`: 编译选中的 Solidity 文件

source: `Ctrl+Shift+S`: Compiles a Solidity file and runs a script when the script is displayed in the editor.<br>(go [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) more info about this functionality)
es: `Ctrl+Mayús+S`: Compila un archivo Solidity y ejecuta un script cuando éste se muestra en el editor.<br>(vaya a [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) más información sobre esta funcionalidad)
fr: Ctrl+Shift+S` : Compile un fichier Solidity et exécute un script lorsque le script est affiché dans l'éditeur.<br>(allez sur [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) pour plus d'informations sur cette fonctionnalité)
it: `Ctrl+Shift+S`: Compila un file Solidity ed esegue uno script quando lo script è visualizzato nell'editor.<br>(vai [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) per avere maggiori informazioni riguardo questa funzionalità)
zh_cn: `Ctrl+Shift+S`: 编译一个Solidity文件或者当编辑器中显示脚本时运行一个脚本。<br>( [这里](running_js_scripts.html#compile-a-contract-andrun-a-script-only) 更多关于此功能的信息)

source: Solidity compiler
es: Compilador Solidity
fr: Compilateur Solidity
it: Compilatore di Solidity
zh_cn: Solidity 编译器

source: **Q:** Error: compiler might be in a non-sane state
es: **Q:** Error: el compilador podría estar en un estado no cuerdo
fr: **Q:** Erreur : le compilateur n'est peut-être pas dans un état normal.
it: **D:** Errore: il compilatore potrebbe essere in uno stato non sano
zh_cn: **问：**错误：编译器可能处于非正常状态

source: **A:** Old versions of solidity compiler had this problem with chrome. Please change the compiler version in Solidity Plugin to the newer one or use another browser.
es: **A:** Las versiones antiguas del compilador Solidity tenían este problema con Chrome. Por favor, cambie la versión del compilador en Solidity Plugin por la más reciente o utilice otro navegador.
fr: **A:** Les anciennes versions du compilateur Solidity avaient ce problème avec Chrome. Veuillez changer la version du compilateur dans Solidity Plugin pour la plus récente ou utiliser un autre navigateur.
it: **R:** Le vecchie versioni del compilatore di Solidity avevano questo problema con Chrome. Si prega di cambiare la versione del compilatore in Solidity Plugin con una più recente o di usare un altro browser.
zh_cn: **答：**旧版本的solidity 编译器在chrome 中存在这个问题。请将 Solidity Plugin 中的编译器版本更改为较新的版本或使用其他浏览器。

source: **Q:** I’m getting an issue with Maximum call stack exceed and various other errors, can't compile.
es: **Q:** Estoy recibiendo un problema con la pila de llamada máxima excede y varios otros errores, no se puede compilar.
fr: **Q:** J'ai un problème avec Maximum call stack exceed et d'autres erreurs, je ne peux pas compiler.
it: **D:** Ho un problema con stack di chiamate massimo superato e vari altri errori, non posso compilare.
zh_cn: **问:** 我遇到了一个问题：超过了最大调用堆栈，还有其他各种错误，最终无法编译。

source: **A:** Try a different browser or a newer solidity compiler version.
es: **A:** Pruebe con otro navegador o con una versión más reciente del compilador de solidity.
fr: **A:** Essayez un autre navigateur ou une version plus récente du compilateur Solidity.
it: **R:** Prova un browser diverso o una versione più recente del compilatore di Solidity.
zh_cn: **答：**尝试不同的浏览器或更新的solidity 编译器版本。

source: **Q:** How to verify a contract that imports other contracts?
es: **Q:** ¿Cómo verificar un contrato que importa otros contratos?
fr: **Q:** Comment vérifier un contrat qui importe d'autres contrats ?
it: **D:** Come verificare un contratto che importa altri contratti?
zh_cn: **问：**如何验证导入其他合约的合约？

source: **A:** The verification tool does not recursively go through the import statements in a contract. So can only verify a 'flattened' contract.
es: **A:** La herramienta de verificación no recorre recursivamente las declaraciones de importación de un contrato. Por tanto, sólo puede verificar un contrato "aplanado".
fr: **A:** L'outil de vérification ne parcourt pas de manière récursive les déclarations d'importation d'un contrat. Il ne peut donc vérifier qu'un contrat "aplati".
it: **R:** Lo strumento di verifica non rivede le dichiarazioni d'importazione ricorsivamente in un contratto. Quindi può verificare solo un contratto "appiattito".
zh_cn: **答：**验证工具不会递归地遍历合约中的导入语句。 所以只能验证一个“扁平化”的合约。

source: There is a plugin called `Flattener` which will stuff all the original code and the imported code into a single file.
es: Existe un plugin llamado `Flattener` que meterá todo el código original y el importado en un único archivo.
fr: Il existe un plugin appelé `Flattener` qui va regrouper tout le code original et le code importé dans un seul fichier.
it: C'è un plugin chiamato "Flattener" che metterà tutto il codice originale e il codice importato in un singolo file.
zh_cn: 有一个名为 `Flattener` 的插件，它可以将所有原始代码和导入的代码压缩到单个文件中。

source: Deploy & Run
es: Despliegue y ejecución
fr: Déployer & Exécuter
it: Distribuisci & Esegui
zh_cn: 部署和运行

source: **Q:** I am using an Infura endpoint in my app, but when I try to deploy against that endpoint in Remix IDE selecting "External HTTP Provider" and putting my endpoint in, it's telling me that it can't connect
es: **Q:** Estoy usando un endpoint Infura en mi app, pero cuando intento desplegar contra ese endpoint en Remix IDE seleccionando "Proveedor HTTP externo" y poniendo mi endpoint, me dice que no puede conectar
fr: **Q:** J'utilise un point de terminaison Infura dans mon application, mais lorsque j'essaie de déployer contre ce point de terminaison dans Remix IDE en sélectionnant "External HTTP Provider" et en mettant mon point de terminaison, il me dit qu'il ne peut pas se connecter.
it: **D:** Sto usando un endpoint Infura nella mia applicazione, ma quando cerco di distribuire contro quell'endpoint nella IDE di Remix selezionando "Provider HTTP Esterno" e inserendo il mio endpoint, mi dice che non può connettersi
zh_cn: **问：** 我在我的应用程序中使用Infura节点，但是当我尝试在Remix IDE中选择“外部HTTP provider” 并将我的节点放入以便基于该节点进行部署时，它告诉我无法连接。

source: **A:** If the endpoint you are using is http, it won't work.
es: **A:** Si el punto final que está utilizando es http, no funcionará.
fr: **A:** Si le point de terminaison que vous utilisez est http, cela ne fonctionnera pas.
it: **R:** Se l'endpoint che stai usando è http, non funzionerà.
zh_cn: **答：** 如果您使用的端点是http，它将无法正常工作。

source: **Q:** Where is deploy button?
es: **Q:** ¿Dónde está el botón de despliegue?
fr: **Q:** Où se trouve le bouton de déploiement ?
it: **D:** Dove si trova il pulsante di distribuzione?
zh_cn: **问：** 部署按钮在哪里？

source: **A:** Its in the Deploy & Run module. If you haven't activated that module, you should do that by clicking Deploy & Run module in the Plugin Manager. You could also activate everything you need to work with solidity on the landing page ( click the remix logo at the top left for the screen) and click the "Solidity" button in the environment section.
es: **A:** Está en el módulo Deploy & Run. Si no ha activado ese módulo, debería hacerlo haciendo clic en el módulo Deploy & Run en el Gestor de Plugins. También podría activar todo lo necesario para trabajar con solidez en la página de inicio ( haga clic en el logotipo de remix en la parte superior izquierda para la pantalla) y haga clic en el botón "Solidez" en la sección de entorno.
fr: **A:** C'est dans le module Deploy & Run. Si vous n'avez pas activé ce module, vous devriez le faire en cliquant sur le module Deploy & Run dans le Plugin Manager. Vous pouvez également activer tout ce dont vous avez besoin pour travailler avec Solidity sur la page d'accueil (cliquez sur le logo remix en haut à gauche de l'écran) et cliquez sur le bouton "Solidity" dans la section environnement.
it: **R:** Si trova nel modulo Distribuisci & Esegui. Se non hai attivato quel modulo, puoi farlo cliccando sul modulo Distribuisci & Esegui nel Gestore di Plugin. Puoi anche attivare tutto ciò che ti serve per lavorare con solidity nella pagina di destinazione (clicca il logo di Remix nell'angolo in alto a sinistra dello schermo) e clicca il pulsante "Solidity" nella sezione ambiente.
zh_cn: **答:** 它在Deploy & Run模块中。如果您还没有激活该模块，可以通过单击插件管理器中的`Deploy & Run`模块来激活它。您也可以在登陆页上激活所有需要使用 Solidity 的插件（点击屏幕左上角的 Remix logo），并在环境部分点击“Solidity”按钮。

source: **Q:** How to pass a tuple to a public function in Remix?
es: **Q:** ¿Cómo pasar una tupla a una función pública en Remix?
fr: **Q:** Comment passer un tuple à une fonction publique dans Remix ?
it: **D:** Come passare una tupla a una funzione pubblica in Remix?
zh_cn: **问：**如何将元组传递给 Remix 中的公共函数？

source: **A:** Pass it as an array [].
es: **A:** Páselo como una matriz [].
fr: **A:** Passez-la sous forme de tableau [].
it: **R:** La si passa come una matrice [].
zh_cn: **答：** 将其作为数组 [] 传递。

source: **Q:** How to input a struct as input to a parameter of a function in the Deploy & Run module?
es: **Q:** ¿Cómo introducir una estructura como entrada a un parámetro de una función en el módulo Deploy & Run?
fr: **Q:** Comment saisir une structure en tant que paramètre d'une fonction dans le module Deploy & Run ?
it: **D:** Come inserire una "struct" come input per un parametro di una funzione nel modulo Distribuisci & Esegui?
zh_cn: **问：** 如何在Deploy & Run模块中输入一个struct作为函数参数的输入？

source: **A:** For inputting a struct, just like a tuple, pass it in as an array []. Also you need to put in the line:
es: **A:** Para introducir una estructura, al igual que una tupla, pásela como una matriz []. También tiene que poner la línea
fr: **A:** Pour saisir une structure, tout comme un tuple, passez-la sous la forme d'un tableau []. Vous devez également ajouter la ligne :
it: **R:** Per inserire una "struct", proprio come una tupla, passala come una matrice []. Devi anche inserire la riga:
zh_cn: **答：** 输入一个结构体，就像一个元组一样，将它作为一个数组[] 传入。 您还需要输入以下内容：

source: `pragma experimental ABIEncoderV2;` at the top of the solidity file.
es: `pragma experimental ABIEncoderV2;` en la parte superior del archivo solidity.
fr: `pragma experimental ABIEncoderV2;` au début du fichier solidity.
it: `pragma experimental ABIEncoderV2;` all'inizio del file solidity.
zh_cn: `pragma experimental ABIEncoderV2;` 在solidity文件的顶部。

source: For example, here's a solidity file with a struct is an input parameter.
es: Por ejemplo, aquí hay un archivo solidity con un struct es un parámetro de entrada.
fr: Par exemple, voici un fichier Solidity dont le paramètre d'entrée est une structure.
it: Ad esempio, ecco un file Solidity con una "struct" come parametro di ingresso.
zh_cn: 例如，这里有一个带有 struct 的solidity 文件作为输入参数。

source: The input of initPeepToPeeps takes a struct. If you input `[1,2]` the transaction will go through.
es: La entrada de initPeepToPeeps toma un struct. Si introduce `[1,2]` la operación se realizará.
fr: L'entrée de initPeepToPeeps prend une structure. Si vous entrez `[1,2]`, la transaction sera effectuée.
it: L'input di initPeepToPeeps prende una "struct". Se si inserisce `[1,2]` la transazione andrà a buon fine.
zh_cn: initPeepToPeeps的输入需要一个结构体。如果您输入`[1,2]`，交易将会通过。

source: Plugin Developers
es: Desarrolladores de plugins
fr: Développeurs de plugins
it: Sviluppatori di Plugin
zh_cn: 插件开发者

source: **Q:** Where do plugin developers go with their questions?
es: **Q:** ¿A dónde van los desarrolladores de plugins con sus preguntas?
fr: **Q:** Où les développeurs de plugins posent-ils leurs questions ?
it: **D:** Dove possono porre le loro domande gli sviluppatori di plugin?
zh_cn: **问：** 插件开发人员会去哪里解决他们的问题？

source: **A:** The Gitter Remix plugin developers room https://gitter.im/ethereum/remix-dev-plugin
es: **A:** La sala de desarrolladores del plugin Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
fr: **A:** La salle des développeurs du plugin Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
it: **R:** La stanza degli sviluppatori dei plugin di Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
zh_cn: **答：** Gitter Remix插件开发者房间 `https://gitter.im/ethereum/remix-dev-plugin`

source: Analytics
es: Analítica
fr: Analyse
it: Analisi
zh_cn: 数据分析

source: **Q:** What information does Remix save when Matomo Analytics is enabled?
es: **Q:** ¿Qué información guarda Remix cuando se activa Matomo Analytics?
fr: **Q:** Quelles informations Remix enregistre-t-il lorsque Matomo Analytics est activé ?
it: **D:** Quali informazioni salva Remix quando Matomo Analytics è abilitato?
zh_cn: **问:** 当Matomo Analytics启用时，要保存哪些信息？

source: **A:** We want to know:
es: **A:** Queremos saberlo:
fr: **A:** Nous voulons savoir :
it: **R:** Vogliamo sapere:
zh_cn: **答:** 我们想知道：

source: Which plugins get activated & deactivated
es: Qué plugins se activan y desactivan
fr: Quels plugins sont activés et désactivés
it: Quali plugin vengono attivati & disattivati
zh_cn: 哪些插件被激活和停用

source: If users check the box to publish a contract's metadata when deploying
es: Si los usuarios marcan la casilla para publicar los metadatos de un contrato al desplegar
fr: Si les utilisateurs cochent la case pour publier les métadonnées d'un contrat lors de son déploiement
it: Se gli utenti selezionano la casella per pubblicare i metadati di un contratto durante la distribuzione
zh_cn: 如果用户在部署时勾选框来发布合约的元数据

source: Which themes are used/used most/not used at all
es: Qué temas se utilizan/utilizan más/no se utilizan en absoluto
fr: Quels sont les thèmes utilisés, les plus utilisés et les moins utilisés ?
it: Quali temi sono usati/usati di più/non utilizzati del tutto
zh_cn: 哪个主题被使用/使用最多/根本不使用

source: The usage of the links to documentation
es: El uso de los enlaces a la documentación
fr: L'utilisation des liens vers la documentation
it: L'utilizzo dei link alla documentazione
zh_cn: 文档链接的使用

source: On the homepage, which file importing buttons are used
es: En la página de inicio, qué botones de importación de archivos se utilizan
fr: Sur la page d'accueil, quels sont les boutons d'importation de fichiers utilisés ?
it: Nella homepage, quali pulsanti di importazione di file sono utilizzati
zh_cn: 在主页上使用了哪个文件导入按钮

source: **Q:** Is it opt-in or opt-out?
es: **Pregunta:** ¿Es opt-in o opt-out?
fr: **Q:** S'agit-il d'un opt-in ou d'un opt-out ?
it: **D:** È opt-in o opt-out?
zh_cn: **问:** 是选择加入还是选择退出？

source: **A:** We use Matomo as an opt-in analytics platform.
es: **A:** Utilizamos Matomo como plataforma de análisis opt-in.
fr: **A:** Nous utilisons Matomo comme plateforme d'analyse opt-in.
it: **R:** Usiamo Matomo come piattaforma di analisi opt-in.
zh_cn: **答:** 我们使用Matomo作为一种选择加入的分析平台。

source: **Q:** Where is the info stored? Is the info shared with 3rd parties?
es: **Q:** ¿Dónde se almacena la información? ¿Se comparte la información con terceros?
fr: **Q:** Où les informations sont-elles stockées ? Les informations sont-elles partagées avec des tiers ?
it: **D:** Dove sono memorizzate le informazioni? Le informazioni sono condivise con terze parti?
zh_cn: **Q:** 信息存储在哪里？信息是否与第三方共享？

source: **A:** All data collected through Matomo is stored on our own server. No data is given to third parties.
es: **A:** Todos los datos recogidos a través de Matomo se almacenan en nuestro propio servidor.No se facilita ningún dato a terceros.
fr: **Toutes les données collectées par Matomo sont stockées sur notre propre serveur.Aucune donnée n'est transmise à des tiers.
it: **R:** Tutti i dati raccolti tramite Matomo vengono memorizzati sul nostro server. Nessun dato viene condiviso a terzi.
zh_cn: **答：** 通过Matomo收集的所有数据都存储在我们自己的服务器上。不会将任何数据提供给第三方。

source: We respect your privacy and do not collect nor store any personally identifiable information (PII).
es: Respetamos su privacidad y no recopilamos ni almacenamos ninguna información personal identificable (IPI).
fr: Nous respectons votre vie privée et ne collectons ni ne conservons aucune information personnelle identifiable (IPI).
it: Rispettiamo la tua privacy e non raccogliamo né memorizziamo alcuna informazione di identificazione personale (PII, dall'inglese "personally identifiable information").
zh_cn: 我们尊重您的隐私，不收集或储存任何可识别个人身份的信息。

source: **Q:** What does Remix do with this info?
es: **Q:** ¿Qué hace Remix con esta información?
fr: **Q:** Que fait Remix avec ces informations ?
it: **D.** Che cosa fa Remix con questa informazione?
zh_cn: **问:** Remix使用这些信息做什么？

source: **A:** Our goal is to understand how many users we have, what plugins people are using, what is not getting used, what is not being used to its full potential.
es: **A:** Nuestro objetivo es comprender cuántos usuarios tenemos, qué plugins utiliza la gente, qué no se utiliza, qué no se aprovecha todo su potencial.
fr: **A:** Notre objectif est de comprendre combien d'utilisateurs nous avons, quels plugins les gens utilisent, ce qui n'est pas utilisé, ce qui n'est pas utilisé à son plein potentiel.
it: **R.** Il nostro obiettivo è capire quanti utenti abbiamo, che plugin usano, cosa non viene utilizzato e cosa non viene utilizzato al suo pieno potenziale.
zh_cn: **答:** 我们的目标是了解我们有多少用户，人们正在使用哪些插件， 哪些插件没有被使用，哪些插件没有充分发挥它们的潜力。

source: With this understanding, we can make adjustments to the UI as well as providing more tips and documentation. It's a way of getting constant anonymous feedback from our users.
es: Con este conocimiento, podemos hacer ajustes en la interfaz de usuario, así como proporcionar más consejos y documentación. Es una forma de obtener constantes comentarios anónimos de nuestros usuarios.
fr: Grâce à cette compréhension, nous pouvons apporter des ajustements à l'interface utilisateur et fournir davantage de conseils et de documentation. C'est un moyen d'obtenir un retour d'information anonyme et constant de la part de nos utilisateurs.
it: Con questa informazione possiamo fare degli aggiustamenti alla UI oltre a fornire più suggerimenti e documentazione. È un modo di ricevere un feedback anonimo costante con i nostri utenti.
zh_cn: 基于这种理解，我们可以调整用户界面，并提供更多的建议和文档。 这是从我们的用户获得匿名反馈的一种方式。

source: **Q:** After I agree opt-in, can I change my mind?
es: **Pregunta:** Después de aceptar el opt-in, ¿puedo cambiar de opinión?
fr: **Q:** Après avoir accepté l'opt-in, puis-je changer d'avis ?
it: **D.** Dopo aver acconsentito con opt-in, posso cambiare idea?
zh_cn: **问:** 在我同意加入后，我能否改变主意？

source: **A:** You can turn off or on Matomo in the Settings panel. There are no consequences for not opting-in or opting-out.
es: **A:** Puede activar o desactivar Matomo en el panel de Configuración. No hay consecuencias por no activarlo o desactivarlo.
fr: **Vous pouvez activer ou désactiver Matomo dans le panneau des paramètres. Il n'y a pas de conséquences à l'absence d'opt-in ou d'opt-out.
it: **R.** Puoi accendere o spegnere Matomo nel pannello di controllo. Non ci sono conseguenze se decidi di fare opt-in oppure opt-out.
zh_cn: **答:** 您可以在设置面板中关闭或在 Matomo 上关闭。不选择加入或选择退出不会有任何后果。
