Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/file_explorer.po
Languages: es, it

source: File Explorer
es: Explorador de archivos
it: Esplora file

source: The File Explorer is for managing workspaces and files. This plugin also contains many shortcuts and commands. For a quick tour, right-click on a file to get a pop-up menu and also check the hamburger menu at the top right of the plugin.
es: El Explorador de archivos sirve para gestionar espacios de trabajo y archivos. Este plugin también contiene muchos accesos directos y comandos. Para una visita rápida, haga clic con el botón derecho en un archivo para obtener un menú emergente y consulte también el menú hamburguesa situado en la parte superior derecha del plugin.
it: L'Esplora file serve a gestire le aree di lavoro e i file. Questo plugin contiene anche molti comandi rapidi e comandi. Per un breve tour, cliccare con il tasto destro su un file per ottenere un menu a comparsa e controllare anche il menu a forma di hamburger (rappresentato con tre linette orizzontali) in alto a destra del plugin.

source: To find the File Explorer module - click the File Explorer icon.
es: Para encontrar el módulo Explorador de archivos - haga clic en el icono Explorador de archivos.
it: Per trovare il modulo Esplora file, fare clic sull'icona File Explorer (Esplora file).

source: The green checkmark at the top of the page means that this plugin is maintained by Remix Team. When the caret is clicked, more info about the plugin will be shown -including a link to this documentation.
es: La marca verde en la parte superior de la página significa que este plugin está mantenido por Remix Team. Al hacer clic en la marca, aparecerá más información sobre el complemento, incluido un enlace a esta documentación.
it: Il segno di spunta verde in cima alla pagina significa che questo plugin è gestito dal Team di Remix. Quando si clicca sul puntatore, vengono mostrate più informazioni sul plugin - compreso un link a questa documentazione.

source: File Storage
es: Almacenamiento de archivos
it: Memorizzazione dei file

source: By default, Remix IDE stores files in **IndexedDB**.
es: Por defecto, Remix IDE almacena los archivos en **IndexedDB**.
it: Per impostazione predefinita, l'IDE Remix memorizza i file nell'**IndexedDB**.

source: Coding in Remix IDE Online is different from writing in a Google doc.
es: Codificar en Remix IDE Online es diferente a escribir en un documento de Google.
it: Programmare nell'IDE di Remix Online è differente dallo scrivere in un documento di Google.

source: A Google doc saves your work to your account on Google’s servers.
es: Un documento de Google guarda su trabajo en su cuenta en los servidores de Google.
it: Un documento di Google salva il vostro lavoro nel vostro account sui server di Google.

source: Remix has no user accounts. By default, files are ONLY saved locally in the browser’s storage. So tread carefully, browser storage is not permanent!
es: Remix no tiene cuentas de usuario. Por defecto, los archivos SÓLO se guardan localmente en el almacenamiento del navegador. Así que tenga cuidado, ¡el almacenamiento del navegador no es permanente!
it: Remix non ha gli account utente. Per impostazione predefinita, i file vengono salvati SOLO localmente nella memoria del browser. Quindi fate attenzione, la memoria del browser non è permanente!

source: It is very important to have a file backup & file saving strategy.
es: Es muy importante contar con una estrategia de copia de seguridad y guardado de archivos.
it: È molto importante avere una strategia di backup e di salvataggio dei file.

source: **Check the following techniques for:**
es: **Compruebe las siguientes técnicas para:**
it: **Consulta le seguenti tecniche per:**

source: [saving to your hard drive](#file-storage-on-your-hard-drive)
es: [guardar en su disco duro](#almacenamiento-de-archivos-en-su-disco-duro)
it: [salvataggio sul tuo disco rigido](#file-storage-on-your-hard-drive)

source: using [remote Git repos](#connecting-remix-to-remote-git-repos)
es: utilizando [repos Git remotos](#connecting-remix-to-remote-git-repos)
it: utilizzare [repository Git remoti](#connecting-remix-to-remote-git-repos)

source: [backing up workspaces](#backup).
es: [copia de seguridad de los espacios de trabajo](#backup).
it: [backup delle aree di lavoro](#backup).

source: **Important Note:** Clearing the browser storage & IndexedDB will **permanently delete** all the files stored there. It is prudent to backup your workspaces before deleting them...just in case.
es: **Nota Importante:** Borrar el almacenamiento del navegador & IndexedDB borrará **permanentemente** todos los archivos allí almacenados. Es prudente hacer una copia de seguridad de sus espacios de trabajo antes de borrarlos... por si acaso.
it: **Nota importante:** La cancellazione della memoria del browser e dell'IndexedDB cancellerà **permanentemente** tutti i file memorizzati. È prudente eseguire un backup delle aree di lavoro prima di cancellarli... giusto per essere sicuri.

source: File Storage on your hard drive
es: Almacenamiento de archivos en su disco duro
it: Memorizzazione dei file sul tuo disco rigido

source: For storing files on your computer's hard drive when using Remix Online IDE, use **[Remixd](remixd.html)**
es: Para almacenar archivos en el disco duro de su ordenador cuando utilice Remix Online IDE, utilice **[Remixd](remixd.html)**.
it: Per memorizzare i file sul disco rigido del tuo computer quando si utilizza l'IDE di Remix Online, utilizzare **[Remixd](remixd.html)**

source: Remixd is an NPM module that runs on your computer. It allows you to share a specified folder on your computer with Remix IDE.
es: Remixd es un módulo NPM que se ejecuta en su ordenador. Le permite compartir una carpeta específica de su ordenador con Remix IDE.
it: Remixd è un modulo NPM che viene eseguito sul computer. Permette di condividere una cartella specifica sul tuo computer con l'IDE di Remix.

source: Remix Desktop is a version of Remix IDE in an Electron app. Note that when using Remix Desktop, you cannot use a browser wallet like MetaMask, because Remix Desktop does not run in a browser. To connect to public networks, you need to use service like Infura and then use the WalletConnect plugin to approve transactions on your mobile device.
es: Remix Desktop es una versión de Remix IDE en una aplicación Electron. Tenga en cuenta que cuando utilice Remix Desktop, no podrá utilizar una cartera de navegador como MetaMask, porque Remix Desktop no se ejecuta en un navegador. Para conectarse a redes públicas, necesita utilizar un servicio como Infura y después utilizar el complemento WalletConnect para aprobar las transacciones en su dispositivo móvil.
it: Remix Desktop è una versione dell'IDE di Remix in un'applicazione Electron. Da notare che, quando si utilizza Remix Desktop, non è possibile utilizzare un portafoglio per il browser come MetaMask, perché Remix Desktop non viene eseguito in un browser. Per connettersi alle reti pubbliche, è necessario utilizzare un servizio come Infura e poi utilizzare il plugin WalletConnect (connetti portafoglio) per approvare le transazioni sul proprio dispositivo mobile.

source: Connecting Remix to remote Git repos
es: Conexión de Remix a repos remotos Git
it: Connettere Remix ai repository Git remoti

source: **If you are not using Remixd, it is highly recommended that you save to a remote repo.** (Browsers do crash causing localstorage & indexedDB to be corrupted)
es: **Si no está utilizando Remixd, es muy recomendable que guarde en un repositorio remoto.** (Los navegadores se bloquean causando que localstorage & indexedDB se corrompan)
it: **Se non si utilizza Remixd, si raccomanda fortemente di salvare su un archivio remoto (i browser si bloccano causando il danneggiamento di localstorage e dell'indexedDB)

source: Remix IDE can be connected to remote Git repos hosted in GitHub (or similar service) or in IPFS. Most of the Git operations are done in the **DGit** pluin. (DGit stands for Decentralized GIT).
es: Remix IDE puede conectarse a repositorios Git remotos alojados en GitHub (o servicio similar) o en IPFS. La mayoría de las operaciones Git se realizan en el pluin **DGit**. (DGit significa GIT descentralizado).
it: L'IDE di Remix può essere collegato a repository Git remoti ospitati su GitHub (o un servizio simile) o su IPFS. La maggior parte delle operazioni Git sono eseguite nel pluin **DGit**. (DGit sta per GIT decentralizzato).

source: [Branch management](#branch-management) is also available at the bottom of the File Explorer when the Workspace is Git initialized.
es: La [Gestión de ramas](#gestión-de-ramas) también está disponible en la parte inferior del Explorador de archivos cuando se inicializa el Espacio de trabajo Git.
it: La [Gestione dei rami] (#branch-management) è disponibile anche nella parte inferiore dell'Esplora file quando l'area di lavoro è inizializzata con Git.

source: Also see this article about [securing your files in Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)
es: Consulte también este artículo sobre [la seguridad de sus archivos en Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)
it: Si veda anche questo articolo su [proteggere i file in Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)

source: Workspaces
es: Espacios de trabajo
it: Aree di lavoro

source: Workspaces in Remix are special folders that separate projects. Files in one workspace cannot import or access files in different workspace. Choosing a workspace is done with the **Workspaces** select box.
es: Los espacios de trabajo en Remix son carpetas especiales que separan los proyectos. Los archivos de un espacio de trabajo no pueden importar archivos de otro espacio de trabajo ni acceder a ellos. La elección de un espacio de trabajo se realiza con la casilla de selección **Espacios de trabajo**.
it: Gli spazi di lavoro in Remix sono cartelle speciali che separano i progetti. I file in uno spazio di lavoro non possono importare o accedere a file in spazi di lavoro diversi. La scelta di uno spazio di lavoro si effettua con la casella di selezione **Workspaces** (Spazi di lavoro).

source: New Workspace
es: Nuevo espacio de trabajo
it: Nuova area di lavoro

source: Workspaces are created by clicking the + button or by going to the hamburger menu in the upper right side of the File Explorer.
es: Los espacios de trabajo se crean pulsando el botón + o yendo al menú hamburguesa de la parte superior derecha del Explorador de archivos.
it: Le aree di lavoro si creano facendo clic sul pulsante + o accedendo al menu hamburger (rappresentato da tre lineette orizzontali) in alto a destra dell'Esplora file.

source: When making a new workspace, Remix offers the following templates:
es: Al crear un nuevo espacio de trabajo, Remix ofrece las siguientes plantillas:
it: Quando si crea una nuova are di lavoro, Remix offre i seguenti modelli:

source: Blank
es: En blanco
it: Blank (Vuoto)

source: Remix Default
es: Remezcla por defecto
it: Remix Default (Predefinito Remix)

source: 0xProject ERC20
es: 0xProyecto ERC20

source: When choosing an OpenZeppelin template, additional functionality can be added. ![](images/a-fe-modal-oz.png)
es: Al elegir una plantilla OpenZeppelin, se pueden añadir funciones adicionales. ![](images/a-fe-modal-oz.png)
it: Quando si sceglie un modello OpenZeppelin, è possibile aggiungere ulteriori funzionalità. ![](images/a-fe-modal-oz.png)

source: Workspace operations
es: Operaciones en el espacio de trabajo
it: Operazioni dell'area di lavoro

source: The **Workspace hamburger menu** is for operations that work on an entire workspace.
es: El **menú hamburguesa del espacio de trabajo** es para las operaciones que funcionan en todo un espacio de trabajo.
it: Il menu hamburger (rappresentato da tre lineette orizzontali) **Area di lavoro** è per le operazioni che riguardano un'intera area di lavoro.

source: When clicking Clone, you’ll be asked for the url of a remote repo. A new workspace will be created that will contain the cloned repo. To manage the Git repo, go to the Dgit plugin.
es: Al hacer clic en Clonar, se le pedirá la url de un repo remoto. Se creará un nuevo espacio de trabajo que contendrá el repositorio clonado. Para gestionar el repositorio Git, vaya al plugin Dgit.
it: Cliccando su Clone (clona), verrà richiesto l'url di un repository remoto. Verrà creato una nuova area di lavoro che conterrà il repository clonato. Per gestire il repository Git, accedere al plugin Dgit.

source: Backup
es: Copia de seguridad

source: Backup is for downloading all the Workspaces in a .zip file. The zip file will have a folder called **.workspaces** that will contain a folder of each Workspace. Depending on your OS, you may need to change the preferences on .workspaces folder to make it visible.
es: La copia de seguridad sirve para descargar todos los Espacios de trabajo en un archivo .zip. El archivo zip tendrá una carpeta llamada **.workspaces** que contendrá una carpeta de cada Espacio de trabajo. Dependiendo de su sistema operativo, puede que tenga que cambiar las preferencias de la carpeta .workspaces para hacerla visible.
it: Il backup serve a scaricare tutte le aree di lavoro in un file .zip. Il file zip conterrà una cartella chiamata **.workspaces** (aree di lavoro), che conterrà una cartella per ciascuna area di lavoro. A seconda del vostro sistema operativo, potrebbe essere necessario modificare le preferenze della cartella .workspaces per renderla visibile.

source: Restore
es: Restaurar
it: Ripristina

source: Restore is only for uploading the backup zip file.
es: Restaurar sólo sirve para cargar el archivo zip de copia de seguridad.
it: Il ripristino è soltanto per caricare il file zip di backup.

source: Create GitHub Actions
es: Crear acciones GitHub
it: Creare azioni Github

source: The Workspace operations to create **Solidity Test Workflow**, **Mocha Chai Test Workflow**, and **Slither Workflow** are for creating GitHub actions. When clicked, a .yml file is created in the .workflows folder of the active Workspace.
es: Las operaciones del Espacio de trabajo para crear **Flujo de trabajo de prueba de solidez**, **Flujo de trabajo de prueba de Mocha Chai** y **Flujo de trabajo de Slither** son para crear acciones de GitHub. Al hacer clic, se crea un archivo .yml en la carpeta .workflows del Espacio de trabajo activo.
it: Le operazioni dell'area di lavoro per creare **Solidity Test Workflow** (Scenario di test Solodity), **Mocha Chai Test Workflow** (Scenario di test Mocha Chai) e **Slither Workflow** (Scenario Slither) servono a creare azioni GitHub. Quando si clicca, viene creato un file .yml nella cartella .workflows dell'area di lavoro attiva.

source: Workspaces initialized with Git
es: Espacios de trabajo inicializados con Git
it: Aree di lavoro inizializzare con Git

source: Git intialized workspaces will have the Git icon next to them in the **Workspaces** select box.
es: Los espacios de trabajo inicializados con Git tendrán el icono Git junto a ellos en la casilla de selección **Espacios de trabajo**.
it: Le aree di lavoro inizializzate con Git avranno l'icona Git accanto nella casella di selezione **Workspaces** (Spazi di lavoro).

source: To initialize a new Workspace for GIT, check the box at the bottom of the Create Workspace modal. ![](images/a-fe-create-ws-modal.png)
es: Para inicializar un nuevo espacio de trabajo para GIT, marque la casilla situada en la parte inferior del modal Crear espacio de trabajo. ![](images/a-fe-create-ws-modal.png)
it: Per inizializzare una nuova area di lavoro per GIT, selezionare la casella in fondo alla finestra di dialogo Create Workspace (Crea area di lavoro). ![](images/a-fe-create-ws-modal.png)

source: Working with Files
es: Trabajar con archivos
it: Lavorare con i file

source: When a file is clicked on it will appear in the Editor.
es: Al hacer clic sobre un archivo, éste aparecerá en el Editor.
it: Quando si clicca su un file, questo viene visualizzato nell'Editor.

source: Under the **Workspaces** select box are a number of icons that perform operations on files. More operations can be accessed by right-clicking on a file or folder ([see below](#right-click-on-a-file-or-folder)).
es: Debajo de la casilla de selección **Espacios de trabajo** hay una serie de iconos que realizan operaciones sobre los archivos. Puede acceder a más operaciones haciendo clic con el botón derecho en un archivo o carpeta ([véase más abajo](#clic-derecho-en-un-archivo-o-carpeta)).
it: Sotto la casella di selezione **Workspaces** (aree di lavoro) si trovano una serie di icone che eseguono operazioni sui file. È possibile accedere ad ulteriori operazioni cliccando con il pulsante destro su un file o una cartella ([vedi sotto]).(#right-click-on-a-file-or-folder)).

source: **A.** Create a file <br>
es: **A.** Cree un archivo <br>
it: **A.** Creare un file <br>

source: **B.** Create a folder <br>
es: **B.** Crear una carpeta <br>
it: **B.** Creare una cartella <br>

source: **C.** Publish all the file in this Workspace to a GIST<br>
es: **C.** Publique todos los archivos de este espacio de trabajo en un GIST<br>
it: **C.** Pubblicare tutti i file di questa are di lavoro in un GIST<br>

source: **D.** Upload a file into the current Workspace<br>
es: **D.** Cargar un archivo en el espacio de trabajo actual<br>
it: **D.** Caricare un file nell'area di lavoro corrente<br>

source: **E.** Upload a folder into the current Workspace<br>
es: **E.** Cargar una carpeta en el espacio de trabajo actual<br>
it: **E.** Caricare una cartella nell'area di lavoro corrente<br>

source: Creating new files
es: Creación de nuevos archivos
it: Creare un nuovo file

source: There are 2 ways of creating files:
es: Hay dos formas de crear archivos:
it: Esistono due modi per creare i file:

source: The first is to click on the new file icon (**H.** in fig.1), then an input for the new file’s name will appear in the **File Explorer**. Once a name is entered, a new empty file will open in the Editor. If the file's name is entered **without** a file extension, the extension **.sol** will be appended by default.
es: La primera es hacer clic en el icono de nuevo archivo (**H.** en la fig.1), entonces aparecerá una entrada para el nombre del nuevo archivo en el **Explorador de archivos**. Una vez introducido el nombre, se abrirá un nuevo archivo vacío en el Editor. Si el nombre del archivo se introduce **sin** una extensión de archivo, la extensión **.sol** se añadirá por defecto.
it: La prima consiste nel cliccare sull'icona del nuovo file (**H.** nella figura 1), quindi nel **File Explorer** (Esplora File) apparirà un'area di inserimento per il nome del nuovo file. Una volta inserito il nome, nell'Editor si aprirà un nuovo file vuoto. Se il nome del file viene inserito **senza** un'estensione, l'estensione **.sol** verrà aggiunta di default.

source: The second way of creating a file is to right-click on a file or folder to get a popup menu.
es: La segunda forma de crear un archivo es hacer clic con el botón derecho en un archivo o carpeta para obtener un menú emergente.
it: Il secondo modo per creare un file consiste nel cliccare con il pulsante destro su un file o una cartella per ottenere un menu a comparsa.

source: The new file will be placed in **the currently selected folder** of the Workspace. If a file and not a folder is selected, then the new file will be placed in that file’s folder. And if nothing is selected, then the file will be placed in the root of the current workspace's folder. Or to be brief — just be mindful of what folder it lands in.
es: El nuevo archivo se colocará en **la carpeta actualmente seleccionada** del Espacio de trabajo. Si se selecciona un archivo y no una carpeta, entonces el nuevo archivo se colocará en la carpeta de ese archivo. Y si no se selecciona nada, entonces el archivo se colocará en la raíz de la carpeta del espacio de trabajo actual. O para ser breve - sólo tenga en cuenta en qué carpeta se coloca.
it: Il nuovo file verrà inserito nella **cartella attualmente selezionata** dell'area di lavoro. Se viene selezionato un file e non una cartella, il nuovo file verrà collocato nella cartella di quel file. Se non è stato selezionato niente, il file verrà collocato nella cartella radice dell'area di lavoro corrente. O, in breve, basta fare attenzione alla cartella in cui si trova il file.

source: Publish to Gist
es: Publicar en Gist
it: Pubblicare su Gist

source: The icon (marked **J.** in fig.1) publishes all files from the current Workspace to a gist. **The Gist API requires users to be authenticated** to be able to publish a gist.
es: El icono (marcado **J.** en la fig.1) publica todos los archivos del espacio de trabajo actual en un gist. **La API de Gist requiere que los usuarios estén autenticados** para poder publicar un gist.
it: L'icona (contrassegnata da **J.** nella figura 1) pubblica tutti i file dell'area di lavoro corrente in un gist. **L'API Gist richiede che gli utenti siano autenticati** per poter pubblicare un gist.

source: Click [this link](https://github.com/settings/tokens) to Github tokens setup and select Generate new token. Then check the **Create gists** checkbox and generate a new token. Also make sure you check the box to enable the creation of Gists with this token.
es: Haga clic en [este enlace](https://github.com/settings/tokens) a Configuración de tokens de Github y seleccione Generar nuevo token. Luego marque la casilla **Crear gists** y genere un nuevo token. Asegúrese también de marcar la casilla para habilitar la creación de Gists con este token.
it: Cliccare [questo link](https://github.com/settings/tokens) per impostare i token di Github e selezionare Generate new token (Genera nuovo token). Quindi selezionare la casella **Create gists** (Crea gist) e generare un nuovo token. Inoltre, assicurarsi di selezionare la casella per abilitare la creazione di Gist con questo token.

source: Take the token and paste it in Remix's **Settings** module in the **Github Access Token** section. And then click Save.
es: Tome el token y péguelo en el módulo **Configuración** de Remix en la sección **Token de acceso a Github**. Y luego haga clic en Guardar.
it: Prendete il token e incollatelo nel modulo **Settings** (Impostazioni) di Remix nella sezione **Github Access Token** (Token di accesso Github). Quindi cliccare su Save (Salva).

source: You can also publish by right-clicking on the file or folder.
es: También puede publicar haciendo clic con el botón derecho del ratón sobre el archivo o la carpeta.
it: È possibile pubblicare anche facendo clic con il tasto destro sul file o sulla cartella.

source: Right-Click popup menu
es: Menú emergente del botón derecho
it: Menu a comparsa del tasto destro (del mouse)

source: Right-Click on a folder
es: Haga clic con el botón derecho en una carpeta
it: Click con il tasto destro su una cartella

source: Right-clicking on a folder will bring a popup menu for operations you can do on that folder.
es: Si hace clic con el botón derecho en una carpeta, aparecerá un menú emergente con las operaciones que puede realizar en esa carpeta.
it: Cliccando con il tasto destro del mouse su una cartella, viene visualizzato un menu a comparsa per le operazioni che si possono fare su quella cartella.
