Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/file_explorer.po
Languages: es, it

source: The right-click popup menu also works with Remixd (which gives you access to a folder on your hard drive).
es: El menú emergente del botón derecho también funciona con Remixd (que le da acceso a una carpeta de su disco duro).
it: Il menu a comparsa del tasto destro funziona anche con Remixd (che consente di accedere a una cartella sul tuo disco rigido).

source: **Note:** When working with RemixD, and when adding files to the shared folder from your computer (and not from Remix), you'll need to open and close the containing folder or switch in and out of **localhost** workspace to refresh the view.
es: **Nota:** Cuando trabaje con RemixD, y cuando añada archivos a la carpeta compartida desde su ordenador (y no desde Remix), tendrá que abrir y cerrar la carpeta contenedora o entrar y salir del espacio de trabajo **localhost** para refrescar la vista.
it: **Nota: ** Quando si lavora con RemixD e si aggiungono file alla cartella condivisa dal tuo computer (e non da Remix), è necessario aprire e chiudere la cartella contenitore o entrare e uscire dall'area di lavoro **localhost** per aggiornare la visualizzazione.

source: Right-Click on a Solidity file
es: Haga clic con el botón derecho en un archivo Solidity
it: Click con il tasto destro un file Solidity

source: Right-clicking on a file with a .sol extension will bring up a popup menu - which includes options for compiling & flattening, creating UML diagrams, and generating documentation.
es: Si hace clic con el botón derecho en un archivo con extensión .sol, aparecerá un menú emergente que incluye opciones para compilar y aplanar, crear diagramas UML y generar documentación.
it: Cliccando con il tasto destro del mouse su un file con estensione .sol, si aprirà un menu a comparsa - che include opzioni per la compilazione e flattering, la creazione di diagrammi UML e la generazione di documentazione.

source: Right-Click on a Script
es: Haga clic con el botón derecho en un guión
it: Click con il tasto destro su uno script

source: Right-click on any file with a .js or .ts extension to get the **Run** option in the popup menu to run the script.
es: Haga clic con el botón derecho en cualquier archivo con extensión .js o .ts para obtener la opción **Ejecutar** en el menú emergente y ejecutar el script.
it: Cliccare con il tasto destro del mouse su un qualsiasi file con estensione .js o .ts per ottenere l'opzione **Run** (Esegui) nel menu a comparsa per eseguire lo script.

source: If the script you want to run is the active file in the Editor, you can also run it by using play button at the top left of the Editor or by inputting the command `remix.exeCurrent()` in the console.
es: Si el script que desea ejecutar es el archivo activo en el Editor, también puede ejecutarlo utilizando el botón de reproducción situado en la parte superior izquierda del Editor o introduciendo el comando `remix.exeCurrent()` en la consola.
it: Se lo script che si desidera eseguire è il file attivo nell'Editor, è possibile eseguirlo anche utilizzando il pulsante play (avvia) in alto a sinistra dell'Editor o immettendo il comando `remix.exeCurrent()` nella console.

source: Git in the File Explorer
es: Git en el Explorador de archivos
it: Git in Esplora file

source: In Remix, a workspace can be initialized with Git. The Git commands then operate on the workspace.
es: En Remix, se puede inicializar un espacio de trabajo con Git. Los comandos Git operan entonces sobre el espacio de trabajo.
it: In Remix, un'area di lavoro può essere inizializzata con Git. I comandi di Git funzionano quindi nell'area di lavoro.

source: Initialize
es: Inicialice
it: Inizializza

source: For information about initializing a workspace, see this [section](#workspaces-initialized-with-git).
es: Para obtener información sobre cómo inicializar un espacio de trabajo, consulte este [section](#workspaces-initialized-with-git).
it: Per informazioni sull'inizializzazione di un'area di lavoro, vedere questa [sezione](#workspaces-initialized-with-git).

source: The clone command is located in the **Workspace hamburger menu**. For more information, see the section about [workspace operations](#workspace-operations)
es: El comando clonar se encuentra en el **menú hamburguesa del espacio de trabajo**. Para más información, consulte la sección sobre [operaciones en el espacio de trabajo](#operaciones en el espacio de trabajo)
it: Il comando clona si trova nel **Menu hamburger (identificato da tre lineette orizzontali) dell'area di lavoro**. Per ulteriori informazioni, vedere la sezione [Operazioni dell'area di lavoro](#workspace-operations)

source: Branch Management
es: Gestión de sucursales
it: Gestione del Branch

source: When you are in a workspace that is initialized with Git, at the bottom of the File Explorer, you’ll see the place for managing branches.
es: Cuando se encuentre en un espacio de trabajo inicializado con Git, en la parte inferior del Explorador de archivos, verá el lugar para la gestión de ramas.
it: Quando ci si trova in un'area di lavoro inizializzata con Git, in fondo all'Esplora file, si trova il posto per la gestione dei rami.

source: Then when you click on the branch name, this section will expand with an interface for switching branches and for creating a new branch.
es: A continuación, cuando haga clic en el nombre de la sucursal, esta sección se ampliará con una interfaz para cambiar de sucursal y para crear una nueva.
it: Quando si clicca sul nome del ramo, questa sezione si espande con un'interfaccia per cambiare ramo e per crearne uno nuovo.

source: For the rest of the Git commands, go to the DGit plugin.
es: Para el resto de comandos Git, vaya al plugin DGit.
it: Per gli altri comandi Git, consultare il plugin DGit.

source: For more info about the DGit plugin, see ![this article](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).
es: Para más información sobre el plugin DGit, consulte ![este artículo](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).
it: Per maggiori informazioni sul plugin DGit, vedere ![questo articolo](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).

source: this article
es: este artículo
it: questo articolo

source: Gnosis MultiSig
it: Gnosis MultiSig (Multifirma Gnosis)

source: Clone
it: Clona
