Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/foundry.po
Languages: es, fr, it

source: Foundry
es: Fundición
fr: Fonderie

source: _(Supported since Remix IDE v0.25.0)_
es: _(Soportado desde Remix IDE v0.25.0)_
fr: (Supporté depuis Remix IDE v0.25.0)
it: _(Supportato a partire dalla versione IDE Remix v0.25.0)_

source: Foundry Provider
es: Proveedor de fundición
fr: Fournisseur de fonderie
it: Fornitore di Foundry

source: **Foundry Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Foundry's built-in **Anvil** blockchain. `Foundry Provider` can be chosen from the list of environments in `Deploy & Run Transactions` plugin.
es: **Foundry Provider** es un plugin en Remix IDE que permite a los usuarios desplegar el contrato en la blockchain integrada **Anvil** de Foundry. `Foundry Provider` puede elegirse de la lista de entornos del plugin `Deploy & Run Transactions`.
fr: **Foundry Provider** est un plugin sur Remix IDE qui permet aux utilisateurs de déployer le contrat sur la blockchain **Anvil** intégrée de Foundry. `Foundry Provider` peut être choisi dans la liste des environnements dans le plugin `Deploy & Run Transactions`.
it: Il **Foundry Provider** (Fornitore di Foundry) è un plugin dell'IDE Remix che consente agli utenti di distribuire il contratto sulla blockchain **Anvil** integrata di Foundry. Il `Foundry Provider` può essere selezionato dall'elenco degli ambienti nel plugin `Deploy & Run Transactions` (Distribuisci e avvia le transazioni).

source: As soon as you select `Foundry Provider`, a modal is opened asking for the `Anvil JSON-RPC Endpoint`.
es: En cuanto seleccione `Foundry Provider`, se abrirá un modal preguntándole por el `Anvil JSON-RPC Endpoint`.
fr: Dès que vous sélectionnez `Foundry Provider`, une fenêtre modale s'ouvre pour vous demander le `Anvil JSON-RPC Endpoint`.
it: Non appena si seleziona `Foundry Provider` (Fornitore di Foundry), si apre una finestra che richiede l'endpoint `Anvil JSON-RPC Endpoint` (endpoint JSON-RPC di Anvil).

source: If Foundry Anvil node is running with default options, the default endpoint value in modal will not need any change. In case, Anvil node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
es: Si el nodo Foundry Anvil se está ejecutando con las opciones por defecto, el valor del endpoint por defecto en el modal no necesitará ningún cambio. En caso de que el host y el puerto del nodo Anvil sean diferentes, el punto final JSON-RPC deberá actualizarse en el cuadro de texto del modal.
fr: Si le nœud Foundry Anvil fonctionne avec les options par défaut, la valeur du point d'extrémité par défaut dans la fenêtre modale n'a pas besoin d'être modifiée. Dans le cas où l'hôte et le port du nœud Anvil sont différents, le point de terminaison JSON-RPC doit être mis à jour dans la zone de texte de la fenêtre modale.
it: Se il nodo Foundry di Anvil è in esecuzione con le opzioni predefinite, il valore dell'endpoint predefinito nella finestra non necessita di modifiche. Nel caso in cui, l'host e la porta del nodo Anvil siano diversi, l'endpoint JSON-RPC dovrà essere aggiornato nella casella di testo della finestra.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Anvil node will be loaded in the `ACCOUNT` section. Network id will also be shown.
es: Una vez rellenado el punto final correcto en el modal, pulse `OK` y las cuentas del nodo Anvil se cargarán en la sección `ACCOUNT`. También se mostrará el identificador de red.
fr: Une fois que le bon endpoint est renseigné dans la fenêtre modale, cliquez simplement sur `OK` et les comptes du noeud Anvil seront chargés dans la section `ACCOUNT`. L'identifiant du réseau sera également affiché.
it: Una volta inserito l'endpoint corretto nella finestra, è sufficiente cliccare su `OK` e gli account del nodo di Anvil verranno caricati nella sezione `ACCOUNT`. Verrà mostrato anche l'identificativo (id) della rete.

source: Now, one can start deploying the contract from Remix IDE to the local Anvil node as usual.
es: Ahora, se puede empezar a desplegar el contrato desde Remix IDE al nodo local Anvil como de costumbre.
fr: Maintenant, vous pouvez commencer à déployer le contrat depuis Remix IDE vers le nœud local d'Anvil comme d'habitude.
it: A questo punto, si può iniziare a distribuire il contratto dall'IDE Remix al nodo locale di Anvil come di consueto.

source: Foundry Remappings
es: Remodelaciones de fundición
fr: Remaniements de fonderie
it: Rimappatura di Foundry

source: Foundry manages dependencies using git submodules and can remap dependencies to make them easier to import. So import defined by remappings can have compilation errors on Remix IDE.
es: Foundry gestiona las dependencias mediante submódulos git y puede remapear las dependencias para facilitar su importación. Así, las importaciones definidas por remapeo pueden tener errores de compilación en Remix IDE.
fr: Foundry gère les dépendances en utilisant les sous-modules git et peut remapper les dépendances pour les rendre plus faciles à importer. Ainsi, les importations définies par des remappings peuvent provoquer des erreurs de compilation dans l'IDE Remix.
it: Foundry gestisce le dipendenze usando i sottomoduli git e può rimappare le dipendenze per renderle più facili da importare. Pertanto, gli import definiti dalle rimappature possono avere errori di compilazione sull'IDE Remix.

source: To support such compilation, Remix suggests running [compilation using a compiler config file](https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Remix adds some default Forge remappings in the compiler config file when a Foundry project is loaded in Remix IDE using remixd.
es: Para soportar dicha compilación, Remix sugiere ejecutar [compilación utilizando un archivo de configuración del compilador](https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Remix añade algunas remapeos Forge por defecto en el archivo de configuración del compilador cuando se carga un proyecto Foundry en Remix IDE utilizando remixd.
fr: Pour supporter une telle compilation, Remix suggère d'exécuter [compilation using a compiler config file] (https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Remix ajoute quelques remappages Forge par défaut dans le fichier de configuration du compilateur lorsqu'un projet Foundry est chargé dans l'IDE Remix à l'aide de remixd.
it: Per supportare questo tipo di compilazione, Remix suggerisce di eseguire [la compilazione usando un file di configurazione del compilatore](https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Quando un progetto Foundry viene caricato nell'IDE Remix usando remixd Remix aggiunge alcuni remapping predefiniti di Forge nel file di configurazione del compilatore.

source: Further, more remappings can be added manually, if required.
es: Además, si es necesario, se pueden añadir manualmente más remapeados.
fr: En outre, d'autres remappings peuvent être ajoutés manuellement, si nécessaire.
it: Inoltre, se necessario, è possibile aggiungere manualmente altre rimappature.
