Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/hardhat.po
Languages: es, fr, it

source: Hardhat
es: Casco
fr: Casque

source: _(Supported since Remix IDE v0.12.0 and Remixd v0.3.6)_
es: _(Soportado desde Remix IDE v0.12.0 y Remixd v0.3.6)_
fr: (Supporté depuis Remix IDE v0.12.0 et Remixd v0.3.6)
it: _(Supportato a partire dalla versione IDE Remix v0.12.0 e Remixd v0.3.6)_

source: Remixd and Hardhat
es: Remixd y Hardhat
fr: Remixd et Hardhat
it: Remixd e Hardhat

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
es: **Nota:** Si no ha utilizado `remixd` antes, lea más sobre él [here](./remixd.html)
fr: **Note:** Si vous n'avez pas encore utilisé `remixd`, lisez-en plus sur [here](./remixd.html)
it: **Nota:** Se non si è mai usato `remixd` prima d'ora, leggi di più su di esso [qui](./remixd.html)

source: If `remixd` is running locally on your device and shared folder is a **Hardhat project**, an additional websocket plugin will be listening on port `65522`. According to its documentation,
es: Si `remixd` se está ejecutando localmente en su dispositivo y la carpeta compartida es un **proyecto Hardhat**, un plugin websocket adicional estará escuchando en el puerto `65522`. Según su documentación
fr: Si `remixd` est exécuté localement sur votre appareil et que le dossier partagé est un **projet Hardhat**, un plugin websocket supplémentaire écoutera sur le port `65522`. Selon sa documentation,
it: Se `remixd` è in esecuzione localmente sul tuo dispositivo e la cartella condivisa è un **progetto Hardhat**, un plugin websocket aggiuntivo sarà in ascolto sulla porta `65522`. Secondo la sua documentazione,

source: _Hardhat projects are npm projects with the hardhat package installed and a hardhat.config.js or hardhat.config.ts file._
es: _Los proyectos hardhat son proyectos npm con el paquete hardhat instalado y un archivo hardhat.config.js o hardhat.config.ts._.
fr: Les projets hardhat sont des projets npm avec le paquet hardhat installé et un fichier hardhat.config.js ou hardhat.config.ts.
it: _I progetti hardhat sono progetti npm con installato il pacchetto hardhat e un file hardhat.config.js o hardhat.config.ts._

source: Remixd looks for the `hardhat.config.js` or `hardhat.config.ts` file in shared folder, and if it finds the file, the Hardhat websocket listener will run.
es: Remixd busca el archivo `hardhat.config.js` o `hardhat.config.ts` en la carpeta compartida, y si encuentra el archivo, se ejecutará el escuchador de websocket de Hardhat.
fr: Remixd recherche le fichier `hardhat.config.js` ou `hardhat.config.ts` dans le dossier partagé, et s'il trouve le fichier, l'écouteur Hardhat websocket sera exécuté.
it: Remixd cerca il file `hardhat.config.js` o `hardhat.config.ts` nella cartella condivisa e, se lo trova, esegue il processo websocket di Hardhat.

source: The Hardhat websocket listener is a websocket plugin similar to `remixd` and is used to perform Hardhat specific actions with Remix IDE.
es: El escuchador de websocket de Hardhat es un plugin de websocket similar a `remixd` y se utiliza para realizar acciones específicas de Hardhat con Remix IDE.
fr: Le Hardhat websocket listener est un plugin websocket similaire à `remixd` et est utilisé pour effectuer des actions spécifiques à Hardhat avec Remix IDE.
it: Il processo websocket di Hardhat è un plugin websocket simile a `remixd` e viene usato per eseguire azioni specifiche di Hardhat con l'IDE Remix.

source: It doesn't need any separate installation as it is shipped with [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module.
es: No necesita ninguna instalación por separado ya que se entrega con el módulo [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).
fr: Il ne nécessite aucune installation séparée car il est livré avec le module [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).
it: Non ha bisogno di alcuna installazione separata, poiché viene fornito con il modulo [NPM remixd] (https://www.npmjs.com/package/@remix-project/remixd).

source: Enable Hardhat Compilation
es: Habilitar la compilación Hardhat
fr: Activer la compilation Hardhat
it: Abilitare la compilazione di Hardhat

source: Prerequisites
es: Requisitos previos
fr: Conditions préalables
it: Prerequisiti

source: To use Hardhat compilation with Remix IDE efficiently:
es: Para utilizar eficazmente la compilación Hardhat con Remix IDE:
fr: Pour utiliser efficacement la compilation Hardhat avec Remix IDE :
it: Per utilizzare in modo efficiente la compilazione di Hardhat con l'IDE Remix:

source: **Hardhat** should be installed locally on the system [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)
es: **Hardhat** debe instalarse localmente en el sistema [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)
fr: **Hardhat** doit être installé localement sur le système [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)
it: **Hardhat** deve essere installato localmente sul sistema [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)

source: Shared folder should be a Hardhat project containing `hardhat.config.js` or `hardhat.config.ts`
es: La carpeta compartida debe ser un proyecto Hardhat que contenga `hardhat.config.js` o `hardhat.config.ts`.
fr: Le dossier partagé doit être un projet Hardhat contenant `hardhat.config.js` ou `hardhat.config.ts`.
it: La cartella condivisa dovrebbe essere un progetto Hardhat contenente `hardhat.config.js` o `hardhat.config.ts`

source: `Remixd` Hardhat websocket listener should be running at `65522`
es: El `Remixd` Hardhat websocket listener debería estar ejecutándose en `65522`.
fr: L'auditeur Hardhat websocket `Remixd` devrait être lancé à `65522`.
it: Il processo websocket di `Hardhat per Remixd` dovrebbe essere in esecuzione alla porta `65522`

source: How to use
es: Cómo utilizarlo
fr: Comment l'utiliser ?
it: Come si usa

source: If a hardhat project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Compiler` plugin with the label `Enable Hardhat Compilation`.
es: Si se comparte un proyecto hardhat a través de remixd y se carga el espacio de trabajo `localhost` en Remix IDE, aparecerá una casilla de verificación extra en el plugin `Solidity Compiler` con la etiqueta `Enable Hardhat Compilation`.
fr: Si un projet hardhat est partagé via remixd et que l'espace de travail `localhost` est chargé dans Remix IDE, il y aura une case à cocher supplémentaire dans le plugin `Solidity Compiler` avec le libellé `Enable Hardhat Compilation`.
it: Se un progetto hardhat è condiviso tramite remixd e l'area di lavoro `localhost` è caricato nell'IDE Remix, nel plugin `Solidity Compiler` (Compilatore Solidity) sarà visualizzata una casella di controllo aggiuntiva con l'etichetta `Enable Hardhat Compilation` (abilita la compilazione Hardhat).

source: There is an info icon along side the label which redirects to a specific section of Remix official documentation that explains how to use Hardhat compilation.
es: Hay un icono de información junto a la etiqueta que redirige a una sección específica de la documentación oficial de Remix que explica cómo utilizar la compilación Hardhat.
fr: Il y a une icône info à côté de l'étiquette qui redirige vers une section spécifique de la documentation officielle de Remix qui explique comment utiliser la compilation Hardhat.
it: C'è un'icona informativa accanto all'etichetta che reindirizza a una sezione specifica della documentazione ufficiale di Remix che spiega come usare la compilazione Hardhat.

source: One can check the `Enable Hardhat Compilation` box to run the compilation for Hardhat along with the Remix using the compiler configuration in `Solidity Compiler` plugin.
es: Se puede marcar la casilla `Habilitar compilación Hardhat` para ejecutar la compilación para Hardhat junto con el Remix utilizando la configuración del compilador en el plugin `Solidity Compiler`.
fr: Vous pouvez cocher la case "Enable Hardhat Compilation" pour lancer la compilation pour Hardhat en même temps que le Remix en utilisant la configuration du compilateur dans le plugin "Solidity Compiler".
it: Si può selezionare la casella `Enable Hardhat Compilation` (Abilita la compilazione Hardhat) per eseguire la compilazione di Hardhat insieme a Remix usando la configurazione del compilatore nel plugin `Solidity Compiler` (Compilatore Solidity).

source: On clicking `Compile` button, a file with `remix-compiler.config.js` will be created on the project root which will be storing compiler configuration set in Remix's `Solidity Compiler` plugin. It is passed to Hardhat for compilation.
es: Al pulsar el botón `Compilar`, se creará un archivo con `remix-compiler.config.js` en la raíz del proyecto que almacenará la configuración del compilador establecida en el plugin `Solidity Compiler` de Remix. Se pasa a Hardhat para la compilación.
fr: En cliquant sur le bouton `Compile`, un fichier avec `remix-compiler.config.js` sera créé à la racine du projet qui stockera la configuration du compilateur définie dans le plugin `Solidity Compiler` de Remix. Il est transmis à Hardhat pour la compilation.
it: Cliccando sul pulsante `Compile` (Compila), viene creato un file dal nome `remix-compiler.config.js` nella radice del progetto, che memorizza la configurazione del compilatore impostata nel plugin `Solidity Compiler` (Compilatore Solidity) di Remix. Esso viene passato ad Hardhat per la compilazione.

source: The result of the compilation will be shown in the Remix IDE terminal
es: El resultado de la compilación se mostrará en el terminal del IDE Remix
fr: Le résultat de la compilation sera affiché dans le terminal de l'IDE Remix.
it: Il risultato della compilazione sarà mostrato nel terminale dell'IDE Remix

source: and also in the **remixd** terminal.
es: y también en el terminal **remixd**.
fr: et aussi dans le terminal **remixd**.
it: ed anche nel terminale **remixd**.

source: Hardhat Provider
es: Proveedor de cascos
fr: Fournisseur de casque
it: Fornitore Hardhat

source: _In Hardhat, contracts are deployed by starting a local node. Read more about it in [Hardhat documentation](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_
es: _En Hardhat, los contratos se despliegan iniciando un nodo local. Lea más sobre ello en [Documentación de Hardhat](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_
fr: Dans Hardhat, les contrats sont déployés en démarrant un nœud local. Pour en savoir plus, consultez la [documentation Hardhat] (https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_
it: _In Hardhat, i contratti vengono distribuiti avviando un nodo locale. Per saperne di più, consultare [Documentazione di Hardhat](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_

source: **Hardhat Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Hardhat 'localhost' network. This can be chosen from the `ENVIRONMENT` dropdown of `Deploy and Run Transactions` plugin.
es: **Hardhat Provider** es un plugin en Remix IDE que permite a los usuarios desplegar el contrato en la red 'localhost' de Hardhat. Esto puede elegirse en el desplegable `ENTORNO` del plugin `Desplegar y ejecutar transacciones`.
fr: **Hardhat Provider** est un plugin sur Remix IDE qui permet aux utilisateurs de déployer le contrat sur le réseau Hardhat 'localhost'. Ceci peut être choisi dans le menu déroulant `ENVIRONMENT` du plugin `Deploy and Run Transactions`.
it: Il **Hardhat Provider** (Fornitore Hardhat) è un plugin dell'IDE Remix che consente agli utenti di distribuire il contratto sulla rete "localhost" di Hardhat. Questo può essere scelto dal menu a tendina `ENVIRONMENT` (AMBIENTE) del plugin `Deploy and Run Transactions` (Distribuisci e Avvia transazioni).

source: As soon as you select `Hardhat Provider`, a modal is opened asking for the `Hardhat JSON-RPC Endpoint`.
es: En cuanto seleccione `Hardhat Provider`, se abrirá un modal preguntándole por el `Hardhat JSON-RPC Endpoint`.
fr: Dès que vous sélectionnez `Hardhat Provider`, une fenêtre modale s'ouvre pour vous demander le `Hardhat JSON-RPC Endpoint`.
it: Non appena si seleziona `Hardhat Provider` (Fornitore Hardhat), si apre una finestra che chiede lo `Hardhat JSON-RPC Endpoint`(Endpoint JSON-RPC di Hardhat).

source: If Hardhat node is running with default options, then the default endpoint value in modal will not need any change. In case, Hardhat node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
es: Si el nodo Hardhat se está ejecutando con las opciones por defecto, entonces el valor del endpoint por defecto en el modal no necesitará ningún cambio. En caso de que el host y el puerto del nodo Hardhat sean diferentes, el punto final JSON-RPC deberá actualizarse en el cuadro de texto del modal.
fr: Si le nœud Hardhat fonctionne avec les options par défaut, la valeur du point final par défaut dans la fenêtre modale n'a pas besoin d'être modifiée. Si l'hôte et le port du nœud Hardhat sont différents, le point de terminaison JSON-RPC doit être mis à jour dans la zone de texte de la fenêtre modale.
it: Se il nodo Hardhat è in esecuzione con le opzioni predefinite, il valore dell'endpoint predefinito nella maschera non necessita di modifiche. Se l'host e la porta del nodo Hardhat sono diversi, l'endpoint JSON-RPC deve essere aggiornato nella casella di testo.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Hardhat node will be loaded in the `ACCOUNT` section. Network id will also be shown.
es: Una vez rellenado el punto final correcto en el modal, pulse `OK` y las cuentas del nodo Hardhat se cargarán en la sección `ACCOUNT`. También se mostrará el identificador de red.
fr: Une fois que le bon endpoint est rempli dans le modal, cliquez simplement sur `OK` et les comptes du nœud Hardhat seront chargés dans la section `ACCOUNT`. L'identifiant du réseau sera également affiché.
it: Una volta inserito l'endpoint corretto nella maschera, è sufficiente cliccare su `OK` e gli account del nodo Hardhat verranno caricati nella sezione `ACCOUNT`. Inoltre verrà mostrato anche l'identificativo (id) della rete.

source: Now, one can start deploying the contract from Remix IDE to the Hardhat local node as usual.
es: Ahora, se puede empezar a desplegar el contrato desde Remix IDE al nodo local de Hardhat como de costumbre.
fr: Maintenant, vous pouvez commencer à déployer le contrat depuis Remix IDE vers le nœud local Hardhat comme d'habitude.
it: Ora, si può iniziare a distribuire il contratto dall'IDE Remix al nodo locale di Hardhat come di consueto.

source: `console.log` in Remix IDE
es: `console.log` en Remix IDE
fr: `console.log` dans l'IDE Remix
it: `console.log` nell'IDE Remix

source: _(Supported since Remix IDE v0.17.0)_
es: _(Soportado desde Remix IDE v0.17.0)_
fr: (Supporté depuis Remix IDE v0.17.0)
it: _(Supportato a partire dalla versione IDE Remix v0.17.0)_

source: Remix IDE supports hardhat console library while using `Remix VM`. It can be used while making a transaction or running unit tests.
es: Remix IDE soporta la librería de consola hardhat mientras se utiliza `Remix VM`. Puede utilizarse mientras se realiza una transacción o se ejecutan pruebas unitarias.
fr: Remix IDE supporte la bibliothèque de console hardhat lors de l'utilisation de `Remix VM`. Elle peut être utilisée lors d'une transaction ou lors de l'exécution de tests unitaires.
it: L'IDE Remix supporta la libreria della console hardhat quando si utilizza `Remix VM`. Può essere utilizzata durante una transazione o l'esecuzione di test unitari.

source: Deploy and Run Transactions
es: Despliegue y ejecución de transacciones
fr: Déployer et exécuter des transactions
it: Distribuzione ed esecuzione delle transazioni

source: To try it out, you need to put an import statement and use `console.log` to print the value as shown in image.
es: Para probarlo, tiene que poner una sentencia import y utilizar `console.log` para imprimir el valor como se muestra en la imagen.
fr: Pour l'essayer, vous devez mettre une déclaration d'importation et utiliser `console.log` pour imprimer la valeur comme le montre l'image.
it: Per provarlo, è necessario inserire una dichiarazione di import ed usare `console.log` per stampare il valore come mostrato nell'immagine.

source: ![](images/hardhat-console-file.png)
es: ![](images/hardhat-consola-archivo.png)

source: Further, once you execute the `changeOwner` method, the value from console statement will be shown in Remix terminal after transaction details as below:
es: Además, una vez que ejecute el método `changeOwner`, el valor de la sentencia de consola se mostrará en el terminal Remix después de los detalles de la transacción como se indica a continuación:
fr: De plus, une fois que vous avez exécuté la méthode `changeOwner`, la valeur de la console sera affichée dans le terminal Remix après les détails de la transaction comme ci-dessous :
it: Inoltre, una volta eseguito il metodo `changeOwner`, il valore della dichiarazione nella console verrà mostrato nel terminale di Remix dopo i dettagli della transazione, come indicato di seguito:

source: Solidity Unit Testing
es: Pruebas unitarias de Solidity
fr: Tests unitaires de Solidity
it: Unit test di Solidity

source: Similarly, `console.log` can be used while running unit tests using Remix Solidity Unit Testing plugin. See image below.
es: De forma similar, `console.log` puede utilizarse mientras se ejecutan pruebas unitarias utilizando el plugin Remix Solidity Unit Testing. Vea la imagen de abajo.
fr: De la même manière, `console.log` peut être utilisé lors de l'exécution de tests unitaires en utilisant le plugin Remix Solidity Unit Testing. Voir l'image ci-dessous.
it: Allo stesso modo, `console.log` può essere usato durante l'esecuzione di test unitari usando il plugin Remix Solidity Unit Testing (Unit test di Remix per Solidity). Si veda l'immagine qui sotto.

source: For the tests including logging message, it will display in the Remix Terminal corresponding to test name.
es: Para las pruebas que incluyan mensaje de registro, se mostrará en el Terminal Remix correspondiente al nombre de la prueba.
fr: Pour les tests comprenant un message de journalisation, celui-ci s'affichera dans le terminal Remix correspondant au nom du test.
it: Per i test che includono un messaggio di accesso, questo verrà visualizzato nel terminale Remix in corrispondenza del nome del test.
