Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/import.po
Languages: es, fr, it

source: Importing & Loading Source Files in Solidity
es: Importación y carga de archivos fuente en Solidity
fr: Importer et charger des fichiers sources dans Solidity
it: Importare e caricare i file sorgente in Solidity

source: There are two main reasons for loading external files into Remix:
es: Hay dos razones principales para cargar archivos externos en Remix:
fr: Il y a deux raisons principales de charger des fichiers externes dans Remix :
it: Ci sono due ragioni principali per caricare file esterni in Remix:

source: **to import a library or dependency** (for files you will NOT be editing)
es: **para importar una biblioteca o dependencia** (para archivos que NO vaya a editar)
fr: **pour importer une bibliothèque ou une dépendance** (pour les fichiers que vous ne modifierez PAS)
it: **per importare una libreria o una dipendenza** (per file che NON verranno modificati)

source: **to load some files for manipulation, editing and play** (for files you might want to edit)
es: **para cargar algunos archivos para manipularlos, editarlos y reproducirlos** (para los archivos que quiera editar)
fr: **pour charger des fichiers à manipuler, à éditer et à lire** (pour les fichiers que vous pourriez vouloir éditer)
it: **per caricare alcuni file per la manipolazione, la modifica e la riproduzione** (per file che si desidera modificare)

source: Importing a library or dependency
es: Importar una biblioteca o dependencia
fr: Importation d'une bibliothèque ou d'une dépendance
it: Importare una libreria o una dipendenza

source: When importing from NPM, or a URL (like github, a IPFS gateway, or a Swarm gateway) you do not need to do anything more than use the `import` statement in your contract. The dependencies do not need to be "preloaded" into the File Explorer's current Workspace before the contract is compiled.
es: Cuando importe desde NPM, o una URL (como github, una pasarela IPFS, o una pasarela Swarm) no necesita hacer nada más que utilizar la sentencia `import` en su contrato. No es necesario "precargar" las dependencias en el Espacio de trabajo actual del Explorador de archivos antes de compilar el contrato.
fr: Lorsque vous importez depuis NPM, ou une URL (comme github, une passerelle IPFS, ou une passerelle Swarm), vous n'avez rien d'autre à faire que d'utiliser l'instruction `import` dans votre contrat. Les dépendances n'ont pas besoin d'être "préchargées" dans l'espace de travail actuel de l'explorateur de fichiers avant que le contrat ne soit compilé.
it: Quando si importa da NPM o da un URL (come github, un gateway IPFS o un gateway Swarm) non è necessario fare altro che usare la dichiarazione `import` (importa) nel contratto. Le dipendenze non devono essere "precaricate" nell'Esplora File dell'area di lavoro corrente prima che il contratto venga compilato.

source: Files loaded from the import statement are placed in the **Files Explorer's** current Workspace's `.deps` folder.
es: Los archivos cargados desde la sentencia import se colocan en la carpeta `.deps` del espacio de trabajo actual del **Explorador de archivos**.
fr: Les fichiers chargés à partir de l'instruction d'importation sont placés dans le dossier `.deps` de l'explorateur de fichiers** de l'espace de travail actuel.
it: I file caricati dall'istruzione import vengono inseriti nella cartella `.deps' dell'**Esplora file** dell'area di lavoro corrente.

source: Under the hood, Remix checks to see if the files are already loaded in the **.deps** directory. If not, it gets them via unpkg if it is an NPM lib.
es: Bajo el capó, Remix comprueba si los archivos ya están cargados en el directorio **.deps**. Si no es así, los obtiene a través de unpkg si se trata de una lib NPM.
fr: Sous le capot, Remix vérifie si les fichiers sont déjà chargés dans le répertoire **.deps**. Si ce n'est pas le cas, il les récupère via unpkg s'il s'agit d'une librairie NPM.
it: Sotto il cofano, Remix controlla se i file sono già caricati nella cartella **.deps**. In caso contrario, li ottiene tramite unpkg se si tratta di una libreria NPM.

source: Here are some example import statements:
es: He aquí algunos ejemplos de sentencias import:
fr: Voici quelques exemples de déclarations d'importation :
it: Ecco alcuni esempi di dichiarazioni di import:

source: Import from NPM
es: Importar desde NPM
fr: Importer de NPM
it: Importa da NPM

source: **Note:** In the example above, **@openzeppelin** is the name of the npm library. In the following example the library's name does not begin with an @ - but Remix will go and check npm for a library of that name.
es: **Nota:** En el ejemplo anterior, **@openzeppelin** es el nombre de la biblioteca npm. En el siguiente ejemplo el nombre de la biblioteca no comienza con una @ - pero Remix irá a buscar en npm una biblioteca con ese nombre.
fr: **Note:** Dans l'exemple ci-dessus, **@openzeppelin** est le nom de la bibliothèque npm. Dans l'exemple suivant, le nom de la bibliothèque ne commence pas par un @ - mais Remix ira chercher dans npm une bibliothèque de ce nom.
it: **Nota:**Nell'esempio sopra, **@openzeppelin** è il nome della libreria npm. Nell'esempio seguente il nome della libreria non inizia con una @ - ma Remix andrà e controllerà npm se ha una libreria con quel nome.

source: Import from a Github URL
es: Importar desde una URL de Github
fr: Importer à partir d'une URL Github
it: Importa da un URL di Github

source: You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example above imports from OpenZeppelin Contracts v2.5.0.
es: Debe especificar la etiqueta release (cuando esté disponible), de lo contrario obtendrá el último código de la rama master. Para OpenZeppelin Contracts sólo debe utilizar código publicado en una versión oficial, el ejemplo anterior importa de OpenZeppelin Contracts v2.5.0.
fr: Vous devez spécifier l'étiquette de la version (lorsqu'elle est disponible), sinon vous obtiendrez le code le plus récent de la branche master. Pour les contrats OpenZeppelin, vous ne devez utiliser que le code publié dans une version officielle. L'exemple ci-dessus importe les contrats OpenZeppelin v2.5.0.
it: È necessario specificare il tag della release (se disponibile), altrimenti si otterrà il codice più recente nel ramo principale. Per i contratti OpenZeppelin si dovrebbe usare solo il codice pubblicato in un rilascio ufficiale; l'esempio precedente importa da OpenZeppelin Contracts v2.5.0.

source: Import from Swarm
es: Importar desde Swarm
fr: Importer depuis Swarm
it: Importa da Swarm

source: Import from IPFS
es: Importar desde IPFS
fr: Importation à partir d'IPFS
it: Importa da IPFS

source: Importing a local file not in .deps
es: Importar un archivo local que no está en .deps
fr: Importer un fichier local qui n'est pas dans .deps
it: Importare un file locale non in .deps

source: To import a file NOT in the **.deps** folder, use a relative path (**./**). For example:
es: Para importar un archivo que NO se encuentre en la carpeta **.deps**, utilice una ruta relativa (**./**). Por ejemplo:
fr: Pour importer un fichier qui ne se trouve PAS dans le dossier **.deps**, utilisez un chemin relatif (**./**). Par exemple, vous pouvez utiliser un chemin relatif (**./**) :
it: Per importare un file NON presente nella cartella **.deps**, utilizzare un percorso relativo (**./**). Per esempio:

source: **Note:** It is not possible to import across Workspaces.
es: **Nota:** No es posible importar entre espacios de trabajo.
fr: **Note:** Il n'est pas possible d'importer entre les espaces de travail.
it: **Nota: ** Non è possibile importare tra aree di lavoro.

source: Importing a file from your computer's filesystem
es: Importar un archivo desde el sistema de archivos de su ordenador
fr: Importation d'un fichier à partir du système de fichiers de votre ordinateur
it: Importare un file dal filesystem del computer

source: This method uses **remixd** - the remix daemon. Please go to the [remixd docs](remixd.html) for instructions about how to bridge the divide between the browser and your computers filesystem.
es: Este método utiliza **remixd** - el demonio remix. Por favor, vaya a [remixd docs](remixd.html) para obtener instrucciones sobre cómo salvar la brecha entre el navegador y el sistema de archivos de su ordenador.
fr: Cette méthode utilise **remixd** - le démon remix. Veuillez consulter la [docs remixd](remixd.html) pour savoir comment combler le fossé entre le navigateur et le système de fichiers de votre ordinateur.
it: Questo metodo utilizza **remixd** - il daemon remix. Si prega di consultare i [documenti emixd](remixd.html) per istruzioni su come colmare il divario tra il browser e il filesystem del tuo computer.

source: More about the import keyword
es: Más información sobre la palabra clave de importación
fr: En savoir plus sur le mot-clé import
it: Ulteriori informazioni sulla parola chiave import

source: For a detailed explanation of the `import` keyword see the [Solidity documentation](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files)
es: Para una explicación detallada de la palabra clave `import` consulte la [documentación de Solidity](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files)
fr: Pour une explication détaillée du mot-clé `import`, voir la [documentation Solidity] (https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files).
it: Per una spiegazione dettagliata della parola chiave `import` si veda la [Documentazione di Solidity](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files)

source: Importing a files for manipulation
es: Importar un archivo para manipularlo
fr: Importer un fichier pour le manipuler
it: Importare un file per la manipolazione

source: When importing from the home tab widgets or with a remix command in the console, the files are placed in the **root of the current Workspace** inside a folder the shows their source - eg github or gists.
es: Al importar desde los widgets de la pestaña de inicio o con un comando remix en la consola, los archivos se colocan en la **raíz del espacio de trabajo actual** dentro de una carpeta que muestre su fuente - por ejemplo github o gists.
fr: Lors de l'importation depuis les widgets de l'onglet d'accueil ou avec une commande remix dans la console, les fichiers sont placés dans la **racine de l'espace de travail actuel** à l'intérieur d'un dossier qui montre leur source - par exemple github ou gists.
it: Quando si importano i widget dalla scheda Home o con un comando remix nella console, i file vengono posizionati nella **radice dell'area di lavoro corrente** dentro una cartella che mostri la sua fonte - ad esempio github o gists.

source: Import buttons on the Remix home tab
es: Botones de importación en la pestaña de inicio de Remix
fr: Boutons d'importation dans l'onglet d'accueil de Remix
it: Pulsanti di import nella scheda home di Remix

source: The Gist, Github, Swarm, IPFS, & HTTPS buttons are to assist in getting files into Remix so you can explore.
es: Los botones Gist, Github, Swarm, IPFS y HTTPS son para ayudarle a introducir archivos en Remix para que pueda explorarlos.
fr: Les boutons Gist, Github, Swarm, IPFS, et HTTPS sont là pour vous aider à obtenir des fichiers dans Remix afin que vous puissiez les explorer.
it: I pulsanti Gist, Github, Swarm, IPFS e HTTPS sono per aiutare a ottenere i file in Remix per poterli esplorare.

source: Clicking on any of the Import buttons will bring up a modal like this one:
es: Al hacer clic en cualquiera de los botones Importar aparecerá un modal como éste:
fr: En cliquant sur l'un des boutons d'importation, vous ferez apparaître une fenêtre modale comme celle-ci :
it: Cliccando su uno dei pulsanti di import, si aprirà una finestra di dialogo come questa:

source: No need to wrap the input in quotes.
es: No es necesario encerrar la entrada entre comillas.
fr: Il n'est pas nécessaire de mettre les données entre guillemets.
it: Non è necessario racchiudere l'input tra virgolette.

source: Loading with a remix command in the console
es: Carga con un comando remix en la consola
fr: Chargement avec une commande remix dans la console
it: Caricamento con un comando remix nella console

source: The 2 remix commands for loading are:
es: Los 2 comandos de remezcla para la carga son:
fr: Les 2 commandes remix pour le chargement sont :
it: I 2 comandi di remix per il caricamento sono:

source: Accessing files loaded from the Home tab or from a remix command
es: Acceso a los archivos cargados desde la pestaña Inicio o desde un comando remix
fr: Accès aux fichiers chargés à partir de l'onglet Accueil ou d'une commande de remixage
it: Accesso ai file caricati dalla scheda Home o da un comando di remix

source: When you load from github, a folder named `github` folder is created in the root of your current workspace. To import a file from the `github` folder, you would use a command like this:
es: Cuando carga desde github, se crea una carpeta llamada `github` en la raíz de su espacio de trabajo actual. Para importar un archivo desde la carpeta `github`, utilizaría un comando como este:
fr: Lorsque vous chargez depuis github, un dossier nommé `github` est créé à la racine de votre espace de travail actuel. Pour importer un fichier depuis le dossier `github`, vous devez utiliser une commande comme celle-ci :
it: Quando si carica da github, una cartella denominata `github` viene creata nella radice dell'area di lavoro corrente. Per importare un file dalla cartella `github`, si usa un comando come questo:

source: Notice that this import statement doesn't include the version information that was in the remix.load(url) command. So it is recommended that you use the methods described at the top of this page for importing dependencies that you are not intending to edit.
es: Observe que esta sentencia import no incluye la información de versión que había en la orden remix.load(url). Así que se recomienda que utilice los métodos descritos al principio de esta página para importar dependencias que no tenga intención de editar.
fr: Notez que cette déclaration d'importation n'inclut pas les informations de version qui se trouvaient dans la commande remix.load(url). Il est donc recommandé d'utiliser les méthodes décrites en haut de cette page pour importer des dépendances que vous n'avez pas l'intention de modifier.
it: Si noti che questa dichiarazione di import non include le informazioni sulla versione che erano nel comando remix.load(url). Quindi si raccomanda di usare i metodi descritti all'inizio di questa pagina per importare le dipendenze che non si intende modificare.

source: Assume the .sol file that contained the import statement above is in the contracts folder. Notice that this import statement didn't need to traverse back to the github folder with a relative path like: **../github**.
es: Supongamos que el archivo .sol que contenía la sentencia import anterior se encuentra en la carpeta contracts. Observe que esta declaración de importación no necesitaba recorrer de nuevo a la carpeta github con una ruta relativa como: **../github**.
fr: Supposons que le fichier .sol contenant la déclaration d'importation ci-dessus se trouve dans le dossier contracts. Remarquez que cette instruction d'importation n'a pas besoin de remonter jusqu'au dossier github avec un chemin relatif comme : **../github**.
it: Supponiamo che il file .sol che conteneva la dichiarazione di import sopra si trovi nella cartella dei contratti. Si noti che questa istruzione di import non ha bisogno di risalire alla cartella github con un percorso relativo come: **../github**.
