Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr, it

source: Introduction
it: Introduzione

source: Core Modules
it: Moduli di Base

source: Solidity modules
it: Moduli di Solidity

source: Unit Testing
it: Test Unitari

source: External Tool Integrations
it: Integrazioni di strumenti esterni

source: Guides
it: Guide

source: Advanced
it: Avanzate

source: Miscellaneous
fr: Divers
it: Varie

source: Welcome to Remix's documentation!
fr: Bienvenue sur la documentation de Remix !
it: Benvenuti nella documentazione di Remix!

source: **Remix IDE** is used for the entire journey of smart contract development by users at every knowledge level. It requires no setup, fosters a fast development cycle, and has a rich set of plugins with intuitive GUIs. The IDE comes in two flavors (web app or desktop app) and as a VSCode extension.
fr: **Remix IDE** est utilisé tout au long du processus de développement des contrats intelligents par des utilisateurs de tous niveaux de connaissances. Il ne nécessite aucune installation, favorise un cycle de développement rapide et dispose d'un ensemble riche de plugins avec des interfaces graphiques intuitives. L'IDE est disponible en deux versions (web app ou desktop app) et en tant qu'extension VSCode.
it: L'**IDE Remix** viene utilizzato per l'intero percorso di sviluppo dei contratti intelligenti da utenti con qualsiasi livello di conoscenza. Non richiede alcuna configurazione, favorisce un ciclo di sviluppo rapido e dispone di una ricca serie di plugin con interfacce grafiche intuitive. L'IDE è disponibile in due versioni (applicazione web o applicazione desktop) e come estensione VSCode.

source: **Remix Online IDE**, see: `https://remix.ethereum.org <https://remix.ethereum.org>`__
fr: **Remix Online IDE**, voir : `https://remix.ethereum.org <https://remix.ethereum.org>`__
it: **IDE Remix Online**, vedere: `https://remix.ethereum.org <https://remix.ethereum.org>`__

source: Supported browsers: Firefox, Chrome, Brave. We do not support use of Remix on tablets or mobile devices.
fr: Navigateurs pris en charge : Firefox, Chrome, Brave. Nous ne prenons pas en charge l'utilisation de Remix sur les tablettes ou les appareils mobiles.
it: Browser supportati: Firefox, Chrome, Brave. Non supportiamo l'uso di Remix su tablet o dispositivi mobili.

source: **Remix Desktop IDE**, see releases: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__
fr: **Remix Desktop IDE**, voir les versions : `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__
it: **IDE Remix Desktop**, vedere la release: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__

source: **Ethereum Remix**, the VSCode extension, see `here <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. Documentation for the VSCode extension is located `here <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.
fr: **Ethereum Remix**, l'extension VSCode, voir `ici <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. La documentation de l'extension VSCode se trouve `ici <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.
it: **Ethereum Remix**, l'estensione VSCode, vedere `qui <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. La documentazione dell'estensione VSCode si trova `qui <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.

source: **Remix Documentation Translations** The Remix docs are currently in `English <https://remix-ide.readthedocs.io/en/latest/>`__ and `Simplied Chinese <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. More languages are on the way.
it: **Traduzioni della documentazione Remix** I documenti di Remix sono attualmente in "inglese". <https://remix-ide.readthedocs.io/en/latest/>`__ e `Cinese semplificato <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. Altre lingue sono in arrivo.

source: Remix Project
fr: Projet Remix
it: Progetto di Remix

source: Remix IDE is part of the `Remix Project <https://github.com/ethereum/remix-project>`__ which also includes the `Remix Plugin Engine <https://github.com/ethereum/remix-plugin>`__ and `Remix Libraries <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, which are low-level tools for wider use.
fr: Remix IDE fait partie du `Remix Project <https://github.com/ethereum/remix-project>`__ qui comprend également le `Remix Plugin Engine <https://github.com/ethereum/remix-plugin>`__ et les `Remix Libraries <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, qui sont des outils de bas niveau pour une utilisation plus large.
it: L'DIE Remix fa parte del `Progetto Remix <https://github.com/ethereum/remix-project>`__ che include anche il `Plugin Engine di Remix <https://github.com/ethereum/remix-plugin>`__ e `le librerie di Remix <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, che sono strumenti di basso livello per un uso più ampio.

source: Remix IDE is available at `remix.ethereum.org <https://remix.ethereum.org>`__ and more information can be found in these docs. Our IDE tool is available at `our GitHub repository <https://github.com/ethereum/remix-project>`__.
fr: Remix IDE est disponible sur `remix.ethereum.org <https://remix.ethereum.org>`__ et plus d'informations peuvent être trouvées dans ces documents. Notre outil IDE est disponible sur `notre dépôt GitHub <https://github.com/ethereum/remix-project>`__.
it: L'IDE Remix è disponibile all'indirizzo `remix.ethereum.org <https://remix.ethereum.org>`__ e ulteriori informazioni sono disponibili in questi documenti. Il nostro strumento IDE è disponibile sul `nostro repository GitHub<https://github.com/ethereum/remix-project>`__.

source: This set of documents covers instructions on how to use Remix. Additional information can be found in our `blog <https://medium.com/remix-ide>`__ and in our tutorial tool, `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ located inside of Remix IDE.
fr: Cet ensemble de documents couvre les instructions sur la façon d'utiliser Remix. Des informations supplémentaires peuvent être trouvées dans notre `blog <https://medium.com/remix-ide>`__ et dans notre outil de tutorat, `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ situé à l'intérieur de Remix IDE.
it: Questo insieme di documenti copre le istruzioni per l'uso di Remix. Ulteriori informazioni possono essere trovate nel nostro `blog <https://medium.com/remix-ide>`__ e nel nostro strumento di tutorial, `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ che si trova all'interno di Remix IDE.

source: Useful links:
fr: Liens utiles :
it: Link utili:

source: `Solidity Documentation <https://solidity.readthedocs.io>`__
fr: `Documentation de solidarité <https://solidity.readthedocs.io>`__
it: `Documentazione Solidity <https://solidity.readthedocs.io>`__

source: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - The version where we test new Remix release (not stable!).
fr: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - La version où nous testons la nouvelle version de Remix (pas stable !).
it: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - La versione in cui testiamo le nuove release di Remix (non stabile!).

source: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Remix Desktop's release page.
fr: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Page de publication de Remix Desktop.
it: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Pagina di rilascio di Remix Desktop.

source: `Remix on Github <https://github.com/ethereum/remix-project>`__
fr: `Remix sur Github <https://github.com/ethereum/remix-project>`__
it: `Remix su Github <https://github.com/ethereum/remix-project>`__

source: `Remix on Medium <https://medium.com/remix-ide>`__
fr: `Remix sur Medium <https://medium.com/remix-ide>`__
it: `Remix su Medium <https://medium.com/remix-ide>`__

source: `Remix on Twitter <https://twitter.com/EthereumRemix>`__
fr: `Remix sur Twitter <https://twitter.com/EthereumRemix>`__
it: `Remix su Twitter <https://twitter.com/EthereumRemix>`__

source: `Our Discord support channel <https://discord.gg/ZZSGegD7jm>`__
fr: `Notre canal de support Discord <https://discord.gg/ZZSGegD7jm>`__
it: `Il nostro canale di supporto Discord <https://discord.gg/ZZSGegD7jm>`__

source: `Ethereum.org's Developer resources <https://ethereum.org/en/developers/>`__
fr: `Ressources pour les développeurs d'Ethereum.org <https://ethereum.org/en/developers/>`__
it: `Risorse per gli sviluppatori di Ethereum.org <https://ethereum.org/en/developers/>`__

source: New Layout Intro
fr: Nouvelle mise en page de l'introduction

source: Tour of default modules
fr: Aperçu des modules par défaut

source: Tour of typical solidity modules
fr: Aperçu des des modules types de Solidity

source: Solidity Unit Testing
fr: Test unitaire Solidity

source: Native External Integrations
fr: Intégrations externes natives

source: Using Remix
fr: Utiliser Remix
