Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/layout.po
Languages: es, it

source: Navigating Remix
es: Navegando Remix
it: Navigare Remix

source: Remix IDE is comprised of three panels and a terminal.
es: Remix IDE se compone de tres paneles y un terminal.
it: L'IDE Remix è composto da tre pannelli e da un terminale.

source: Icon Panel - click to change which plugins appear in the Side Panel
es: Panel de iconos: haga clic para cambiar los plugins que aparecen en el panel lateral.
it: Icon Panel (Pannello delle icone): cliccare per modificare quale plugin visualizzare nel pannello laterale

source: Side Panel - most but not all plugins have their interface here
es: Panel lateral - la mayoría de los plugins, aunque no todos, tienen su interfaz aquí
it: Side Panel (Pannello laterale) - la maggior parte dei plugin, ma non tutti, hanno qui la loro interfaccia

source: Main Panel - for editing files, large format tools, and the home tab
es: Panel principal - para editar archivos, herramientas de gran formato y la pestaña de inicio
it: Main Panel (Pannello principale): per la modifica dei file, gli strumenti di grande formato e la scheda Home

source: Terminal - for viewing transaction receipts and various logs
es: Terminal - para ver los recibos de las transacciones y diversos registros
it: Terminal (Terminale) - per visualizzare le ricevute delle transazioni e i vari registri

source: Default Tools
es: Herramientas predeterminadas
it: Strumenti predefiniti

source: When Remix is loaded - the icon panel shows these icons by default.
es: Cuando se carga Remix, el panel de iconos muestra estos iconos por defecto.
it: Quando Remix viene caricato - il pannello delle icone mostra queste icone per impostazione predefinita.

source: To load more plugins go to the **[Plugin Manager](#plugin-manager)** or click on one of the featured plugins in the home tab.
es: Para cargar más plugins vaya al **[Gestor de plugins](#plugin-manager)** o haga clic en uno de los plugins destacados en la pestaña de inicio.
it: Per caricare altri plugin, andare al **[Gestore dei Plugin](#plugin-manager)** o cliccare su uno dei plugin in evidenza nella scheda iniziale.

source: Home tab
es: Ficha Inicio
it: Scheda Home

source: The home tab is located in the Main Panel. It can be closed, just like any of the main panel tabs. <br> You can also access it (even if closed) by clicking the Remix logo at the top of the icon panel.
es: La pestaña de inicio se encuentra en el panel principal. Puede cerrarse, como cualquiera de las pestañas del panel principal. <br> También puede acceder a ella (aunque esté cerrada) haciendo clic en el logotipo de Remix situado en la parte superior del panel de iconos.
it: La scheda Home si trova nel Pannello principale. Essa può essere chiusa, come tutte le schede del pannello principale. È anche possibile accedervi (anche se chiusa) cliccando sul logo di Remix nella parte superiore del pannello delle icone.

source: The home tab contains links to resources, announcements, tutorials, featured plugins and methods for loading files into Remix and shortcuts for connecting Remix to your local filesystem.
es: La pestaña de inicio contiene enlaces a recursos, anuncios, tutoriales, plugins destacados y métodos para cargar archivos en Remix y accesos directos para conectar Remix a su sistema de archivos local.
it: La scheda home contiene io collegamenti a risorse, annunci, tutorial, plugin in evidenza e metodi per caricare i file in Remix e comandi di scelta rapida per collegare Remix al filesystem locale.

source: Solidity
es: Solidez

source: Clicking the **Solidity button** in the featured plugins section of the home tab will activate **Solidity Static Analysis** and **Solidity Unit Testing** as well as the Solidity Compiler and Deploy & Run (which are there by default).
es: Al hacer clic en el botón **Solidity** de la sección de plugins destacados de la pestaña de inicio, se activarán **Solidity Static Analysis** y **Solidity Unit Testing**, así como Solidity Compiler y Deploy & Run (que están ahí por defecto).
it: Facendo clic sul pulsante **Solidity** nella sezione dei plugin in evidenza della scheda home, si attiveranno **Analisi Statica di Solidity** e **Unit Test di Solidity**, oltre al Compilatore Solidity e Distribuisci&Esegui (che sono presenti per impostazione predefinita).

source: To see all the plugins go to the **Plugin Manager** - by selecting the plug in the icon panel. ![](images/a-plug.png) <br> You can also get there by clicking the **More** button in the featured plugin list.
es: Para ver todos los plugins vaya al **Administrador de plugins** - seleccionando el plugin en el panel de iconos. ![](images/a-plug.png) <br> También puede llegar allí haciendo clic en el botón **Más** de la lista de plugins destacados.
it: Per vedere tutti i plugin, accedere al **Gestore di Plugin** - selezionando la spina nel pannello delle icone. ![](images/a-plug.png) <br> È anche possibile accedervi cliccando sul pulsante **Altro** nell'elenco dei plugin in evidenza.

source: Plugin Manager
es: Gestor de plugins
it: Gestore di Plugin

source: In Remix, you only need to load the functionality you need - and the Plugin Manger is where you manage what plugins are turned off or on.
es: En Remix, sólo tiene que cargar la funcionalidad que necesita - y el Plugin Manger es donde se gestiona qué plugins están activados o desactivados.
it: In Remix, è necessario caricare solo le funzionalità necessarie - e il Gestore di Plugin è il luogo in cui si gestiscono quali plugin sono disattivati o attivati.

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix. In that case you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
es: El Gestor de Plugins es también el lugar al que debe acudir cuando esté creando su propio plugin y desee cargar su plugin local en Remix. En ese caso haría clic en el enlace "Conectar a un plugin local" en la parte superior del panel del Gestor de plugins.
it: Il Gestore di Plugin è anche il posto dove andare quando vuoi creare i tuoi plugin e vuoi caricare i tuoi plugin locali in Remix. In quel caso dovrai cliccare su link "Connetti a un Plugin Locale" sopra al pannello del Gestore di Plugin.

source: Themes
es: Temas
it: Temi

source: Themes are chosen at the bottom of the **Settings** plugin. These are Bootstrap-based themes. The Dark and Light themes are most customized for Remix.
es: Los temas se eligen en la parte inferior del plugin **Configuración**. Se trata de temas basados en Bootstrap. Los temas Dark y Light son los más personalizados para Remix.
it: I temi si scelgono in fondo al plugin **Impostazioni**. Si tratta di temi basati su Bootstrap. I temi Dark (Scuro) e Light (Chiaro) sono i più personalizzati per Remix.
