Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/locations.po
Languages: es, fr, it

source: Load a Solidity contract from Github
es: Cargar un contrato Solidity desde Github
fr: Chargez un contrat Solidity depuis Github
it: Carica un contratto Solidity da Github

source: With a github url of a Solidity contract like this one:
es: Con una url github de un contrato Solidity como éste:
fr: Avec l'url github d'un contrat Solidity comme celui-ci :
it: Con un url github di un contratto Solidity come questo:

source: Then delete the **github** part and type in **remix.ethereum.org** in its place, like this:
es: A continuación, elimine la parte **github** y escriba **remix.ethereum.org** en su lugar, así:
fr: Ensuite, supprimez la partie **github** et tapez **remix.ethereum.org** à la place, comme ceci :
it: Quindi cancella la parte **github** e digita **remix.ethereum.org** al suo posto, in questo modo:

source: Remix will fetch the Solidity file and open it up in the File Explorer in a Workspace named<br> **code-sample**.
es: Remix obtendrá el archivo Solidity y lo abrirá en el Explorador de archivos en un espacio de trabajo llamado<br> **código-muestra**.
fr: Remix récupère le fichier Solidity et l'ouvre dans l'explorateur de fichiers dans un espace de travail nommé<br> **code-sample**.
it: Remix recupererà il file Solidity e lo aprirà in Esplora File in un'area di lavoro denominata<br> **codice-campione**.

source: Load a GIST
es: Cargar un GIST
fr: Charger une GIST
it: Carica un GIST

source: The URL parameter here is `gist`.
es: El parámetro URL aquí es `gist`.
fr: Le paramètre de l'URL est ici `gist`.
it: Il parametro URL qui è `gist`.

source: Load a GIST and have it be visible in the Editor:
es: Cargue un GIST y haga que sea visible en el Editor:
fr: Chargez une GIST et faites en sorte qu'elle soit visible dans l'éditeur :
it: Carica un GIST e fai in modo che sia visibile nell'Editor:

source: Using both `gist` & `call`
es: Utilizando tanto `gist` como `call`
fr: Utiliser à la fois `gist` et `call`
it: Usando sia `gist` che `call`

source: Load a GIST, have it be visible in the Editor & load a list of plugins:
es: Cargue un GIST, haga que sea visible en el Editor y cargue una lista de plugins:
fr: Chargez une GIST, faites en sorte qu'elle soit visible dans l'éditeur et chargez une liste de plugins :
it: Carica un GIST, fai in modo che sia visibile nell'Editor e carica un elenco di plugin:

source: Load a specific version of the Solidity compiler:
es: Cargue una versión específica del compilador de Solidity:
fr: Charger une version spécifique du compilateur Solidity :
it: Carica una versione specifica del compilatore Solidity:

source: **Note:** you need to specify both the Solidity version and the commit.
es: **Nota:** debe especificar tanto la versión de Solidity como el commit.
fr: **Note:** vous devez spécifier à la fois la version de Solidity et le commit.
it: **Nota.** devi specificare sia la versione di Solidity che il commit.

source: Load a custom Solidity compiler:
es: Cargue un compilador de Solidity personalizado:
fr: Chargez un compilateur Solidity personnalisé :
it: Carica un compiler di Solidity personalizzato:

source: Turn on autoCompile:
es: Active la autocompilación:
fr: Activez la compilation automatique :
it: Attiva autoCompile:

source: Select the language for the Solidity Compiler
es: Seleccione el idioma para el compilador de Solidity
fr: Sélectionnez la langue du compilateur Solidity
it: Seleziona la lingua per il Compilatore di Solidity

source: Choose YUL or Solidity with the language parameter.
es: Elija YUL o Solidity con el parámetro de idioma.
fr: Choisissez YUL ou Solidity avec le paramètre linguistique.
it: Scegli YUL o Solidity con il parametro della lingua.
