Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/locations.po
Languages: es, fr, it

source: Remix URLs & Links with Parameters
es: Remezclar URL y enlaces con parámetros
fr: Remixer des URL et des liens avec des paramètres
it: URL Remix e Link con i parametri

source: Main Remix URLs
es: Principales URL de remezclas
fr: Principaux URL de remixage
it: URL Remix Principale

source: Remix IDE Online is located at [https://remix.ethereum.org](https://remix.ethereum.org).
es: Remix IDE Online se encuentra en [https://remix.ethereum.org](https://remix.ethereum.org).
fr: Remix IDE Online est situé à l'adresse [https://remix.ethereum.org](https://remix.ethereum.org).
it: L'IDE Remix Online si trova all'indirizzo [https://remix.ethereum.org](https://remix.ethereum.org).

source: The alpha version of remix is located at [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). This is not a stable version.
es: La versión alfa de remix se encuentra en [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). No se trata de una versión estable.
fr: La version alpha de remix se trouve à l'adresse [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). Il ne s'agit pas d'une version stable.
it: La versione alfa di remix si trova all'indirizzo [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). Questa non è una versione stabile.

source: Github repo: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). The README contains instructions for running Remix-IDE locally.
es: Repo de Github: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). El README contiene instrucciones para ejecutar Remix-IDE localmente.
fr: Github repo : [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). Le README contient des instructions pour exécuter Remix-IDE localement.
it: Repository Github: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). Il README contiene le istruzioni per eseguire Remix-IDE in locale.

source: Remix Desktop is an Electron App. Here is the [release page](https://github.com/ethereum/remix-desktop/releases).
es: Remix Desktop es una aplicación de Electron. Aquí está la [página de lanzamiento](https://github.com/ethereum/remix-desktop/releases).
fr: Remix Desktop est une application Electron. Voici la [page de publication] (https://github.com/ethereum/remix-desktop/releases).
it: Remix Desktop è un'applicazione Electron. Qui la [pagina di rilascio] (https://github.com/ethereum/remix-desktop/releases).

source: Remix has a VSCode extension called [Ethereum Remix](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).
es: Remix tiene una extensión VSCode llamada [Ethereum Remix](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).
fr: Remix dispose d'une extension VSCode appelée [Ethereum Remix] (https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).
it: Remix ha un'estensione VSCode chiamata [Remix Ethereum](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).

source: The Remix twitter account is [EthereumRemix](https://twitter.com/EthereumRemix).
es: La cuenta de Twitter de Remix es [EthereumRemix](https://twitter.com/EthereumRemix).
fr: Le compte twitter de Remix est [EthereumRemix](https://twitter.com/EthereumRemix).
it: L'account twitter di Remix è [EthereumRemix](https://twitter.com/EthereumRemix).

source: The Remix Project Medium publication is: [https://medium.com/remix-ide](https://medium.com/remix-ide).
es: La publicación Remix Project Medium es: [https://medium.com/remix-ide](https://medium.com/remix-ide).
fr: Le support de publication du projet Remix est le suivant : [https://medium.com/remix-ide](https://medium.com/remix-ide).
it: La pubblicazione del Progetto Remix su Medium è: [https://medium.com/remix-ide](https://medium.com/remix-ide).

source: The [Remix Project](https://remix-project.org) website introduces the different facets of our project.
es: La página web del [Proyecto Remix](https://remix-project.org) presenta las diferentes facetas de nuestro proyecto.
fr: Le site web du [Projet Remix] (https://remix-project.org) présente les différentes facettes de notre projet.
it: Il sito web del [Proggetto Remix](https://remix-project.org) presenta i diversi aspetti del nostro progetto.

source: The [Remix Gitter Channel](https://gitter.im/ethereum/remix) is a forum to post your questions about Remix.
es: El [Canal Remix Gitter](https://gitter.im/ethereum/remix) es un foro para publicar sus preguntas sobre Remix.
fr: Le [Remix Gitter Channel] (https://gitter.im/ethereum/remix) est un forum où vous pouvez poser vos questions sur Remix.
it: Il [Canale Gitter di Remix](https://gitter.im/ethereum/remix) è un forum dove postare le proprie domande su Remix.

source: Customize Remix with URL Parameters
es: Personalizar Remix con parámetros URL
fr: Personnaliser Remix avec des paramètres d'URL
it: Personalizzare Remix con i parametri URL

source: There are many ways to customize Remix IDE by using url parameters. Here are some options:
es: Hay muchas formas de personalizar el IDE Remix utilizando parámetros url. Aquí tiene algunas opciones:
fr: Il y a plusieurs façons de personnaliser l'IDE Remix en utilisant des paramètres d'url. Voici quelques options :
it: Ci sono diversi modi per personalizzare l'IDE Remix utilizzando i parametri url. Ecco alcune opzioni:

source: Activate or deactivate a **list of plugins to be activated** - and specify which plugin gains the "focus". [SEE MORE](#activating-a-list-of-plugins)
es: Active o desactive una **lista de plugins a activar** - y especifique qué plugin gana el "foco". [VER MÁS](#activar-una-lista-de-plugins)
fr: Activez ou désactivez une **liste de plugins à activer** - et spécifiez quel plugin a la priorité. [VOIR PLUS](#activation-d'une-liste-de-plugins)
it: Attiva o disattiva un **elenco di plugin da attivare** e specifica quale plugin ottiene il "focus". [VEDI DI PIÙ](#activating-a-list-of-plugins)

source: Send **commands to a plugin** - once the plugin loads. [SEE MORE](#pass-commands-to-a-plugin-s-api-via-a-url-param)
es: Enviar **comandos a un plugin** - una vez que el plugin se carga. [VER MÁS](#enviar-comandos-a-un-plugin-s-api-via-a-url-param)
fr: Envoyer des **commandes à un plugin** - une fois que le plugin est chargé. [VOIR PLUS](#pass-commands-to-a-plugin-s-api-via-a-url-param)
it: Invia **comandi a un plugin** - una volta caricato il plugin. [VEDI DI PIÙ](#pass-commands-to-a-plugin-s-api-via-a-url-param)

source: [Load a GIST](#load-a-gist), [a file via a url](#load-a-file-via-a-url-into-the-editor) or a [base64 encoded string](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) into Remix's Editor.
es: [Cargue un GIST](#load-a-gist), [un archivo a través de una url](#load-a-file-via-a-url-into-the-editor) o una [cadena codificada en base64](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) en el Editor de Remix.
fr: [Charger une GIST](#load-a-gist), [un fichier via une url](#load-a-file-via-a-url-into-the-editor) ou une [chaîne encodée en base64](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) dans l'éditeur de Remix.
it: [Carica un GIST](#load-a-gist), [un file tramite un url](#load-a-file-via-a-url-into-the-editor) o una [stringa codificata in base64](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) nell'editor di Remix.

source: Specify **the theme** (Dark or Light). [SEE MORE](#specifying-a-theme)
es: Especifique **el tema** (Oscuro o Claro). [VEA MÁS](#especificar-un-tema)
fr: Spécifiez **le thème** (Sombre ou Clair). [VOIR PLUS](#specifying-a-theme)
it: Specifica **il tema** (scuro o chiaro). [VEDI DI PIÙ](#specifying-a-theme)

source: Specify which panels should be **minimized** - useful when embedding Remix in your site. [SEE MORE](#minimizing-remix-panels)
es: Especifique qué paneles deben ser **minimizados** - útil cuando incruste Remix en su sitio. [VER MÁS](#minimizing-remix-panels)
fr: Spécifiez quels panneaux doivent être **minimisés** - utile lorsque vous intégrez Remix dans votre site. [EN SAVOIR PLUS](#minimisation-des-panneaux-de-remix)
it: Specifica quali pannelli devono essere **minimizzati** - utile quando si incorpora Remix nel proprio sito. [VEDI PIÙ](#minimizing-remix-panels)

source: Select the **version of the Solidity** compiler, enable/disable the **optimizer**, turn on auto compile or choose the language for the Solidity compiler. [SEE MORE](#load-a-specific-version-of-the-solidity-compiler)
es: Seleccione la **versión del compilador Solidity**, active/desactive el **optimizador**, active la autocompilación o elija el idioma para el compilador Solidity. [VEA MÁS](#cargar-una-versión-específica-del-compilador-solidity)
fr: Sélectionnez la **version du compilateur Solidity**, activez/désactivez l'**optimiseur**, activez la compilation automatique ou choisissez la langue du compilateur Solidity. [VOIR PLUS](#charger-une-version-spécifique-du-compilateur-Solidity)
it: Seleziona la **versione del compilatore Solidity**, abilita/disabilita l'**ottimizzatore**, attiva la compilazione automatica o scegli la lingua per il compilatore Solidity. [VEDI DI PIÙ](#load-a-specific-version-of-the-solidity-compiler)

source: Load **verified contracts from Etherscan** using contract address [SEE MORE](#load-contracts-from-etherscan-via-address)
es: Cargar **contratos verificados desde Etherscan** utilizando la dirección del contrato [VER MÁS](#load-contracts-from-etherscan-via-address)
fr: Charger des **contrats vérifiés depuis Etherscan** en utilisant l'adresse du contrat [VOIR PLUS](#load-contracts-from-etherscan-via-address)
it: Carica **contratti verificati da Etherscan** usando l'indirizzo del contratto [VEDI DI PIÙ](#load-contracts-from-etherscan-via-address)

source: Activating a list of plugins
es: Activación de una lista de plugins
fr: Activation d'une liste de plugins
it: Attivare un elenco di plugin

source: The following example contains the url parameter **activate** followed by **a comma separated list of plugins**.
es: El siguiente ejemplo contiene el parámetro url **activar** seguido de **una lista de plugins separada por comas**.
fr: L'exemple suivant contient le paramètre url **activate** suivi de **une liste de plugins** séparés par des virgules.
it: L'esempio seguente contiene il parametro url **attiva** seguito da **un elenco separato da virgole di plugin**.

source: The last plugin in the list will gain the focus.
es: El último plugin de la lista ganará el foco.
fr: Le dernier plugin de la liste sera mis en avant.
it: L'ultimo plugin nella lista guadagnerà il focus.

source: When you use the activate list, all other plugins that a user had loaded will be deactivated. This does not apply to the file explorer, the plugin manager, and the settings modules because these are never deactivated.
es: Cuando utilice la lista de activación, se desactivarán todos los demás plugins que el usuario tuviera cargados. Esto no se aplica al explorador de archivos, al gestor de plugins ni a los módulos de configuración, ya que éstos nunca se desactivan.
fr: Lorsque vous utilisez la liste d'activation, tous les autres plugins chargés par l'utilisateur sont désactivés. Cela ne s'applique pas à l'explorateur de fichiers, au gestionnaire de plugins et aux modules de configuration, car ils ne sont jamais désactivés.
it: Quando si utilizza l'elenco di attivazione, tutti gli altri plugin caricati dall'utente vengono disattivati. Questo non vale per l'esplora file, il gestore di plugin e i moduli di impostazione, perché non vengono mai disattivati.

source: Note: a plugin is called by its **name** as specified in its profile. There are 3 types of plugins:
es: Nota: un plugin se llama por su **nombre** especificado en su perfil. Existen 3 tipos de plugins:
fr: Note : un plugin est appelé par son **nom** tel que spécifié dans son profil. Il existe 3 types de plugins :
it: Nota: un plugin viene chiamato con il suo **nome**, come specificato nel suo profilo. Esistono 3 tipi di plugin:

source: **Native Mandatory Plugins** that are always loaded (so you don't need to activate them using the url parameter **activate**). These include: **fileManager**, **settings**, **manager** (the plugin manager), and **udapp** (deploy & run).
es: **Plugins nativos obligatorios** que se cargan siempre (por lo que no es necesario activarlos mediante el parámetro url **activar**). Entre ellos se incluyen: **fileManager**, **settings**, **manager** (el gestor de plugins), y **udapp** (desplegar y ejecutar).
fr: **Plugins obligatoires natifs** qui sont toujours chargés (vous n'avez donc pas besoin de les activer à l'aide du paramètre url **activate**). Il s'agit des plugins suivants : **fileManager**, **settings**, **manager **fileManager**, **settings**, **manager** (le gestionnaire de plugins), et **udapp** (déployer et exécuter).
it: I **Plugin obbligatori nativi** che vengono sempre caricati (quindi non è necessario attivarli usando il parametro url **attiva**). Questi includono: **gestoreFile**, **impostazioni**, **gestore** (il gestore dei plugin) e **udapp** ( distribuisci & esegui).

source: **Native Optional Plugins** that are loaded on demand: **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting**, and **vyper**
es: **Plugins opcionales nativos** que se cargan bajo demanda: **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting** y **vyper**.
fr: **Plugins optionnels natifs** qui sont chargés à la demande : **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting**, et **vyper**.
it: **Plugin opzionali nativi** che vengono caricati su richiesta: **debugger**, **hardhat-provider**, **solidity**, **anlisiStaticaSolidity**, **analisiUnitariaSolidity** e **vyper**

source: **External Plugins** to get these plugins' names, please go to [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).
es: **Plugins externos** para obtener los nombres de estos plugins, visite [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).
fr: **Plugins externes** pour obtenir les noms de ces plugins, veuillez consulter [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).
it: **Plugin Esterni" ter ottenere i nomi di questi plugin, visita [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).

source: Deactiving a list of plugins
es: Desactivación de una lista de plugins
fr: Désactivation d'une liste de plugins
it: Disattivare un elenco di plugin

source: Minimizing Remix panels
es: Minimizar los paneles Remix
fr: Minimiser les panneaux Remix
it: Minimizzare i Pannelli di Remix

source: The following URL will **close everything except the main panel & the icon panel** (the side and terminal are minimized).
es: La siguiente URL **cerrará todo excepto el panel principal y el panel de iconos** (el lateral y el terminal se minimizan).
fr: L'URL suivante **fermera tout sauf le panneau principal et le panneau d'icônes** (le panneau latéral et le terminal sont minimisés).
it: Il seguente URL **chiude tutto tranne il pannello principale e il pannello delle icone** (il lato e il terminale sono ridotti a icona).

source: To minimize just the side panel, use this URL:
es: Para minimizar sólo el panel lateral, utilice esta URL:
fr: Pour réduire uniquement le panneau latéral, utilisez cette URL :
it: Per minimizzare solo il pannello laterale, utilizzare questo URL:

source: To minimize just the terminal, use this URL:
es: Para minimizar sólo el terminal, utilice esta URL:
fr: Pour minimiser uniquement le terminal, utilisez cette URL :
it: Per minimizzare solo il terminale, utilizzare questo URL:

source: Specifying a theme
es: Especificar un tema
fr: Spécifier un thème
it: Specifica un tema

source: To link to Remix with a theme specified use this url:
es: Para enlazar a Remix con un tema especificado utilice esta url:
fr: Pour créer un lien vers Remix avec un thème spécifié, utilisez cette url :
it: Per collegare Remix con un tema specificato usare questo url:

source: A URL example combining multiple parameters
es: Un ejemplo de URL que combina varios parámetros
fr: Exemple d'URL combinant plusieurs paramètres
it: Un esempio di URL che combina più parametri

source: To link to Remix with the a list of plugins activated and with:
es: Para enlazar con Remix con la una lista de plugins activados y con:
fr: Pour établir un lien vers Remix avec la liste des plugins activés et avec :
it: Per collegare Remix con un elenco di plugin attivati e con:

source: the Learneth gaining the side panel's focus (because it is the last in the list)
es: el Learneth ganando el foco del panel lateral (porque es el último de la lista)
fr: le Learneth gagne le focus du panneau latéral (parce qu'il est le dernier de la liste)
it: il Learneth che ottiene il focus del pannello laterale (perché è l'ultimo dell'elenco)

source: the Light theme loaded
es: el tema Luz cargado
fr: le thème Light est chargé
it: il tema Chiaro caricato

source: the terminal minimized
es: el terminal minimizado
fr: le terminal minimisé
it: il terminale minimizzato

source: optimize off
es: optimizar
fr: Optimiser la désactivation
it: "ottimizza" spento

source: use this url:
es: utilice esta url:
fr: utilisez cette url :
it: usa questo url:

source: Pass commands to a plugin's API via a url param
es: Pasar comandos a la API de un plugin a través de un parámetro url
fr: Passer des commandes à l'API d'un plugin via un paramètre url
it: Passa i comandi all'API di un plugin tramite un parametro url

source: The URL parameter to issue a command is `call`. Following the `call` is a // (double slash) separated list of arguments.
es: El parámetro URL para emitir un comando es `call`. A continuación de `call` hay una lista de argumentos separados por // (doble barra).
fr: Le paramètre de l'URL pour lancer une commande est `call`. Après `call` se trouve une liste d'arguments séparés par // (double slash).
it: Il parametro URL per impartire un comando è `invocazione`. Dopo l'`invocazione` c'è un elenco di argomenti separati da // (doppio slash).

source: An example using call
es: Un ejemplo utilizando la llamada
fr: Exemple d'appel
it: Un esempio che utilizza una invocazione

source: The URL below uses `activate` & `call`. It **activates** a number of plugins and **calls** the File Explorers to tell it to load one of the default Remix files:
es: La siguiente URL utiliza `activate` y `call`. **activa** una serie de plugins y **llama** al Explorador de archivos para indicarle que cargue uno de los archivos Remix predeterminados:
fr: L'URL ci-dessous utilise `activate` et `call`. Elle **active** un certain nombre de plugins et **appelle** l'explorateur de fichiers pour lui demander de charger l'un des fichiers Remix par défaut :
it: L'URL sottostante utilizza `attiva` e `invoca`. Esso **attiva** un certo numero di plugin e **invoca** Esplora File per dirgli di caricare uno dei file predefiniti di Remix:

source: Load a specific tutorial in the **LearnEth** plugin:
es: Cargue un tutorial específico en el plugin **LearnEth**:
fr: Chargez un tutoriel spécifique dans le plugin **LearnEth** :
it: Carica un tutorial specifico nel plugin **LearnEth**:

source: Make calls to a number of different plugins' APIs
es: Realizar llamadas a varias API de diferentes plugins
fr: Faire des appels à un certain nombre d'API de plugins différents
it: Invoca le API di una serie di plugin diversi

source: Use the `calls` parameter to call a series of plugins. Use `///` to separate the calls.
es: Utilice el parámetro `calls` para llamar a una serie de plugins. Utilice `///` para separar las llamadas.
fr: Utilisez le paramètre `calls` pour appeler une série de plugins. Utilisez `///` pour séparer les appels.
it: Usa il parametro `calls` per chiamare una serie di plugin. Usa `///` per separare le chiamate.

source: For example, this command, after activating a list of plugins, calls the LearnEth plugin's API and then calls the File Explorer's API.
es: Por ejemplo, este comando, tras activar una lista de plugins, llama a la API del plugin LearnEth y, a continuación, llama a la API del Explorador de archivos.
fr: Par exemple, cette commande, après avoir activé une liste de plugins, appelle l'API du plugin LearnEth, puis l'API de l'explorateur de fichiers.
it: Ad esempio, questo comando, dopo aver attivato un elenco di plugin, chiama l'API del plugin LearnEth e poi l'API di Esplora File.

source: Load a file via a URL into the Editor
es: Cargar un archivo a través de una URL en el Editor
fr: Charger un fichier via une URL dans l'éditeur
it: Carica un file nell'Editor tramite un URL

source: The `url` parameter takes a URL, loads it into the Editor and saves it into the code-sample workspace of the File Explorer:
es: El parámetro `url` toma una URL, la carga en el Editor y la guarda en el espacio de trabajo código-muestra del Explorador de archivos:
fr: Le paramètre `url` prend une URL, la charge dans l'éditeur et l'enregistre dans l'espace de travail de l'explorateur de fichiers :
it: Il parametro `url` prende un URL, lo carica nell'Editor e lo salva nell'area di lavoro dell'Esplora File:

source: Load an encoded base64 string into a .sol file in the Editor
es: Cargar una cadena base64 codificada en un archivo .sol en el Editor
fr: Charger une chaîne encodée base64 dans un fichier .sol dans l'éditeur
it: Carica una stringa base64 codificata in un file .sol nell'Editor

source: The `code` parameter takes an encoded base64 string and loads it into the Editor as a .sol file and saves to the code-sample workspace of the File Explorer:
es: El parámetro `code` toma una cadena codificada en base64 y la carga en el Editor como un archivo .sol y la guarda en el espacio de trabajo código-muestra del Explorador de archivos:
fr: Le paramètre `code` prend une chaîne encodée base64 et la charge dans l'éditeur en tant que fichier .sol et l'enregistre dans l'espace de travail code-sample de l'explorateur de fichiers :
it: Il parametro `code ` prende una stringa codificata in base64 e la carica nell'editor come file .sol e la salva nell'area di lavoro del codice campione dell'Esplora File:

source: Load contracts from Etherscan via address
es: Cargar contratos desde Etherscan a través de la dirección
fr: Charger des contrats à partir d'Etherscan via l'adresse
it: Carica contratti da Etherscan tramite l'indirizzo

source: The `address` parameter takes an address, loads all the **verified contracts** found for the address on different Ethereum networks and saves them into the `etherscan-code-sample` workspace of the File Explorer:
es: El parámetro `address` toma una dirección, carga todos los **contratos verificados** encontrados para la dirección en diferentes redes Ethereum y los guarda en el espacio de trabajo `etherscan-code-sample` del Explorador de archivos:
fr: Le paramètre `address` prend une adresse, charge tous les **contrats vérifiés** trouvés pour l'adresse sur différents réseaux Ethereum et les enregistre dans l'espace de travail `etherscan-code-sample` de l'explorateur de fichiers :
it: Il parametro `address` prende un indirizzo, carica tutti i **contratti verificati** trovati per l'indirizzo su diverse reti Ethereum e li salva nell'area di lavoro `etherscan-code-sample` dell'Esplora File:
