Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: fr, it, zh_cn

source: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon is a language that reads like a legal contract and compile into Solidity (and then bytecode). This plugin allow you to take Lexon code and to <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)
fr: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon est un langage qui se lit comme un contrat légal et se compile en Solidity (puis en bytecode). Ce plugin vous permet de prendre du code Lexon et de <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json) : lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)
zh_cn: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon 是一种读起来像法律合同的语言，并编译成 Solidity（然后是字节码）。此插件允许您获取 Lexon 代码并进行以下操作：<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[文档](https://gitlab.com/lexon-foundation/lexon-remix) <br>[创建issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)

source: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compile and Deploy to the Moonbeam network <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Make an issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)
fr: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compiler et déployer sur le réseau Moonbeam <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json) : moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Créer un problème](https://github.com/PureStake/moonbeam-remix-plugin/issues)
zh_cn: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>编译并部署到 Moonbeam 网络 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[文档](https://github.com/purestake/moonbeam-remix-plugin) <br>[提交issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)

source: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Free version and paid version for Mythx analysis. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Make an issue](https://github.com/aquiladev/remix-mythx-plugin/issues)
fr: **Vérification de la sécurité de Mythx** &nbsp; ![](images/pi-mythx.png) <br>Version gratuite et version payante pour l'analyse de Mythx. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json) : mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Créer un problème](https://github.com/aquiladev/remix-mythx-plugin/issues)
zh_cn: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Mythx分析有免费版和付费版。 <br>[配置文件名](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[文档](https://docs.mythx.io/tools-integrations/remix) <br>[提交issue](https://github.com/aquiladev/remix-mythx-plugin/issues)

source: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compile solidity contracts for the Nahmii network <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Make an issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)
fr: **Compilateur Nahmii** &nbsp; ![](images/pi-moonbeam.png) <br>Compile les contrats solidity pour le réseau Nahmii <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json) : nahmii-compiler <br>[Make an issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)
zh_cn: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>为Nahmii网络编译Solidity合约 <br>[个人资料名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[提出issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)

source: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Makes a basic front end for your contract once it is deployed on a public testnet. [profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Make an issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)
fr: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Crée un front-end basique pour votre contrat une fois qu'il est déployé sur un réseau de test public. [Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json) : oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Créer un problème](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)
zh_cn: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>在公共测试网络上部署合约后，为其创建一个基本的前端。 [配置文件名](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[文档](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[提交issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)

source: **Proveable Oracle Services** &nbsp; ![](images/pi-proveable.png) <br>An oracle for the Remix VM environment. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/provable/profile.json): provable <br>[Documentation](https://docs.provable.xyz/#development-tools-remix-ide-provable-plugin)
fr: **Proveable Oracle Services** &nbsp; ![](images/pi-proveable.png) <br>Un oracle pour l'environnement Remix VM. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/provable/profile.json) : provable <br>[Documentation](https://docs.provable.xyz/#development-tools-remix-ide-provable-plugin)
zh_cn: **Proveable Oracle Services** &nbsp; ![](images/pi-proveable.png) <br>Remix VM 环境下的 Oracle。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/provable/profile.json): provable <br>[文档](https://docs.provable.xyz/#development-tools-remix-ide-provable-plugin)

source: **Quorum Network** &nbsp; ![](images/pi-quorum.png) <br>A Connection to Quorum <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/quorum/profile.json): quorum <br>[Documentation](https://medium.com/remix-ide/quorum-plugin-for-remix-ee232ebca64c) <br>[Make an issue](https://github.com/ConsenSys/quorum-remix/issues)
fr: **Réseau Quorum** &nbsp; ![](images/pi-quorum.png) <br>Une connexion à Quorum <br>[nom de profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/quorum/profile.json) : quorum <br>[Documentation](https://medium.com/remix-ide/quorum-plugin-for-remix-ee232ebca64c) <br>[Créer un problème](https://github.com/ConsenSys/quorum-remix/issues)
zh_cn: **Quorum Network** &nbsp; ![](images/pi-quorum.png) <br>连接到Quorum <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/quorum/profile.json): quorum <br>[文档](https://medium.com/remix-ide/quorum-plugin-for-remix-ee232ebca64c) <br>[提交issue](https://github.com/ConsenSys/quorum-remix/issues)网络

source: **Solhint Linter** &nbsp; ![](images/pi-solhint.png) <br>Solidity Linter providing both Security and Style Guide validations. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/solhint/profile.json): solhint <br>[Documentation](https://protofire.github.io/solhint/docs/rules.html) <br>[Make an issue](https://github.com/protofire/remix-solhint-plugin)
fr: **Solhint Linter** &nbsp; ![](images/pi-solhint.png) <br>Solidity Linter fournissant à la fois des validations de sécurité et de guide de style. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/solhint/profile.json) : solhint <br>[Documentation](https://protofire.github.io/solhint/docs/rules.html) <br>[Créer un problème](https://github.com/protofire/remix-solhint-plugin)
zh_cn: **Solhint Linter** &nbsp; ![](images/pi-solhint.png) <br>提供安全性和代码风格验证的Solidity代码检查工具。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/solhint/profile.json): solhint <br>[文档](https://protofire.github.io/solhint/docs/rules.html) <br>[提交issue](https://github.com/protofire/remix-solhint-plugin)

source: **Solidity 2 UML** &nbsp; ![](images/pi-sol2uml.png) <br>Generate UML diagrams from a compiled Solidity file <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/sol2uml/profile.json): sol2uml <br>[Documentation](https://github.com/aquiladev/remix-sol2uml) <br>[Make an issue](https://github.com/aquiladev/remix-sol2uml)
fr: **Solidity 2 UML** &nbsp; ![](images/pi-sol2uml.png) <br>Génère des diagrammes UML à partir d'un fichier Solidity compilé <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/sol2uml/profile.json) : sol2uml <br>[Documentation](https://github.com/aquiladev/remix-sol2uml) <br>[Make an issue](https://github.com/aquiladev/remix-sol2uml)
zh_cn: **Solidity 2 UML** &nbsp; ![](images/pi-sol2uml.png) <br>从已编译的 Solidity 文件生成 UML 图表 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/sol2uml/profile.json): sol2uml <br>[文档](https://github.com/aquiladev/remix-sol2uml) <br>[提交issue](https://github.com/aquiladev/remix-sol2uml)

source: **Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verify you contracts and fetch verified contracts <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentation](https://github.com/ethereum/sourcify) <br>[Make an issue](https://github.com/sourcifyeth/remix-sourcify/issues)
fr: **Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Vérifiez vos contrats et récupérez les contrats vérifiés <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json) : sourcify <br>[Documentation](https://github.com/ethereum/sourcify) <br>[Faire une demande](https://github.com/sourcifyeth/remix-sourcify/issues)
zh_cn: **Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>验证您的合约并获取已验证的合约 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[文档](https://github.com/ethereum/sourcify) <br>[提交issue](https://github.com/sourcifyeth/remix-sourcify/issues)

source: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile contracts written in Cairo to Starknet <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starkNet_compiler/profile.json): starkNet_compiler <br>[Documentation](https://github.com/hexdivision/starkware-remix-plugin) <br>[Make an issue](https://github.com/hexdivision/starkware-remix-plugin/issues)
fr: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile les contrats rédigés au Caire vers Starknet <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starkNet_compiler/profile.json) : starkNet_compiler <br>[Documentation](https://github.com/hexdivision/starkware-remix-plugin) <br>[Make an issue](https://github.com/hexdivision/starkware-remix-plugin/issues)
zh_cn: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>将使用Cairo编写的合约编译到Starknet上 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starkNet_compiler/profile.json): starkNet_compiler <br>[文档](https://github.com/hexdivision/starkware-remix-plugin) <br>[提交issue](https://github.com/hexdivision/starkware-remix-plugin/issues)

source: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verify Contracts. Import To Remix From your Tenderly project. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Make an issue](/issues)
fr: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Vérifier les contrats. Importer vers Remix Depuis votre projet Tenderly. <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json) : tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Créer un problème](/issues)
zh_cn: ** Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>验证合约。从您的 Tenderly 项目导入到 Remix 中。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[文档](https://docs.tenderly.co/monitoring/integrations#remix) <br>[创建issue](/issues)

source: **UMA Playground** &nbsp; (main panel) <br>Learn about the UMA protocol. This plugin is loaded from the DEFI Tutorial plugin. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Make an issue](https://github.com/Machinalabs/remix-uma-playground/issues)
fr: **UMA Playground** &nbsp; (panneau principal) <br>Découvrez le protocole UMA. Ce plugin est chargé à partir du plugin DEFI Tutorial. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json) : umaPlayground <br>[Créer un problème](https://github.com/Machinalabs/remix-uma-playground/issues)
zh_cn: **UMA Playground** &nbsp; (主面板) <br>了解 UMA 协议。此插件从 DEFI 教程插件中加载。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[提交issue](https://github.com/Machinalabs/remix-uma-playground/issues)

source: **UMA Tutorials** &nbsp; (main panel) <br>This plugin is activated by the DEFI Tutorials <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)
fr: **UMA Tutorials** &nbsp; (panneau principal) <br>Ce plugin est activé par le DEFI Tutorials <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json) : umaTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)
zh_cn: **UMA Tutorials** &nbsp; (主面板) <br>此插件由DEFI教程激活 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[创建issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)

source: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile vyper code using local or remote Vyper compiler. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Make an issue](https://github.com/GrandSchtroumpf/vyper-remix)
fr: **Compilateur Vyper** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compilez le code vyper en utilisant le compilateur Vyper local ou distant. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json) : vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Créer un problème](https://github.com/GrandSchtroumpf/vyper-remix)
zh_cn: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>使用本地或远程Vyper编译器编译vyper代码。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[文档](https://github.com/GrandSchtroumpf/vyper-remix) <br>[提交issue](https://github.com/GrandSchtroumpf/vyper-remix)

source: **Wallet Connect** &nbsp; (main panel) <br>Approve transactions on your mobile device <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Make an issue](https://github.com/yann300/remix-walletconnect/issues)
fr: **Wallet Connect** &nbsp; (panneau principal) <br>Approuver des transactions sur votre appareil mobile <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json) : walletconnect <br>[Faire une demande](https://github.com/yann300/remix-walletconnect/issues)
zh_cn: **Wallet Connect** &nbsp; (主面板) <br>在您的移动设备上批准交易 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[提交issue](https://github.com/yann300/remix-walletconnect/issues)

source: **YUL++** &nbsp; ![](images/pi-yul-p.png) &nbsp; <br>A low level language for Ethereum. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/yulp/profile.json): yulp <br>[Make an issue](https://github.com/loredanacirstea/remix-yulp-plugin/issues)
fr: **YUL++** &nbsp; ![](images/pi-yul-p.png) &nbsp; <br>Un langage de bas niveau pour Ethereum. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/yulp/profile.json) : yulp <br>[Créer un problème](https://github.com/loredanacirstea/remix-yulp-plugin/issues)
zh_cn: **YUL++** &nbsp; ![](images/pi-yul-p.png) &nbsp; <br>一种适用于以太坊的低级语言。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/yulp/profile.json): yulp <br>[创建issue](https://github.com/loredanacirstea/remix-yulp-plugin/issues)

source: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates is a toolbox for zkSNARKs on Ethereum. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Make an issue](https://github.com/Zokrates/zokrates-remix-plugin/issues)
fr: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates est une boîte à outils pour les zkSNARKs sur Ethereum. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json) : ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Créer un problème](https://github.com/Zokrates/zokrates-remix-plugin/issues)
zh_cn: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates 是一个在以太坊上使用 zkSNARKs 的工具箱。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[文档](https://zokrates.github.io/) <br>[提交issue](https://github.com/Zokrates/zokrates-remix-plugin/issues)

source: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile & Deploy to the Celo blockchain. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Make an issue](https://github.com/dexfair/celo-remix-plugin/issues)
it: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compila e distribuisce sulla blockchain Celo. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentazione](https://github.com/dexfair/celo-remix-plugin) <br>[Apri un problema](https://github.com/dexfair/celo-remix-plugin/issues)

source: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Deploy a contract to multiple chains (1 at a time) with the same address. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Make an issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)
it: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Distribuisce un contratto su più catene (uno alla volta) con lo stesso indirizzo. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentatione](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Apri un problema](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)

source: **Contract Verification - Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verify contracts on Etherscan. <br>[Profile name](https://github.com/ethereum/remix-project/blob/master/apps/etherscan/src/profile.json): etherscan <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/contract_verification.html#etherscan) <br>[Make an issue](https://github.com/ethereum/remix-project/tree/master/apps/etherscan)
it: **Contract Verification - Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verifica i contratti su Etherscan. <br>[Nome profilo](https://github.com/ethereum/remix-project/blob/master/apps/etherscan/src/profile.json): etherscan <br>[Documentazione](https://remix-ide.readthedocs.io/en/latest/contract_verification.html#etherscan) <br>[Apri un problema](https://github.com/ethereum/remix-project/tree/master/apps/etherscan)

source: **Contract Verification - Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verify contracts and fetch verified contracts <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentation](https://docs.sourcify.dev/docs/intro/) <br>[Make an issue](https://github.com/sourcifyeth/remix-sourcify/issues)
it: **Contract Verification - Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verifica i contratti e recupera i contratti verificati <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentazione](https://docs.sourcify.dev/docs/intro/) <br>[Apri un problema](https://github.com/sourcifyeth/remix-sourcify/issues)

source: **Cookbook.dev - Find any contract** &nbsp; ![](images/cookbook.svg)<br> Find any smart contract, build your project faster. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins/cookbook.dev): cookbook.dev <br>[Website](https://www.cookbook.dev) <br>[Documentation](https://github.com/Breakthrough-Labs/cookbook-remix-plugin) <br>[Make an issue](https://github.com/Breakthrough-Labs/cookbook-remix-plugin/issues)
it: **Cookbook.dev - Find any contract** &nbsp; ![](images/cookbook.svg)<br> Trova qualsiasi contratto intelligente, costruisci il tuo progetto più velocemente. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins/cookbook.dev): cookbook.dev <br>[Website](https://www.cookbook.dev) <br>[Documentazione](https://github.com/Breakthrough-Labs/cookbook-remix-plugin) <br>[Apri un problema](https://github.com/Breakthrough-Labs/cookbook-remix-plugin/issues)
