Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_manager.po
Languages: es, fr, it

source: Plugin Manager
es: Gestor de plugins
fr: Gestionnaire de plugin
it: Gestore dei plugin

source: In Remix IDE you only load the functionality you need. Controlling which plugins are active or inactive happens in the **Plugin Manager**.
es: En Remix IDE sólo carga la funcionalidad que necesita. El control de qué plugins están activos o inactivos se realiza en el **Administrador de plugins**.
fr: Dans Remix IDE, vous ne chargez que les fonctionnalités dont vous avez besoin. Le contrôle des plugins actifs ou inactifs se fait dans le **Plugin Manager**.
it: Nell'IDE di Remix si caricano solo le funzionalità di cui hai bisogno. Il controllo dei plugin attivi o disattivi avviene nel **Plugin Manager** (Gestore di Plugin).

source: This plugin architecture has made it possible to integrate tools made by the Remix team with tools made by external teams. This architecture also allows Remix or just parts of Remix to be integrated into other projects.
es: Esta arquitectura de plugins ha hecho posible la integración de herramientas realizadas por el equipo Remix con herramientas realizadas por equipos externos. Esta arquitectura también permite integrar Remix o sólo partes de Remix en otros proyectos.
fr: Cette architecture de plugins a permis d'intégrer des outils créés par l'équipe Remix avec des outils créés par des équipes externes. Cette architecture permet également d'intégrer Remix ou des parties de Remix dans d'autres projets.
it: Questa architettura a plugin ha reso possibile l'integrazione di strumenti realizzati dal team di Remix con strumenti realizzati da team esterni. Questa architettura permette anche di integrare Remix o solo parti di Remix in altri progetti.

source: Manage permissions
es: Gestionar permisos
fr: Gérer les autorisations
it: Gestire i permessi

source: When plugins need to access other plugins for their operation, a modal will appear to ask you for permission.
es: Cuando los plugins necesiten acceder a otros plugins para su funcionamiento, aparecerá un modal para pedirle permiso.
fr: Lorsque des plugins doivent accéder à d'autres plugins pour fonctionner, une fenêtre modale apparaît pour vous demander l'autorisation.
it: Quando i plugin devono accedere ad altri plugin per il loro funzionamento, apparirà una finestra per chiedere l'autorizzazione.

source: Often, the same plugin will want to do the same action multiple times. So when granting permission, its helpful to click the **Remember this choice** box. If you don't, you might get this modal repeatedly popping up.
es: A menudo, el mismo plugin querrá realizar la misma acción varias veces. Así que cuando conceda el permiso, es útil hacer clic en la casilla **Recordar esta elección**. Si no lo hace, puede que le aparezca este modal repetidamente.
fr: Souvent, le même plugin voudra effectuer la même action plusieurs fois. C'est pourquoi, lorsque vous accordez une autorisation, il est utile de cliquer sur la case **Souvenir de ce choix**. Si vous ne le faites pas, vous risquez de voir apparaître cette fenêtre modale à plusieurs reprises.
it: Spesso, lo stesso plugin vuole eseguire la stessa azione più volte. Per questo motivo, quando si concede l'autorizzazione, è utile cliccare sulla casella **Remember this choice** (Ricorda questa scelta). In caso contrario, potrebbe comparire ripetutamente questa finestra.

source: View permissions
es: Ver permisos
fr: Voir les autorisations
it: Visualizzare i permessi

source: You can view the permissions that you have granted to plugins by clicking on the **Permissions** button at the bottom of the **Plugin Manager**.
es: Puede ver los permisos que ha concedido a los plugins haciendo clic en el botón **Permisos** de la parte inferior del **Administrador de plugins**.
fr: Vous pouvez voir les permissions que vous avez accordées aux plugins en cliquant sur le bouton **Permissions** en bas du **Gestionnaire de plugins**.
it: È possibile visualizzare le autorizzazioni concesse ai plugin cliccando sul pulsante **Permissions** (Permessi) in fondo al **Plugin Manager** (Gestore dei permessi).

source: A modal will appear like the one below where you can view and erase the granted permission.
es: Aparecerá un modal como el siguiente donde podrá ver y borrar el permiso concedido.
fr: Une fenêtre modale apparaîtra, comme celle ci-dessous, dans laquelle vous pourrez voir et effacer l'autorisation accordée.
it: Verrà visualizzata una finestra di dialogo come quella riportata di seguito, dove è possibile visualizzare e cancellare l'autorizzazione concessa.

source: Plugin Devs: Load a local plugin
es: Desarrolladores de plugins: Cargar un plugin local
fr: Plugin Devs : Charger un plugin local
it: Sviluppatori di Plugin: caricare un plugin locale

source: A plugin in development can be loaded into Remix IDE by clicking the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
es: Un plugin en desarrollo puede cargarse en el IDE Remix haciendo clic en el enlace "Conectar con un plugin local" en la parte superior del panel del Gestor de plugins.
fr: Un plugin en cours de développement peut être chargé dans Remix IDE en cliquant sur le lien "Connect to a Local Plugin" en haut du panneau "Plugin Manager".
it: Un plugin in fase di sviluppo può essere caricato nell'IDE Remix cliccando sul collegamento "Connect to a Local Plugin" (Connetti ad un plugin locale) nella parte superiore del pannello del Gestore dei Plugin.

source: To learn more about how to create your own plugin, go to [the README of remix-plugin repo](https://github.com/ethereum/remix-plugin).
es: Para obtener más información sobre cómo crear su propio plugin, consulte [el README del repo remix-plugin](https://github.com/ethereum/remix-plugin).
fr: Pour en savoir plus sur la façon de créer votre propre plugin, consultez [le README du repo remix-plugin] (https://github.com/ethereum/remix-plugin).
it: Per saperne di più su come creare il proprio plugin, consultare [il README del repository remix-plugin](https://github.com/ethereum/remix-plugin).
