Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: fr, it, zh_cn

source: Plugin List
fr: Liste des plugins
it: Lista di plugin
zh_cn: 插件列表

source: Here is the list of Remix plugins that you will see in the Plugin Manager:
fr: Voici la liste des plugins Remix que vous verrez dans le gestionnaire de plugins :
it: Ecco la lista dei plugin di Remix che vedrete nel Gestore di Plugin:
zh_cn: 下面是您在插件管理器中可以看到的 Remix 插件列表：

source: Core Plugins
fr: Plugins principaux
it: Plugin base
zh_cn: 核心插件

source: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> The File Explorers is where you can see the files.<br> profile name: **fileManager** <br>[Documentation](file_explorer.html)
fr: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> L'explorateur de fichiers est l'endroit où vous pouvez voir les fichiers.<br> nom du profil : **fileManager** <br>[Documentation](file_explorer.html)
it: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> L'Esplora file è dove è possibile vedere i file.<br> nome profilo: **fileManager** <br>[Documentazione](file_explorer.html)
zh_cn: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> 文件浏览器是您可以查看文件的地方。<br> 配置文件名称：**fileManager** <br>[文档](file_explorer.html)

source: **Remixd** &nbsp; (No UI) <br>Remixd (with an npm package running locally) connects a folder on your filesystem to the Remix website. Please see the docs for instructions. <br>profile name: **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)
fr: **Remixd** &nbsp; (Pas d'interface utilisateur) <br>Remixd (avec un paquetage npm exécuté localement) connecte un dossier de votre système de fichiers au site web Remix. Veuillez consulter la documentation pour plus d'informations. <br>profile name : **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)
it: **Remixd** &nbsp; (No UI) <br>Remixd (con un pacchetto npm in esecuzione localmente) collega una cartella del vostro filesystem al sito web di Remix. Si veda la documentazione per le istruzioni. <br>nome profilo: **remixd** <br>[Documentazione](https://remix-ide.readthedocs.io/en/latest/remixd.html)
zh_cn: **Remixd** &nbsp; (无用户界面) <br> Remixd（在本地运行的npm包）将您文件系统上的一个文件夹连接到Remix网站。请参阅文档以获取说明。<br>配置文件名称： **remixd** <br>[文档](https://remix-ide.readthedocs.io/en/latest/remixd.html)

source: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> Compiles Solidity & YUL. <br>profile name: **solidity** <br>[Documentation](compile.html)
fr: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> Compile Solidity & YUL. <br>nom du profil : **solidity** <br>[Documentation](compile.html)
it: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> Compila Solidity e YUL. <br>nome profilo: **solidity** <br>[Documentazione](compile.html)
zh_cn: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> 编译Solidity & YUL. <br>配置文件名称：**solidity** <br>[文档](compile.html)

source: **Deploy & Run** &nbsp; ![](images/pi-deploy.png)<br> Deploy & interact with smart contracts on the in-browser chain (JSVM), local nodes, and public networks. <br>profile name: **udapp** <br>[Documentation](run.html)
fr: **Déployer et exécuter** &nbsp; ![](images/pi-deploy.png)<br> Déployer et interagir avec des contrats intelligents sur la chaîne du navigateur (JSVM), les nœuds locaux et les réseaux publics. <br>nom du profil : **udapp** <br>[Documentation](run.html)
it: **Deploy & Run** &nbsp; ![](images/pi-deploy.png)<br> Distribuisce ed interagisce con i contratti intelligenti sulla catena nel-browser (JSVM), sui nodi locali e sulle reti pubbliche. <br>nome profilo: **udapp** <br>[Documentazione](run.html)
zh_cn: **Deploy & Run** &nbsp; ![](images/pi-deploy.png)<br> 在浏览器链（JSVM）、本地节点和公共网络上部署并与智能合约交互。<br>配置文件名称：**udapp** <br>[文档](run.html)部署

source: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Insert breakpoints, step through a contract, check high level and low level parameters, and fetch & debug a transaction of a verified contract. <br>profile name: **debugger** <br>[Documentation](debugger.html)
fr: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Insérer des points d'arrêt, parcourir un contrat, vérifier les paramètres de haut niveau et de bas niveau, et récupérer et déboguer une transaction d'un contrat vérifié. <br>nom du profil : **debugger** <br>[Documentation](debugger.html)
it: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Inserisce i punti di interruzione, esegue passo passo un contratto, controlla i parametri di alto e basso livello, recupera ed esegue il debug di una transazione di un contratto verificato. <br>nome profilo: **debugger** <br>[Documentazione](debugger.html)
zh_cn: ** Debugger** &nbsp; ![](images/pi-debug.png)<br> 插入断点，逐步执行合约，检查高级和低级参数，并获取并调试已验证的合约事务。<br>配置文件名称：**debugger** <br>[文档](debugger.html)

source: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Run unit test written in Solidity. <br>profile name: **solidityUnitTesting** <br>[Documentation](unittesting.html)
fr: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Exécutez un test unitaire écrit en Solidity. <br>nom du profil : **solidityUnitTesting** <br>[Documentation](unittesting.html)
it: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Esegue test unitari scritti in Solidity. <br>nome profilo: **solidityUnitTesting** <br>[Documentazione](unittesting.html)
zh_cn: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> 运行用Solidity编写的单元测试。 <br>配置文件名称：**solidityUnitTesting** <br>[文档](unittesting.html)

source: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> Static code analysis is a process to debug the code by examining it and without actually executing the code. This plugin also has integrations with [Slither](slither.html). <br>profile name: **solidityStaticAnalysis** <br>[Documentation](static_analysis.html)
fr: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> L'analyse statique du code est un processus qui permet de déboguer le code en l'examinant sans l'exécuter. Ce plugin est également intégré à [Slither](slither.html). <br>profile name : **solidityStaticAnalysis** <br>[Documentation](static_analysis.html)
it: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> L'analisi statica del codice è un processo per eseguire il debug del codice esaminandolo senza eseguirlo effettivamente. Questo plugin ha anche un'integrazion con [Slither](slither.html). <br>nome profilo: **solidityStaticAnalysis** <br>[Documentazione](static_analysis.html)
zh_cn: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> 静态代码分析是一种通过检查代码而不实际执行代码来调试代码的过程。该插件还与[Slither](slither.html)集成。<br>配置文件名称：**solidityStaticAnalysis** <br>[文档](static_analysis.html)

source: Additional Plugins
fr: Plugins supplémentaires
it: Plugin aggiuntivi
zh_cn: 其他插件

source: (sorted alphabetically)
fr: (classés par ordre alphabétique)
it: (ordinati in ordine alfabetico)
zh_cn: 按字母顺序排序

source: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile & Deploy to the Celo blockchain. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Make an issue](https://github.com/dexfair/celo-remix-plugin/issues)
fr: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compiler et déployer sur la blockchain Celo. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json) : celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Créer un problème](https://github.com/dexfair/celo-remix-plugin/issues)
zh_cn: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> 编译并部署到Celo区块链。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[文档](https://github.com/dexfair/celo-remix-plugin) <br>[提交issue](https://github.com/dexfair/celo-remix-plugin/issues)

source: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Deploy a contract to multiple chains (1 at a time) with the same address. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Make an issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)
fr: **Contrat Deployer** &nbsp; ![](images/pi-deployer.png)<br> Déployez un contrat sur plusieurs chaînes (1 à la fois) avec la même adresse. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json) : celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Créer un problème](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)
zh_cn: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> 使用相同的地址将合约部署到多个链（一次一个）。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[文档](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[提交issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)

source: **Debug Tools for Remix** &nbsp; ![](images/pi-remix-debug-tools.png) &nbsp; <br> Not to be confused with the Debugger, this tool is for plugin devs to help test their plugins & their plugin's API. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/remix-plugin-debug/profile.json): debugPlugin <br>[Documentation](https://github.com/pldespaigne/remix-debug-plugin#-instalation)
fr: **Debug Tools for Remix** &nbsp; ![](images/pi-remix-debug-tools.png) &nbsp; <br> A ne pas confondre avec le Debugger, cet outil est destiné aux développeurs de plugins pour les aider à tester leurs plugins et l'API de leurs plugins. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/remix-plugin-debug/profile.json) : debugPlugin <br>[Documentation](https://github.com/pldespaigne/remix-debug-plugin#-instalation)
zh_cn: **Debug Tools for Remix** &nbsp; ![](images/pi-remix-debug-tools.png) &nbsp; <br> 不要与调试器混淆，此工具是为插件开发人员提供的，以帮助测试其插件及其插件的API。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/remix-plugin-debug/profile.json): debugPlugin <br>[文档](https://github.com/pldespaigne/remix-debug-plugin#-instalation)

source: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> The Defi Explorer loads the Uniswap V2 Protocol into the File Explorers. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)
fr: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> Le Defi Explorer charge le protocole Uniswap V2 dans les explorateurs de fichiers. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json) : defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Créer un problème](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)
zh_cn: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> Defi Explorer 将 Uniswap V2 协议加载到文件浏览器中。 <br>[配置文件名](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[文档](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[提交issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)

source: **Defi Tutorials** &nbsp; (main panel) &nbsp; ![](images/pi-defi-tut.png) <br> Learn about UMA. This plugin works with the UMA tutorials plugin. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)
fr: **Defi Tutorials** &nbsp; (panneau principal) &nbsp; ![](images/pi-defi-tut.png) <br> Découvrez l'UMA. Ce plugin fonctionne avec le plugin des tutoriels UMA. <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json) : defiTutorials <br>[Créer un problème](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)
zh_cn: **Defi Tutorials** &nbsp; (主面板) &nbsp; ![](images/pi-defi-tut.png) <br> 学习 UMA。此插件与 UMA 教程插件配合使用。<br>[配置文件名](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[创建issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)

source: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Version Control <br> Clone repos from github & create GIT repos & use standard git commands. Also export/import to IPFS. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Make an issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)
fr: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Contrôle de version <br> Cloner les dépôts de github et créer des dépôts GIT et utiliser les commandes git standard. Egalement exporter/importer vers IPFS. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json) : dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Créer un problème](https://github.com/bunsenstraat/remix-storage-plugin/issues)
zh_cn: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; 版本控制 <br> 从Github克隆存储库并创建GIT存储库，使用标准的Git命令。还可以导出/导入到IPFS。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[文档](https://github.com/bunsenstraat/remix-storage-plugin) <br>[提出issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)

source: **EthDoc Documentation Generator** &nbsp; ![](images/pi-ethdoc.png) &nbsp; <br>Creates the documentation of a soldity contract - generated from the Natspec comments in the code. The generated doc is placed in EthDoc viewer - which will be visible in an tab in the editor. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc/profile.json): ethdoc <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-ethdoc-plugin/issues)
fr: **Générateur de documentation EthDoc** &nbsp; ![](images/pi-ethdoc.png) &nbsp; <br>Crée la documentation d'un contrat de vente - générée à partir des commentaires Natspec dans le code. La documentation générée est placée dans le visualisateur EthDoc - qui sera visible dans un onglet de l'éditeur. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc/profile.json) : ethdoc <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Créer un problème](https://github.com/Machinalabs/remix-ethdoc-plugin/issues)
zh_cn: **EthDoc Documentation Generator** &nbsp; ![](images/pi-ethdoc.png) &nbsp; <br>创建一个Solidity合约的文档 - 从代码中的Natspec注释生成。生成的文档将放置在EthDoc查看器中 - 可以在编辑器中的选项卡中查看。<br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc/profile.json): ethdoc <br>[文档](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[提交issue](https://github.com/Machinalabs/remix-ethdoc-plugin/issues)

source: **EthDoc Viewer** &nbsp; (main panel) &nbsp; <br>This plugin work with EthDoc Generator. It is automatically activated. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc-viewer/profile.json): ethdoc-viewer <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-ethdoc-viewer-plugin/issues)
fr: **EthDoc Viewer** &nbsp; (panneau principal) &nbsp; <br>Ce plugin fonctionne avec EthDoc Generator. Il est automatiquement activé. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc-viewer/profile.json) : ethdoc-viewer <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Créer un problème](https://github.com/Machinalabs/remix-ethdoc-viewer-plugin/issues)
zh_cn: **EthDoc Viewer** &nbsp; (主面板) &nbsp; <br>该插件与 EthDoc Generator 配合使用，会自动激活。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc-viewer/profile.json): ethdoc-viewer <br>[文档](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[提交issue](https://github.com/Machinalabs/remix-ethdoc-viewer-plugin/issues)

source: **Etherscan Contract Verifier** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verify a contract on Etherscan. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/etherscan/profile.json): etherscan <br>[Documentation](https://remix-etherscan-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-etherscan-plugin/issues)
fr: **Vérificateur de contrat Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Vérifiez un contrat sur Etherscan. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/etherscan/profile.json) : etherscan <br>[Documentation](https://remix-etherscan-plugin.readthedocs.io/en/latest/) <br>[Créer un problème](https://github.com/Machinalabs/remix-etherscan-plugin/issues)
zh_cn: **Etherscan Contract Verifier** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>在Etherscan上验证一个合约。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/etherscan/profile.json): etherscan <br>[文档](https://remix-etherscan-plugin.readthedocs.io/en/latest/) <br>[提交issue](https://github.com/Machinalabs/remix-etherscan-plugin/issues)

source: **Flattener** &nbsp; ![](images/pi-flattener.png) <br>Flattens compiled contracts <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/flattener/profile.json): flattener <br>[Make an issue](https://github.com/bunsenstraat/flattener/issues)
fr: **Flattener** &nbsp; ![](images/pi-flattener.png) <br>Aplatit les contrats compilés <br>[nom de profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/flattener/profile.json) : flattener <br>[Make an issue](https://github.com/bunsenstraat/flattener/issues)
zh_cn: **Flattener** &nbsp; ![](images/pi-flattener.png) <br>将编译的合约展开为单个文件 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/flattener/profile.json): flattener <br>[提交issue](https://github.com/bunsenstraat/flattener/issues)

source: **Gas Profiler** &nbsp; ![](images/pi-gas-profiler.png) <br>Profile gas costs for every transaction you execute. Total execution costs as well as per line costs are displayed. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/gas-profiler/profile.json): gasProfiler <br>[Documentation](https://github.com/EdsonAlcala/remix-gas-profiler) <br>[Make an issue](/issues)
fr: **Gas Profiler** &nbsp; ![](images/pi-gas-profiler.png) <br>Profil des coûts du gaz pour chaque transaction que vous exécutez. Les coûts totaux d'exécution ainsi que les coûts par ligne sont affichés. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/gas-profiler/profile.json) : gasProfiler <br>[Documentation](https://github.com/EdsonAlcala/remix-gas-profiler) <br>[Créer un problème](/issues)
zh_cn: **Gas Profiler** &nbsp; ![](images/pi-gas-profiler.png) <br>为您执行的每个交易分析GAS成本。显示总执行成本以及每行成本。<br>[插件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/gas-profiler/profile.json): gasProfiler <br>[文档](https://github.com/EdsonAlcala/remix-gas-profiler) <br>[提交issue](/issues)

source: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Deploy & interact with smart contracts to the Klaytn public network, local klaytn nodes. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Make an issue](https://github.com/klaytn-ozys/plug-and-klay/issues)
fr: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Déployez et interagissez avec les contrats intelligents sur le réseau public Klaytn, les nœuds klaytn locaux. <br>[Nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json) : klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Créer un problème](https://github.com/klaytn-ozys/plug-and-klay/issues)
zh_cn: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>部署并与 Klaytn 公共网络、本地 klaytn 节点上的智能合约进行交互。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[文档](https://github.com/klaytn-ozys/plug-and-klay) <br>[提交issue](https://github.com/klaytn-ozys/plug-and-klay/issues)

source: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity Tutorials <br>Tutorials that contain quizes that teach users Solidity and Remix features. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Make an issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
fr: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Tutoriels Remix & Solidity <br>Tutoriels contenant des quiz qui enseignent aux utilisateurs les fonctionnalités de Solidity et Remix. <br>[nom du profil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json) : learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Créer un problème](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
zh_cn: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity教程 <br>包含测验的教程，向用户讲解Solidity和Remix功能。 <br>[配置文件名称](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[文档](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[提出issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
