Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: fr, it, zh_cn

source: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> The Defi Explorer loads the Uniswap V2 Protocol into the File Explorers. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)
it: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> L'Esplor Defi carica il protocollo Uniswap V2 nell'Esplora file. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentazione](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Apri un problema](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)

source: **Defi Tutorials** &nbsp; (main panel) &nbsp; ![](images/pi-defi-tut.png) <br> Learn about UMA. This plugin works with the UMA tutorials plugin. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)
it: **Defi Tutorials** &nbsp; (main panel) &nbsp; ![](images/pi-defi-tut.png) <br> Scopri UMA. Questo plugin funziona con il plugin UMA tutorial.<br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Apri un problema](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)

source: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Version Control <br> Clone repos from github & create GIT repos & use standard git commands. Also export/import to IPFS. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Make an issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)
it: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Version Control <br> Clona i repository da github, crea i repository GIT ed usa i comandi git standard. Esporta/importa anche su IPFS. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentazione](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Apri un problema](https://github.com/bunsenstraat/remix-storage-plugin/issues)

source: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Deploy & interact with smart contracts to the Klaytn public network, local klaytn nodes. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Make an issue](https://github.com/klaytn-ozys/plug-and-klay/issues)
it: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Distribuisce ed interagisce con i contratti intelligenti sulla rete pubblica di Klaytn e sui nodi locali di Klaytn. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentazione](https://github.com/klaytn-ozys/plug-and-klay) <br>[Apri un problema](https://github.com/klaytn-ozys/plug-and-klay/issues)

source: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity Tutorials <br>Tutorials that contain quizes that teach users Solidity and Remix features. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Make an issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
it: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity Tutorials <br>Esercitazioni che contengono quiz per insegnare agli utenti le funzionalità di Solidity e Remix. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentazione](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Apri un problema](https://github.com/bunsenstraat/remix-learneth-plugin/issues)

source: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon is a language that reads like a legal contract and compile into Solidity (and then bytecode). This plugin allow you to take Lexon code and to <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)
it: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon è un linguaggio che si legge come un contratto legale e si compila in Solidity (e quindi in bytecode). Questo plugin permette di prendere il codice Lexon e di <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentazione](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Apri un problema](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)

source: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compile and Deploy to the Moonbeam network <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Make an issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)
it: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compila e distribuisce sulla rete Moonbeam <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentatione](https://github.com/purestake/moonbeam-remix-plugin) <br>[Apri un problema](https://github.com/PureStake/moonbeam-remix-plugin/issues)

source: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Free version and paid version for Mythx analysis. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Make an issue](https://github.com/aquiladev/remix-mythx-plugin/issues)
it: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Versione gratuita e versione a pagamento per l'analisi con Mythx. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentazione](https://docs.mythx.io/tools-integrations/remix) <br>[Apri un problema](https://github.com/aquiladev/remix-mythx-plugin/issues)

source: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compile solidity contracts for the Nahmii network <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Make an issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)
it: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compila i contratti solidity per la rete Nahmii <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Apri un problema](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)

source: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Makes a basic front end for your contract once it is deployed on a public testnet. [Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Make an issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)
it: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Crea un front-end di base per il vostro contratto una volta distribuito su una rete di test pubblica. [Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentazione](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Apri un problema](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)

source: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile contracts written in Cairo to Starknet <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starkNet_compiler/profile.json): starkNet_compiler <br>[Documentation](https://github.com/hexdivision/starkware-remix-plugin) <br>[Make an issue](https://github.com/hexdivision/starkware-remix-plugin/issues)
it: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compila i contratti scritti il Cairo per Starknet <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starkNet_compiler/profile.json): starkNet_compiler <br>[Documentatione](https://github.com/hexdivision/starkware-remix-plugin) <br>[Apri un problema](https://github.com/hexdivision/starkware-remix-plugin/issues)

source: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verify Contracts. Import To Remix From your Tenderly project. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Make an issue](/issues)
it: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verifica i contratti. Importa in Remix dal tuo progetto Tenderly. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentazione](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Apri un problema](/issues)

source: **UMA Playground** &nbsp; (main panel) <br>Learn about the UMA protocol. This plugin is loaded from the DEFI Tutorial plugin. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Make an issue](https://github.com/Machinalabs/remix-uma-playground/issues)
it: **UMA Playground** &nbsp; (main panel) <br>Imparate a conoscere il protocollo UMA. Questo plugin è caricato dal plugin DEFI Tutorial. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Apri un problema](https://github.com/Machinalabs/remix-uma-playground/issues)

source: **UMA Tutorials** &nbsp; (main panel) <br>This plugin is activated by the DEFI Tutorials <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)
it: **UMA Tutorials** &nbsp; (main panel) <br>Questo plugin è attivato da tutorial DEFI <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Apri un problema](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)

source: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile vyper code using local or remote Vyper compiler. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Make an issue](https://github.com/GrandSchtroumpf/vyper-remix)
it: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compila il codice vyper utilizzando il compilatore Vyper locale o remoto. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentazione](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Apri un problema](https://github.com/GrandSchtroumpf/vyper-remix)

source: **Wallet Connect** &nbsp; (main panel) <br>Approve transactions on your mobile device <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Make an issue](https://github.com/yann300/remix-walletconnect/issues)
it: **Wallet Connect** &nbsp; (main panel) <br>Approva le transazioni sul proprio dispositivo mobile <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Apri un problema](https://github.com/yann300/remix-walletconnect/issues)

source: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates is a toolbox for zkSNARKs on Ethereum. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Make an issue](https://github.com/Zokrates/zokrates-remix-plugin/issues)
it: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates è un toolbox per gli zkSNARK su Ethereum. <br>[Nome profilo](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentazione](https://zokrates.github.io/) <br>[Apri un problema](https://github.com/Zokrates/zokrates-remix-plugin/issues)
