Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_tutorials_learneth.po
Languages: es, fr, it

source: Remix Tutorials with Learneth
fr: Remixer des tutoriels avec Learneth

source: **Learneth** is a tutorial platform integrated into Remix.
es: **Learneth** es una plataforma de tutoriales integrada en Remix.
fr: **Learneth** est une plateforme de tutorat intégrée à Remix.
it: **Learneth** è una piattaforma di tutorial integrata in Remix.

source: Tutorials can contain quizzes for testing students' work. These quizzes are run by Solidity Unit Tests.
es: Los tutoriales pueden contener cuestionarios para comprobar el trabajo de los alumnos. Estos cuestionarios son ejecutados por Solidity Unit Tests.
fr: Les tutoriels peuvent contenir des quiz pour tester le travail des étudiants. Ces quiz sont exécutés par Solidity Unit Tests.
it: I tutorial possono contenere quiz per testare il lavoro degli studenti. Questi quiz sono eseguiti dall'Unit Test Solidity.

source: We have a growing set of tutorials on our repo- but anyone can build tutorials on their own repos and have their students load them up!
es: Tenemos un conjunto creciente de tutoriales en nuestro repositorio, pero cualquiera puede crear tutoriales en sus propios repositorios y hacer que sus alumnos los carguen.
fr: Nous disposons d'un ensemble croissant de tutoriels sur notre dépôt, mais n'importe qui peut créer des tutoriels sur son propre dépôt et demander à ses étudiants de les charger !
it: Abbiamo una serie crescente di tutorial nel nostro repository, ma chiunque può creare tutorial sul proprio repository e farli caricare ai propri studenti!

source: The tutorials contain .md files for instructions and can also contain example files, Solidity Unit Test files for quizzes, as well as answer files for quizzes.
es: Los tutoriales contienen archivos .md para las instrucciones y también pueden contener archivos de ejemplo, archivos de pruebas unitarias de Solidity para los cuestionarios, así como archivos de respuestas para los cuestionarios.
fr: Les tutoriels contiennent des fichiers .md pour les instructions et peuvent également contenir des fichiers d'exemples, des fichiers de tests unitaires de Solidity pour les quiz, ainsi que des fichiers de réponses pour les quiz.
it: I tutorial contengono file .md per le istruzioni e possono contenere anche file di esempio, file di Unit Test Solidity per i quiz nonché file con le risposte dei quiz.

source: Opening Learneth & associated links
es: Abrir Learneth y enlaces asociados
fr: Ouverture de l'apprentissage et des liens associés
it: Apertura di Learneth e link associati

source: Learneth is a plugin - so to access it, you need to activate the Learneth plugin in the Plugin Manager. Alternatively - this link will active it: click this link.
es: Learneth es un plugin - así que para acceder a él, necesita activar el plugin Learneth en el Gestor de Plugins. Alternativamente - este enlace lo activará: haga clic en este enlace.
fr: Learneth est un plugin - pour y accéder, vous devez donc activer le plugin Learneth dans le gestionnaire de plugins. Sinon, ce lien l'activera : cliquez sur ce lien.
it: Learneth è un plugin: quindi per accedervi, è necessario attivare il plugin Learneth nel Gestore dei Plugin. In alternativa - questo link lo attiverà: cliccate su questo link.

source: This link will activate Learneth and then will open a specific tutorial - in this case it will load the **proxy contract** tutorial:
es: Este enlace activará Learneth y a continuación abrirá un tutorial específico - en este caso cargará el tutorial **contrato de delegación**:
fr: Ce lien activera Learneth et ouvrira un tutoriel spécifique - dans ce cas, il chargera le tutoriel **contrat de mandataire** :
it: Questo link attiverà Learneth ed aprirà un tutorial specifico: in questo caso caricherà l'esercitazione **contratto proxy**:

source: **NOTE:** For other tricks about Remix URLs with parameters, go here: [locations](locations.html).
es: **NOTA:** Para otros trucos sobre URLs Remix con parámetros, vaya aquí: [locations](locations.html).
fr: **NOTE:** Pour d'autres astuces concernant les URL Remix avec des paramètres, cliquez ici : [locations](locations.html).
it: **NOTA:** Per altri trucchi sugli URL di Remix con parametri, andate qui: [locations](locations.html).

source: Learneth Tutorials
es: Tutoriales Learneth
fr: Tutoriels Learneth
it: Tutorial di Learneth

source: Here is the current list of Learneth Tutorials
es: Aquí está la lista actual de Tutoriales Learneth
fr: Voici la liste actuelle des tutoriels Learneth
it: Ecco l'elenco corrente delle esercitazioni Learneth

source: ***Beginner***
es: ***Principiante***
fr: ***Débutant***
it: ***Principiante***

source: ***Intermediate***
es: ***Intermedio***
fr: ***Intermédiaire***
it: ***Intermedio***

source: ***Advanced***
es: ***Avanzado***
fr: ***Avancé***
it: ***Avanzato***

source: Learneth & Tutorial Repos
fr: Dépôts d'apprentissage et de didacticiels
it: Repository di Learneth & Tutorial

source: The code for the Learneth plugin is located here: https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst
es: El código del plugin Learneth se encuentra aquí: https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst
fr: Le code du plugin Learneth se trouve ici : https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst
it: Il codice del plugin Learneth si trova qui: https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst

source: Documentation for creating your own tutorials is located here: https://remix-learneth-plugin.readthedocs.io/en/latest/index.html
es: La documentación para crear sus propios tutoriales se encuentra aquí: https://remix-learneth-plugin.readthedocs.io/en/latest/index.html
fr: La documentation relative à la création de vos propres tutoriels se trouve à l'adresse suivante : https://remix-learneth-plugin.readthedocs.io/en/latest/index.html
it: La documentazione per la creazione dei tuoi tutorial si trova qui: https://remix-learneth-plugin.readthedocs.io/en/latest/index.html

source: Remix maintains and curates this repo of Learneth tutorials: https://github.com/ethereum/remix-workshops
es: Remix mantiene y cura este repo de tutoriales Learneth: https://github.com/ethereum/remix-workshops
fr: Remix maintient et entretient ce répertoire de tutoriels Learneth : https://github.com/ethereum/remix-workshops
it: Remix mantiene e cura questo repository di tutorial di Learneth: https://github.com/ethereum/remix-workshops

source: Tutorials in Remix
es: Tutoriales en Remix
it: Tutorial in Remix
