Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_commands.po
Languages: fr, it

source: Remix Commands
fr: Commandes Remix
it: Comandi Remix

source: In the console, you can run the commands listed below. Once you start to type a command, there is *auto complete*. These commands are using the following libraries:
fr: Dans la console, vous pouvez exécuter les commandes énumérées ci-dessous. Une fois que vous commencez à taper une commande, il y a *auto complete*. Ces commandes utilisent les bibliothèques suivantes :
it: Nella console è possibile eseguire i comandi elencati di seguito. Quando si inizia a digitare un comando, c'è il *completamento automatico*. Questi comandi utilizzano le seguenti librerie:

source: **remix**: Remix has a number of CLI commands for loading & executing file in a workspace. See the list below.
fr: **remix** : Remix dispose d'un certain nombre de commandes CLI pour charger et exécuter des fichiers dans un espace de travail. Voir la liste ci-dessous.
it: **remix**: Remix dispone di una serie di comandi CLI per caricare ed eseguire i file in un'area di lavoro. Vedere l'elenco seguente.

source: **ethers**: Remix IDE enables the use of ethersjs commands. See the [Ethers docs](https://docs.ethers.io/) for the full list.
fr: **ethers** : L'IDE Remix permet l'utilisation des commandes ethersjs. Voir la [Ethers docs] (https://docs.ethers.io/) pour la liste complète.
it: **ethers**: l'IDE di Remix consente l'uso dei comandi ethersjs. Vedere i [documenti di Ethers] (https://docs.ethers.io/) per l'elenco completo.

source: **web3**: Remix IDE enable the use of web3js commands. See the [Web3js docs](https://web3js.readthedocs.io/) for the full list.
fr: **web3** : L'IDE Remix permet l'utilisation des commandes web3js. Voir la [Web3js docs](https://web3js.readthedocs.io/) pour la liste complète.
it: **web3**: l'IDE Remix abilita l'uso dei comandi web3js. Vedere i [documenti Web3js](https://web3js.readthedocs.io/) per l'elenco completo.

source: **swarmgw**: This library can be used to upload/download files to Swarm via https://swarm-gateways.net/.
fr: **swarmgw** : Cette bibliothèque peut être utilisée pour télécharger des fichiers vers Swarm via https://swarm-gateways.net/.
it: **swarmgw**: questa libreria può essere usata per caricare/scaricare file su Swarm tramite https://swarm-gateways.net/.

source: **remix.execute(filepath)**: Run the script specified by file path. If filepath is empty, script currently displayed in the editor is executed.
fr: **remix.execute(filepath)** : Exécute le script spécifié par le chemin d'accès au fichier. Si filepath est vide, le script actuellement affiché dans l'éditeur est exécuté.
it: **remix.execute(filepath)**: esegue lo script specificato dal percorso del file. Se il percorso del file è vuoto, viene eseguito lo script attualmente visualizzato nell'editor.

source: **remix.exeCurrent()**: Run the script currently displayed in the editor.
fr: **remix.exeCurrent()** : Exécute le script actuellement affiché dans l'éditeur.
it: **remix.exeCurrent()**: esegue lo script attualmente visualizzato nell'editor.

source: **remix.getFile(path)**: Returns the content of the file located at the given path
fr: **remix.getFile(path)** : renvoie le contenu du fichier situé au chemin donné
it: **remix.getFile(path)**: restituisce il contenuto del file che si trova nel percorso indicato

source: **remix.help()**: Display this help message.
fr: **remix.help()** : Affichez ce message d'aide.
it: **remix.help()**: visualizza questo messaggio di aiuto.

source: **remix.loadgist(id)**: Load a gist in the file explorer.
fr: **remix.loadgist(id)** : Charger une liste de diffusion dans l'explorateur de fichiers.
it: **remix.loadgist(id)**: Caricare un gist nell'esplora file.

source: **remix.loadurl(url)**: Load the given url in the file explorer. The url can be of type github, swarm or ipfs.
fr: **remix.loadurl(url)** : Charge l'url donnée dans l'explorateur de fichiers. L'url peut être de type github, swarm ou ipfs.
it: **remix.loadurl(url)**: carica l'url dato nell'esplora file. L'url può essere di tipo github, swarm o ipfs.

source: A few Ethers JS examples
fr: Quelques exemples d'Ethers JS
it: Alcuni esempi di Ethers JS

source: **ethers.providers**: A Provider abstracts a connection to the Ethereum blockchain, for issuing queries and sending state changing transactions.
fr: **ethers.providers** : Un fournisseur abstrait une connexion à la blockchain Ethereum, pour l'émission de requêtes et l'envoi de transactions changeant d'état.
it: **ethers.providers**: un fornitore realizza una connessione alla blockchain di Ethereum, per emettere query e inviare transazioni che cambiano lo stato.

source: **ethers.utils**: The utility functions exposed in both the ethers umbrella package and the ethers-utils. eg ethers.utils.formatBytes32String( text )
fr: **ethers.utils** : Les fonctions utilitaires exposées à la fois dans le paquet ethers umbrella et dans ethers-utils. ex : ethers.utils.formatBytes32String( text )
it: **ethers.utils**: le funzioni utili esposte sia nel pacchetto ethers umbrella che in ethers-utils. Per esempio: ethers.utils.formatBytes32String( text )

source: A few Web3 JS examples
fr: Quelques exemples de Web3 JS
it: Alcuni esempi di Web3 JS

source: **web3.eth.abi**: The web3.eth.abi functions let you de- and encode parameters to ABI (Application Binary Interface) for function calls to the EVM (Ethereum Virtual Machine).
fr: **web3.eth.abi** : Les fonctions web3.eth.abi vous permettent de dé- et d'encoder des paramètres à l'ABI (Application Binary Interface) pour les appels de fonction à l'EVM (Ethereum Virtual Machine).
it: **web3.eth.abi**: le funzioni web3.eth.abi consentono di decodificate e codificare i parametri in ABI (Application Binary Interface) per le chiamate di funzione alla EVM (Macchina Virtuale di Ethereum).

source: **web3.providers**: Contains the current available providers.
fr: **web3.providers** : Contient les fournisseurs actuellement disponibles.
it: **web3.providers**: contiene i fornitori attualmente disponibili.

source: **web3.utils**: This package provides utility functions for Ethereum dapps and other **web3.js packages.
fr: **web3.utils** : Ce paquet fournit des fonctions utilitaires pour les dapps Ethereum et d'autres paquets **web3.js.
it: **web3.utils**: questo pacchetto fornisce funzioni utili per le dapps Ethereum e altri pacchetti **web3.js.

source: A few Swarm examples (these will be updated soon)
fr: Quelques exemples de Swarm (ils seront bientôt mis à jour)
it: Alcuni esempi di Swarm (saranno presto aggiornati)

source: **swarmgw.get(url, cb)**: Download files from Swarm via https**://swarm-gateways.net/
fr: **swarmgw.get(url, cb)** : Téléchargez des fichiers depuis Swarm via https**://swarm-gateways.net/
it: **swarmgw.get(url, cb)**: scarica i file da Swarm tramite https**://swarm-gateways.net/

source: **swarmgw.put(content, cb)**: Upload files to Swarm via https**://swarm-gateways.net/
fr: **swarmgw.put(content, cb)** : Téléchargement de fichiers vers Swarm via https**://swarm-gateways.net/
it: **swarmgw.put(content, cb)**: caricare i file su Swarm tramite https**://swarm-gateways.net/
