Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remixd.po
Languages: es, fr, it

source: Remixd: Access your Local Filesystem
es: Remixd: Acceda a su sistema de archivos local
fr: Remixd : Accédez à votre système de fichiers local
it: Remixd: Accedere al tuo filesystem locale

source: [![npm version](https://badge.fury.io/js/%40remix-project%2Fremixd.svg)](https://www.npmjs.com/package/@remix-project/remixd)
es: [![versión npm](https://badge.fury.io/js/%40remix-project%2Fremixd.svg)](https://www.npmjs.com/package/@remix-project/remixd)

source: npm version
es: versión npm
fr: version npm
it: versione npm

source: To give the Remix IDE (the web app) access to a folder on your computer, you need to use **Remixd** - the plugin along with **remixd** - the cli/npm module.
es: Para dar acceso al IDE Remix (la aplicación web) a una carpeta de su ordenador, necesita utilizar **Remixd** - el plugin junto con **remixd** - el módulo cli/npm.
fr: Pour donner à l'IDE Remix (l'application web) l'accès à un dossier sur votre ordinateur, vous devez utiliser **Remixd** - le plugin ainsi que **remixd** - le module cli/npm.
it: Per dare all'IDE Remix (l'applicazione web) l'accesso a una cartella sul tuo computer, è necessario usare **Remixd** - il plugin con **remixd** - il modulo cli/npm.

source: The **Remixd** plugin can be activated from the plugin manager or in the **File Explorer** - see the image below. The **connect to localhost** - will activate the **Remixd** plugin.
es: El plugin **Remixd** puede activarse desde el gestor de plugins o en el **Explorador de archivos** - vea la imagen inferior. El **connect to localhost** - activará el plugin **Remixd**.
fr: Le plugin **Remixd** peut être activé à partir du gestionnaire de plugins ou de l'explorateur de fichiers** - voir l'image ci-dessous. L'option **connect to localhost** - activera le plugin **Remixd**.
it: Il plugin **Remixd** può essere attivato dal gestore dei plugin o da **Esplora file** - vedere l'immagine qui sotto. Il comando **connect to localhost** (connetti al localhost) attiverà il plugin **Remixd**.

source: Once you click **connect to localhost** or activate Remixd from the **Plugin Manager**, a modal will come up:
es: Una vez que haga clic en **conectar a localhost** o active Remixd desde el **Administrador de plugins**, aparecerá un modal:
fr: Une fois que vous cliquez sur **connect to localhost** ou que vous activez Remixd depuis le **Plugin Manager**, une fenêtre modale s'affiche :
it: Una volta cliccato su **connect to localhost** (connetti a localhost) o attivato Remixd dal **Gestore di Plugin**, si aprirà una finestra di dialogo:

source: The Remixd plugin is a **websocket plugin** and it has no UI other than this modal dialog box - so you won't see a Remixd icon in the icon panel.
es: El plugin Remixd es un **plugin de conexión web** y no tiene más interfaz de usuario que este cuadro de diálogo modal, por lo que no verá un icono Remixd en el panel de iconos.
fr: Le plugin Remixd est un plugin **websocket** et il n'a pas d'interface utilisateur autre que cette boîte de dialogue modale - vous ne verrez donc pas d'icône Remixd dans le panneau d'icônes.
it: Il plugin Remixd è un **plugin websocket** e non ha un'interfaccia utente se non questa finestra di dialogo - quindi non vedrete un'icona Remixd nel pannello delle icone.

source: Before you hit **Connect**, you need to install the [remixd NPM module](https://www.npmjs.com/package/@remix-project/remixd) and run the **remixd** command.
es: Antes de pulsar **Conectar**, debe instalar el [módulo NPM remixd](https://www.npmjs.com/package/@remix-project/remixd) y ejecutar el comando **remixd**.
fr: Avant de cliquer sur **Connect**, vous devez installer le [module NPM remixd] (https://www.npmjs.com/package/@remix-project/remixd) et lancer la commande **remixd**.
it: Prima di premere **Connect** (Comnetti), è necessario installare il [modulo NPM remixd] (https://www.npmjs.com/package/@remix-project/remixd) ed eseguire il comando **remixd**.

source: The code of `remixd` is [here](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .
es: El código de `remixd` es [here](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .
fr: Le code de `remixd` est [here](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .
it: Il codice di `remixd` è [qui](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .

source: remixd Installation
es: Instalación remixd
fr: Installation remixd
it: installazione di remixd

source: **remixd** is an NPM module and can be globally installed using the following command: `npm install -g @remix-project/remixd`
es: **remixd** es un módulo NPM y puede instalarse globalmente mediante el siguiente comando: `npm install -g @remix-project/remixd`
fr: **remixd** est un module NPM et peut être installé globalement en utilisant la commande suivante : `npm install -g @remix-project/remixd`
it: **remixd** è un modulo NPM e può essere installato globalmente con il seguente comando: npm install -g @remix-project/remixd`

source: Or just install it in the directory of your choice by removing the -g flag: `npm install @remix-project/remixd`
es: O simplemente instálelo en el directorio de su elección eliminando la bandera -g: `npm install @remix-project/remixd`.
fr: Vous pouvez également l'installer dans le répertoire de votre choix en supprimant le drapeau -g : `npm install @remix-project/remixd`
it: Oppure installatelo semplicemente nella directory di vostra scelta, rimuovendo il flag -g: `npm install @remix-project/remixd`

source: **NOTE:** When the remixd NPM module is installed, it also installs [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) and sets [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) to latest version i.e. 0.8.15 currently.
es: **NOTA:** Cuando se instala el módulo NPM remixd, también se instala [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) y se establece [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) a la última versión, es decir, 0.8.15 actualmente.
fr: **NOTE:** Lorsque le module NPM remixd est installé, il installe également [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) et met [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) à la dernière version, c'est-à-dire 0.8.15 actuellement.
it: **NOTA:** Quando il modulo NPM remixd viene installato, installa anche [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) and sets [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) alla versione più recente, per esempio, la 0.8.15 corrente.

source: **ALSO NOTE:** `Python3.6+ (pip3)` needs to already be installed on the System. (This packaging of Slither with the remixd module is supported since Remixd v0.6.3). In case of any discrepancy, Slither can also installed along with other dependencies using command `remixd -i slither`
es: **ALSO NOTA:** `Python3.6+ (pip3)` necesita estar ya instalado en el Sistema. (Este empaquetado de Slither con el módulo remixd está soportado desde Remixd v0.6.3). En caso de discrepancia, Slither también puede instalarse junto con otras dependencias utilizando el comando `remixd -i slither`.
fr: **NOTE AUSSI:** `Python3.6+ (pip3)` doit être déjà installé sur le système. (Cet empaquetage de Slither avec le module remixd est supporté depuis Remixd v0.6.3). En cas de divergence, Slither peut également être installé avec d'autres dépendances en utilisant la commande `remixd -i slither`
it: **ALTRA NOTA:** `Python3.6+ (pip3)` deve essere già installato sul sistema. (Questo pacchetto di Slither con il modulo remixd è supportato da Remixd v0.6.3). In caso di qualsiasi discrepanza, Slither può essere anche installato insieme ad altre dipendenze usando il comando `remixd -i slither`

source: Find your version of remixd
es: Encuentre su versión de remixd
fr: Trouvez votre version de remixd
it: Trova la tua versione di remixd

source: The command: `remixd -v` or `remixd --version` will return your version number.
es: El comando `remixd -v` o `remixd --version` le devolverá su número de versión.
fr: La commande : `remixd -v` ou `remixd --version` vous renverra votre numéro de version.
it: Il comando: `remixd -v` o `remixd --version` restituirà il numero della tua versione.

source: **If this command does not work, then you have an outdated version!**
es: **¡Si este comando no funciona, es que tiene una versión obsoleta!**
fr: **Si cette commande ne fonctionne pas, c'est que votre version est obsolète.
it: **Se questo comando non funziona, avete una versione non aggiornata

source: Update to the latest remixd
es: Actualización al último remixd
fr: Mise à jour vers la dernière version remixée
it: Aggiornamento all'ultimo remixd

source: Because **remixd** creates a bridge from the browser to your local filesystem, it is important that you have the latest version of script.
es: Dado que **remixd** crea un puente desde el navegador hasta su sistema de archivos local, es importante que disponga de la última versión del script.
fr: Comme **remixd** crée un pont entre le navigateur et votre système de fichiers local, il est important que vous disposiez de la dernière version du script.
it: Poiché **remixd** crea un ponte dal browser al tuo filesystem locale, è importante disporre dell'ultima versione dello script.

source: For users who had installed the version of remixd from the **VERY** old NPM address or for users who do not know which NPM address they had installed it from, run these 2 steps:
es: Para los usuarios que habían instalado la versión de remixd desde la dirección NPM **MUY** antigua o para los usuarios que no saben desde qué dirección NPM lo habían instalado, ejecute estos 2 pasos:
fr: Pour les utilisateurs qui ont installé la version de remixd à partir de la **TRES** vieille adresse NPM ou pour les utilisateurs qui ne savent pas à partir de quelle adresse NPM ils l'ont installée, exécutez ces 2 étapes :
it: Per gli utenti che hanno installato la versione di remixd da un indirizzo NPM **MOLTO** vecchio o per gli utenti che non sanno da quale indirizzo NPM l'hanno installata, eseguire questi 2 passaggi:

source: uninstall the old one: **npm uninstall -g remixd**
es: desinstale el antiguo **npm uninstall -g remixd**
fr: désinstallez l'ancien : **npm uninstall -g remixd**
it: disinstallare il vecchio: **npm uninstall -g remixd**

source: install the new: **npm install -g @remix-project/remixd**
es: instale lo nuevo: **npm install -g @remix-project/remixd**
fr: installez le nouveau : **npm install -g @remix-project/remixd**
it: installare il nuovo: **npm install -g @remix-project/remixd**

source: **For Most Users** who know that they have a remixd version installed from @remix-project/remixd then just run:
es: **Para la mayoría de los usuarios** que saben que tienen una versión remixd instalada desde @remix-project/remixd entonces sólo tiene que ejecutar:
fr: **Pour la plupart des utilisateurs** qui savent qu'ils ont une version de remixd installée depuis @remix-project/remixd, exécutez simplement :
it: **Per la maggioranza degli utenti** che sanno di avere una versione di remixd installata da @remix-project/remixd, basta eseguire:

source: remixd command
es: comando remixd
fr: commande remixd
it: comandi di remixd

source: The remixd command without options uses the terminal's current directory as the shared directory and the shared Remix domain will be `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org`, or `https://remix-beta.ethereum.org`
es: El comando remixd sin opciones utiliza el directorio actual del terminal como directorio compartido y el dominio Remix compartido será `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org`, o `https://remix-beta.ethereum.org`.
fr: La commande remixd sans options utilise le répertoire courant du terminal comme répertoire partagé et le domaine Remix partagé sera `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org`, ou `https://remix-beta.ethereum.org`
it: Il comando remixd senza opzioni utilizza la directory corrente del terminale come directory condivisa e il dominio Remix condiviso sarà `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org` o `https://remix-beta.ethereum.org`

source: The remixd command is:<br> `remixd`
es: El comando remixd es:<br> `remixd`
fr: La commande remixd est la suivante :<br> `remixd`
it: Il comando remixd è:<br> `remixd`

source: If you are using Remix from localhost or you are not running the command from your working directory, you'll need to use the command with flags.
es: Si está utilizando Remix desde localhost o no está ejecutando el comando desde su directorio de trabajo, tendrá que utilizar el comando con banderas.
fr: Si vous utilisez Remix depuis localhost ou si vous n'exécutez pas la commande depuis votre répertoire de travail, vous devrez utiliser la commande avec des drapeaux.
it: Se si utilizza Remix da localhost o non si esegue il comando dalla propria directory di lavoro, è necessario utilizzare il comando con i flag.

source: remixd options
es: opciones remixd
fr: options remixd
it: opzioni di remixd

source: **NOTE**: `remixd -i slither` can be used to install Slither along with its dependencies
es: **NOTA**: `remixd -i slither` se puede utilizar para instalar Slither junto con sus dependencias
fr: **NOTE** : `remixd -i slither` peut être utilisé pour installer Slither avec ses dépendances.
it: **NOTA**: `remixd -i slither` può essere usato per installare Slither insieme alle sue dipendenze

source: HTTP vs HTTPS in the remixd command
es: HTTP vs HTTPS en el comando remixd
fr: HTTP vs HTTPS dans la commande remixd
it: HTTP vs HTTPS nel comando remixd

source: If your browser is on https://remix.ethereum.org (**secure http**) then use https in the command:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`
es: Si su navegador está en https://remix.ethereum.org (**secure http**) entonces utilice https en el comando:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`
fr: Si votre navigateur est sur https://remix.ethereum.org (**secure http**), utilisez https dans la commande :<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`
it: Se il browser è su https://remix.ethereum.org (**secure http**), usare https nel comando:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`

source: Or if you are using **http** in the browser, then use **http** in the remixd command.
es: O si está utilizando **http** en el navegador, entonces utilice **http** en el comando remixd.
fr: Ou si vous utilisez **http** dans le navigateur, utilisez **http** dans la commande remixd.
it: Oppure, se si usa **http** nel browser, usare **http** nel comando remixd.

source: Read/Write permission & Read-only mode
es: Permiso de lectura/escritura y modo de sólo lectura
fr: Autorisation de lecture/écriture et mode lecture seule
it: Permessi di lettura/scrittura & Modalità di sola lettura

source: The folder is shared using **a websocket connection** between `Remix IDE` and `remixd`.
es: La carpeta se comparte mediante **una conexión websocket** entre `Remix IDE` y `remixd`.
fr: Le dossier est partagé en utilisant **une connexion websocket** entre `Remix IDE` et `remixd`.
it: La cartella viene condivisa utilizzando **una connessione websocket** tra l'`IDE Remix` e `remixd`.

source: Be sure the user executing `remixd` has read/write permission on the folder.
es: Asegúrese de que el usuario que ejecuta `remixd` tiene permiso de lectura/escritura en la carpeta.
fr: Assurez-vous que l'utilisateur qui exécute `remixd` a les droits de lecture/écriture sur le dossier.
it: Assicurarsi che l'utente che esegue `remixd` abbia i permessi di lettura/scrittura sulla cartella.

source: Alternatively, there is an option to run remixd in read-only mode, use `--read-only` flag.
es: Alternativamente, existe una opción para ejecutar remixd en modo de sólo lectura, utilice la bandera `--read-only`.
fr: Alternativement, il y a une option pour exécuter remixd en mode lecture seule, utilisez le drapeau `--read-only`.
it: In alternativa, c'è un'opzione per eseguire remixd in modalità di sola lettura, usando il flag `--read-only`.

source: Ports Usage
es: Uso de los puertos
fr: Utilisation des ports
it: Utilizzo Porte

source: `remixd` functions by making websocket connections with Remix IDE on different ports. Ports are defined according to specific purpose. Port usage details are as:
es: `remixd` funciona realizando conexiones websocket con Remix IDE en diferentes puertos. Los puertos se definen según un propósito específico. Los detalles de uso de los puertos son los siguientes:
fr: `remixd` fonctionne en établissant des connexions websocket avec Remix IDE sur différents ports. Les ports sont définis en fonction d'objectifs spécifiques. Les détails de l'utilisation des ports sont les suivants :
it: `remixd` funziona effettuando connessioni websocket con l'IDE Remix su diverse porte. Le porte sono definite in accordo con lo scopo specifico. I dettagli sull'uso delle porte sono i seguenti:

source: **65520** : For `remixd` websocket listener, to share local file system with Remix IDE. Shared folder will be loaded in the Remix IDE `File Explorers` workspace named `localhost`
es: **65520** : Para `remixd` websocket listener, para compartir el sistema de archivos local con Remix IDE. La carpeta compartida se cargará en el espacio de trabajo `File Explorers` del IDE Remix con el nombre `localhost`.
fr: **65520** : Pour l'auditeur websocket `remixd`, partager le système de fichiers local avec Remix IDE. Le dossier partagé sera chargé dans l'espace de travail `File Explorers` de Remix IDE nommé `localhost`.
it: **65520** : per il listener websocket `remixd`, per condividere il file system locale con l'IDE Remix. La cartella condivisa sarà caricata nell'area di lavoro `Esplora File` dell'IDE Remix, denominata `localhost`

source: **65522** : For `hardhat` websocket listener, to enable the Hardhat Compilation using Remix IDE `Solidity Compiler` plugin, if shared folder is a Hardhat project.
es: **65522** : Para `hardhat` websocket listener, para habilitar la Compilación Hardhat utilizando Remix IDE `Solidity Compiler` plugin, si la carpeta compartida es un proyecto Hardhat.
fr: **65522** : Pour le websocket listener `hardhat`, activer la compilation Hardhat en utilisant le plugin `Solidity Compiler` de Remix IDE, si le dossier partagé est un projet Hardhat.
it: **65522** : per il listener websocket `hardhat`, per abilitare la compilazione Hardhat usando il plugin `Solidity Compiler` (Compilatore Solidity) dell'IDE Remix, se la cartella condivisa è un progetto Hardhat.

source: **65523** : For `slither` websocket listener, to enable the Slither Analysis using Remix IDE `Solidity Static Analysis` plugin
es: **65523** : Para `slither` websocket listener, para habilitar el análisis Slither utilizando Remix IDE `Solidity Static Analysis` plugin
fr: **65523** : Pour l'écouteur websocket `slither`, activer l'analyse Slither en utilisant le plugin `Solidity Static Analysis` de l'IDE Remix.
it: **65523** : per il listener websocket `slither`, per abilitare l'analisi di Slither usando il plugin `Solidity Static Analysis` (Analisi statica Solidity) dell'IDE Remix

source: **65524** : For `truffle` websocket listener, to enable the Truffle Compilation using Remix IDE `Solidity Compiler` plugin, if shared folder is a Truffle project.
es: **65524** : Para `truffle` websocket listener, para habilitar la Compilación Truffle usando Remix IDE `Solidity Compiler` plugin, si la carpeta compartida es un proyecto Truffle.
fr: **65524** : Pour l'écouteur websocket `truffle`, activer la compilation Truffle en utilisant le plugin `Solidity Compiler` de Remix IDE, si le dossier partagé est un projet Truffle.
it: **65524** : per il listener websocket `truffle`, per abilitare la compilazione Truffle usando il plugin `Solidity Compiler` (Compilatore Solidity) dell'IDE Remix, se la cartella condivisa è un progetto Truffle.

source: **Note:** Please make sure your system is secured enough and these ports are not opened nor forwarded.
es: **Nota:** Por favor, asegúrese de que su sistema está suficientemente protegido y de que estos puertos no están abiertos ni reenviados.
fr: **Note:** Assurez-vous que votre système est suffisamment sécurisé et que ces ports ne sont pas ouverts ou transférés.
it: **Nota:** Assicurarsi che il tuo sistema sia sufficientemente protetto e che queste porte non siano aperte o inoltrate.

source: Warning!
es: ¡Atención!
fr: Attention !
it: Attenzione!

source: `remixd` **provides full read and write access** to the given folder **for any application** that can access the `TCP port 65520` on your local host.
es: `remixd` **proporciona acceso completo de lectura y escritura** a la carpeta dada **para cualquier aplicación** que pueda acceder al `puerto TCP 65520` en su host local.
fr: `remixd` **fournit un accès complet en lecture et en écriture** au dossier donné **pour toute application** qui peut accéder au `TCP port 65520` sur votre hôte local.
it: `remixd` **fornisce accesso completo in lettura e scrittura** alla cartella data **per qualsiasi applicazione** che possa accedere alla `porta TCP 65520` sul tuo host locale.

source: To minimize the risk, Remixd can **ONLY** bridge between your filesystem and the Remix IDE URLS - including:
es: Para minimizar el riesgo, Remixd puede **ÚNICAMENTE** hacer de puente entre su sistema de archivos y las URL del IDE Remix - incluyendo:
fr: Pour minimiser le risque, Remixd peut **Seulement** faire le pont entre votre système de fichiers et les URLs de l'IDE Remix - y compris :
it: Per minimizzare il rischio, Remixd può **SOLO** fare da ponte tra il vostro filesystem e gli URL dell'IDE di Remix - inclusi:

source: (the package:// urls in the list above are for remix desktop)
es: (las urls package:// de la lista anterior son para remix desktop)
fr: (les urls package:// dans la liste ci-dessus sont pour le remix desktop)
it: (il pacchetto:// url nella lista sopra sono per remix desktop)

source: Clicking Connect on the modal.
es: Haga clic en Conectar en el modal.
fr: Cliquez sur Connecter dans la fenêtre modale.
it: Cliccando Connetti nella finestra di dialogo.

source: Clicking on the **Connect** button on the Remixd modal (see the image above), will attempt to start a session where your browser can access the specified folder on your computer's filesystem.
es: Al hacer clic en el botón **Conectar** del modal Remixd (véase la imagen superior), se intentará iniciar una sesión en la que su navegador pueda acceder a la carpeta especificada en el sistema de archivos de su ordenador.
fr: En cliquant sur le bouton **Connect** de la fenêtre modale de Remixd (voir l'image ci-dessus), vous tenterez de démarrer une session dans laquelle votre navigateur pourra accéder au dossier spécifié sur le système de fichiers de votre ordinateur.
it: Cliccando sul pulsante **Connect** (Connetti) nella finestra di dialogo di Remixd (vedi immagine sopra), si tenterà di avviare una sessione dove il tuo browser potrà accedere alla cartella specificata nel filesystem del tuo computer.
