Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remixd.po
Languages: es, fr, it

source: If you do not have `remixd` running in the background - another modal will open up and it will say:
es: Si no tiene `remixd` ejecutándose en segundo plano - se abrirá otro modal que dirá:
fr: Si `remixd` ne tourne pas en arrière-plan, une autre fenêtre modale s'ouvrira et dira :
it: Se non c'è `remixd` in esecuzione in background - si aprirà un'altra finestra di dialogo che dirà:

source: Assuming you don't get the 2nd modal, your connection to the remixd daemon is successful. The shared folder will be visible in the File Explorer's workspace under **localhost**.
es: Suponiendo que no le aparezca el segundo modal, su conexión con el demonio remixd ha tenido éxito. La carpeta compartida será visible en el espacio de trabajo del Explorador de archivos bajo **localhost**.
fr: Si vous n'obtenez pas la deuxième fenêtre modale, votre connexion au démon remixd est réussie. Le dossier partagé sera visible dans l'espace de travail de l'explorateur de fichiers sous **localhost**.
it: Assumendo che non venga visualizzata la seconda finestra di dialogo, la connessione al daemon remixd è riuscita. La cartella condivisa sarà visibile nell'area di lavoro di Esplora file sotto **localhost**.

source: Creating & deleting folders & files
es: Creación y eliminación de carpetas y archivos
fr: Création et suppression de dossiers et de fichiers
it: Creazione & cancellazione di cartelle e file

source: Clicking on the **new folder** or **new file** icon under **localhost** will create a new file or folder in the shared folder. Similarly, if you **right click** on a file or folder you can **rename** or **delete** the file.
es: Si hace clic en el icono **nueva carpeta** o **nuevo archivo** bajo **localhost** creará un nuevo archivo o carpeta en la carpeta compartida. Del mismo modo, si hace **clic con el botón derecho** en un archivo o carpeta podrá **renombrar** o **eliminar** el archivo.
fr: En cliquant sur l'icône **nouveau dossier** ou **nouveau fichier** sous **localhost**, vous créez un nouveau fichier ou dossier dans le dossier partagé. De même, si vous **cliquez avec le bouton droit de la souris** sur un fichier ou un dossier, vous pouvez **renommer** ou **supprimer** le fichier.
it: Cliccando sull'icona **new folder** (nuova cartella) o **new file** (nuovo file) sotto **localhost** si crea un nuovo file o una nuova cartella nella cartella condivisa. Allo stesso modo, **cliccando con il tasto destro** su un file o una cartella è possibile **rinominare** o **eliminare** il file.

source: Closing a remixd session
es: Cerrar una sesión remixd
fr: Clôture d'une session remixée
it: Chiusura di una sessione di remixd

source: In the terminal where **remixd** is running, typing `ctrl-c` will close the session. Remix IDE will then put up a modal saying that **remixd** has stopped running.
es: En el terminal donde se esté ejecutando **remixd**, tecleando `ctrl-c` cerrará la sesión. Remix IDE pondrá entonces un modal diciendo que **remixd** ha dejado de ejecutarse.
fr: Dans le terminal où **remixd** s'exécute, taper `ctrl-c` fermera la session. Remix IDE affichera alors une fenêtre modale indiquant que **remixd** a cessé de fonctionner.
it: Nel terminale in cui **remixd** è in esecuzione, digitando `ctrl-c` si chiuderà la sessione. L'IDE Remix visualizzerà un messaggio modale che indicherà che **remixd** ha smesso di funzionare.
