Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run.po
Languages: es, fr, it

source: Deploy & Run
es: Despliegue y ejecución
fr: Déployer et exécuter
it: Distribuisci & Esegui

source: ![](images/a-run-icon.png) The Deploy & Run module is for sending transactions to the current **Environment**.
es: ![](images/a-run-icon.png) El módulo Deploy & Run sirve para enviar transacciones al **Entorno** actual.
fr: ![](images/a-run-icon.png) Le module Deploy & Run permet d'envoyer des transactions à l'**Environnement** actuel.
it: ![](images/a-run-icon.png) Il modulo Distribuisci & Esegui serve per inviare le transazioni all'**Ambiente** corrente.

source: For deploying, you need to have a contract compiled. To check that there is a compiled contract, find the <b>CONTRACT</b> select box (which is under the VALUE input field), you can use this module.
es: Para el despliegue, necesita tener un contrato compilado. Para comprobar que existe un contrato compilado, busque la casilla de selección <b>CONTRATO</b> (que se encuentra bajo el campo de entrada VALOR), puede utilizar este módulo.
fr: Pour le déploiement, vous devez disposer d'un contrat compilé. Pour vérifier qu'il existe un contrat compilé, trouvez la boîte de sélection <b>CONTRACT</b> (qui se trouve sous le champ de saisie VALUE), vous pouvez utiliser ce module.
it: Per la distribuzione, è necessario disporre di un contratto compilato. Per verificare se c'è un contratto compilato, trovare la casella di selezione <b>CONTRACT</b> (CONTRATTO) (che si trova sotto il campo di immissione VALUE (VALORE)), è possibile utilizzare questo modulo.

source: If nothing is there, you need to compile a file. If you do not see the contract you want, you need to select a contract in the editor to make it active.
es: Si no hay nada, necesita compilar un archivo. Si no ve el contrato que desea, tiene que seleccionar un contrato en el editor para que se active.
fr: S'il n'y a rien, vous devez compiler un fichier. Si vous ne voyez pas le contrat que vous souhaitez, vous devez sélectionner un contrat dans l'éditeur pour le rendre actif.
it: Se non c'è niente, è necessario compilare un file. Se non si vede il contratto desiderato, è necessario selezionare un contratto nell'editor per renderlo attivo.

source: Environment
es: Medio ambiente
fr: Environnement
it: Ambiente

source: `Remix VM (Merge)` : Connects to a sandbox blockchain in the browser. The Remix VM (previously called JavaScript VM) is its own "blockchain" and on each reload the old chain will be cleared and a new blockchain will be started. **The old one will not be saved**. Merge refers to the fork of Ethereum when the Merge occurred. This fork is also known as the **Paris** fork.
es: `Remix VM (Merge)` : Se conecta a una blockchain sandbox en el navegador. La Remix VM (antes llamada JavaScript VM) es su propia "blockchain" y en cada recarga se borrará la cadena antigua y se iniciará una nueva blockchain. **La antigua no se guardará**. Fusión se refiere a la bifurcación de Ethereum cuando se produjo la Fusión. Esta bifurcación también se conoce como la bifurcación **París**.
fr: `Remix VM (Merge)` : Se connecte à une blockchain sandbox dans le navigateur. La Remix VM (précédemment appelée JavaScript VM) est sa propre "blockchain" et à chaque rechargement, l'ancienne chaîne sera effacée et une nouvelle blockchain sera démarrée. **L'ancienne blockchain ne sera pas sauvegardée. Merge fait référence à la fourche d'Ethereum lorsque la fusion s'est produite. Cette fourche est également connue sous le nom de **Paris** fork.
it: Remix VM (Merge)` : si collega ad una blockchain sandbox nel browser. La VM Remix (precedentemente chiamata VM JavaScript) è la propria "blockchain" ed a ogni ricarica la vecchia catena verrà cancellata e verrà avviata una nuova blockchain. **La vecchia non verrà salvata**. Merge (unione) si riferisce alla biforcazione (fork) di Ethereum quando si è verificato il Merge. Questo fork è noto anche come fork di **Parigi**.

source: `Remix VM (London)` : Same as above except this chain is using the London fork of Ethereum.
es: `Remix VM (London)` : Igual que la anterior, salvo que esta cadena utiliza la bifurcación London de Ethereum.
fr: `Remix VM (London)` : Identique à la précédente, sauf que cette chaîne utilise la fourchette de Londres d'Ethereum.
it: `Remix VM (London)` : come sopra, eccetto per il fatto che questa catena utilizza la biforcazione (fork) Londra di Ethereum.

source: `Remix VM (Berlin)` : Same as above except this chain is using the Berlin fork of Ethereum.
es: `Remix VM (Berlin)` : Igual que la anterior, salvo que esta cadena utiliza la bifurcación Berlin de Ethereum.
fr: `Remix VM (Berlin)` : Même chose que ci-dessus, mais cette chaîne utilise la version berlinoise d'Ethereum.
it: `Remix VM (Berlin)` : come sopra, ma questa catena utilizza la biforcazione (fork) Berlin di Ethereum.

source: `Remix VM - Mainnet fork` : This will fork the Ethereum mainnet and will load it into the Remix VM. It is useful for developing contracts that need to access deployed mainnet contracts. (See below for more info about Forking)
es: `Remix VM - Mainnet fork` : Esto bifurcará la mainnet de Ethereum y la cargará en la Remix VM. Es útil para desarrollar contratos que necesiten acceder a contratos mainnet desplegados. (Véase más abajo para más información sobre la bifurcación)
fr: `Remix VM - Mainnet fork` : Ceci forkera le mainnet Ethereum et le chargera dans la Remix VM. C'est utile pour développer des contrats qui ont besoin d'accéder à des contrats mainnet déployés. (Voir ci-dessous pour plus d'informations sur le Forking)
it: `Remix VM - Mainnet fork` : questa biforca (fork) la rete principale (mainnet) di Ethereum e viene caricato nella VM Remix. È utile per sviluppare contratti che devono accedere ai contratti della rete principale. (Per maggiori informazioni sulla biforcazione, vedere sotto)

source: `Remix VM - Goerli fork` : Same as above except this forks the Goerli testnet. (See below for more info about Forking)
es: `Remix VM - Goerli fork` : Igual que el anterior, excepto que éste bifurca la red de pruebas Goerli. (Ver más abajo para más información sobre Forking)
fr: `Remix VM - Goerli fork` : Identique au précédent, sauf qu'il s'agit d'un fork du réseau de test Goerli. (Voir ci-dessous pour plus d'informations sur le forkage)
it: `Remix VM - Goerli fork` : come sopra, tranne che per la biforcazione (fork) della rete di test di Goerli. (Vedere sotto per maggiori informazioni sulla biforcazione)

source: `Remix VM - Sepolia fork` : Same as above except this forks the Sepolia testnet. (See below for more info about Forking)
es: `Remix VM - Sepolia fork` : Igual que el anterior, excepto que éste bifurca la red de pruebas de Sepolia. (Ver más abajo para más información sobre Forking)
fr: `Remix VM - Sepolia fork` : Identique à ce qui précède, sauf qu'il s'agit d'un fork du réseau de test Sepolia. (Voir ci-dessous pour plus d'informations sur le Forking)
it: `Remix VM - Sepolia fork` : come sopra, ma con la biforcazione (fork) della rete di test Sepolia. (Vedere sotto per maggiori informazioni sulla biforcazione)

source: `Remix VM - Custom fork` : Forks a chain, at block number, and in an EVM version of your choice. (See below for more info about Forking)
es: `Remix VM - Custom fork` : bifurca una cadena, en número de bloque, y en una versión de EVM de su elección. (Véase más abajo para más información sobre la bifurcación)
fr: `Remix VM - Custom fork` : Forks une chaîne, au numéro de bloc, et dans une version EVM de votre choix. (Voir ci-dessous pour plus d'informations sur le Forking)
it: `Remix VM - Custom fork` : biforca una catena ad un numero di blocco e in una versione EVM a tua scelta. (Vedere sotto per maggiori informazioni sulla biforcazione)

source: `Injected Provider - provider name`: Connects Remix to an injected web3 provider. The most common injected provider is `Metamask`.
es: `Proveedor inyectado - nombre del proveedor`: Conecta Remix a un proveedor web3 inyectado. El proveedor inyectado más común es `Metamask`.
fr: `Fournisseur injecté - nom du fournisseur` : Connecte Remix à un fournisseur web3 injecté. Le fournisseur injecté le plus courant est `Metamask`.
it: `Injected Provider - provider name`: connette Remix a un fornitore di web3 iniettato. Il fornitore iniettato più comune è `Metamask`.

source: `Custom - External HTTP Provider`: Remix will connect to a remote node. You will need to provide the URL to the selected provider: geth, parity or any Ethereum client. This was previously called **Web3 Provider**. (See below for more info about External HTTP Provider)
es: `Personalizado - Proveedor HTTP externo`: Remix se conectará a un nodo remoto. Deberá proporcionar la URL del proveedor seleccionado: geth, parity o cualquier cliente Ethereum. Anteriormente se denominaba **Proveedor Web3**. (Vea más abajo para más información sobre el Proveedor HTTP Externo)
fr: `Custom - External HTTP Provider` : Remix se connectera à un nœud distant. Vous devrez fournir l'URL du fournisseur sélectionné : geth, parity ou n'importe quel client Ethereum. Cette option était auparavant appelée **Web3 Provider**. (Voir ci-dessous pour plus d'informations sur External HTTP Provider)
it: `Custom - External HTTP Provider`: Remix si connetterà a un nodo remoto. È necessario fornire l'URL del fornitore selezionato: geth, parity o qualsiasi altro client Ethereum. In precedenza si chiamava **Fornitore Web3**. (Vedere sotto per maggiori informazioni sul Provider HTTP esterno)

source: `Dev - Hardhat Provider`: Connects Remix to a local Hardhat test chain.
es: `Dev - Proveedor de Hardhat`: Conecta Remix a una cadena de pruebas Hardhat local.
fr: `Dev - Hardhat Provider` : Connecte Remix à une chaîne de test Hardhat locale.
it: `Dev - Hardhat Provider`: connette Remix a una catena di test Hardhat locale.

source: `Dev - Ganache Provider`: Connects Remix to a local Truffle Ganache test chain.
es: `Dev - Proveedor de Ganache`: Conecta Remix a una cadena local de pruebas Truffle Ganache.
fr: `Dev - Ganache Provider` : Connecte Remix à une chaîne de test Truffle Ganache locale.
it: `Dev - Ganache Provider`: connette Remix a una catena di test Ganache di Truffle locale.

source: `Dev - Foundry Provider`: Connects Remix to a local Foundry Anvil test chain.
es: `Dev - Proveedor de Foundry`: Conecta Remix a una cadena de pruebas local de Foundry Anvil.
fr: `Dev - Foundry Provider` : Connecte Remix à une chaîne de test Foundry Anvil locale.
it: `Dev - Foundry Provider`: connette Remix a una catena di test Anvil di Foundry locale.

source: `L2 - Optimism Provider`: Connects Remix to an Injected Provider (usually Metamask) with the settings for the mainnet of Optimism.
es: `L2 - Proveedor de Optimismo`: Conecta Remix a un proveedor inyectado (normalmente Metamask) con la configuración para la red principal de Optimism.
fr: `L2 - Optimism Provider` : Connecte Remix à un fournisseur injecté (habituellement Metamask) avec les paramètres du réseau principal d'Optimism.
it: `L2 - Optimism Provider`: connette Remix a un fornitore iniettato (di solito Metamask) con le impostazioni per la rete principale di Optimism.

source: `L2 - Arbitrum One Provider`: Connects Remix to an Injected Provider (usually Metamask) with the settings for the Arbitrum One network.
es: `L2 - Proveedor Arbitrum One`: Conecta Remix a un proveedor inyectado (normalmente Metamask) con la configuración para la red Arbitrum One.
fr: `L2 - Fournisseur Arbitrum One` : Connecte Remix à un fournisseur injecté (habituellement Metamask) avec les paramètres du réseau Arbitrum One.
it: `L2 - Arbitrum One Provider`: connette Remix a un fornitore iniettato (di solito Metamask) con le impostazioni per la rete principale di Arbitrum One.

source: `WalletConnect`: Connects Remix to a wallet on a mobile device.
es: `WalletConnect`: Conecta Remix a un monedero en un dispositivo móvil.
fr: `WalletConnect` : Connecte Remix à un portefeuille sur un appareil mobile.
it: `WalletConnect`: connette Remix a un portafoglio su un dispositivo mobile.

source: Forking chains in Remix
es: Bifurcación de cadenas en Remix
fr: Chaînes de bifurcation dans Remix
it: Catene di biforcazione in Remix

source: Forking is a great technique for developing a contract that interacts with deployed contracts on a specific chain. By bringing in a chain to the Remix VM, you'll have the 10 accounts loaded with 100ETH.
es: La bifurcación es una gran técnica para desarrollar un contrato que interactúe con los contratos desplegados en una cadena específica. Al introducir una cadena en la Remix VM, tendrá las 10 cuentas cargadas con 100ETH.
fr: Le forçage est une excellente technique pour développer un contrat qui interagit avec les contrats déployés sur une chaîne spécifique. En apportant une chaîne à la VM Remix, vous aurez les 10 comptes chargés avec 100ETH.
it: La biforcazione (fork) è un'ottima tecnica per sviluppare un contratto che interagisce con i contratti distribuiti su una catena specifica. Portando una catena nella VM di Remix, avrete i 10 account caricati con 100ETH.

source: Careful though, if you refresh the browser, you’ll lose the forked chain.
es: Pero cuidado, si actualiza el navegador, perderá la cadena bifurcada.
fr: Attention cependant, si vous actualisez le navigateur, vous perdrez la chaîne bifurquée.
it: Attenzione però, se si aggiorna il browser, si perderà la catena biforcata.

source: Custom Fork
es: Horquilla a medida
fr: Fourche sur mesure
it: Biforcazione personalizzata

source: The Custom fork option allows you to specify a chain's RPC server, a block number, and an EVM version.
es: La opción de bifurcación personalizada le permite especificar el servidor RPC de una cadena, un número de bloque y una versión de EVM.
fr: L'option Custom fork vous permet de spécifier le serveur RPC d'une chaîne, un numéro de bloc et une version EVM.
it: L'opzione biforcazione personalizzata consente di specificare il server RPC di una catena, un numero di blocco e una versione EVM.

source: You can get the **Node URL** from chainlist.org. If the chain does not load, you may need to choose a different RPC server. You will also need to choose an EVM version appropriate to the block number. So, if you choose a very low block number, the EVM with the Merge “flavor” won’t work because this version of the EVM came out later.
es: Puede obtener la **URL del nodo** en chainlist.org. Si la cadena no se carga, es posible que tenga que elegir un servidor RPC diferente. También tendrá que elegir una versión de EVM adecuada al número de bloque. Así, si elige un número de bloque muy bajo, el EVM con el "sabor" Merge no funcionará porque esta versión del EVM salió más tarde.
fr: Vous pouvez obtenir l'**URL du nœud** à partir de chainlist.org. Si la chaîne ne se charge pas, vous devrez peut-être choisir un autre serveur RPC. Vous devrez également choisir une version d'EVM adaptée au numéro de bloc. Ainsi, si vous choisissez un numéro de bloc très bas, l'EVM avec la "saveur" Merge ne fonctionnera pas parce que cette version de l'EVM est sortie plus tard.
it: È possibile ottenere l' **URL del Nodo** da chainlist.org. Se la catena non viene caricata, potrebbe essere necessario scegliere un altro server RPC. È inoltre necessario scegliere una versione EVM appropriata al numero del blocco. Quindi, se si sceglie un numero di blocco molto basso, l'EVM con il "flavor" Merge non funzionerà perché questa versione dell'EVM è uscita più tardi.

source: More about External HTTP Provider
es: Más información sobre el proveedor HTTP externo
fr: En savoir plus sur le fournisseur HTTP externe
it: Ulteriori informazioni sul provider HTTP esterno

source: If you are using Geth & https://remix.ethereum.org, please use the following Geth command to allow requests from Remix:
es: Si utiliza Geth y https://remix.ethereum.org, utilice el siguiente comando de Geth para permitir las peticiones de Remix:
fr: Si vous utilisez Geth et https://remix.ethereum.org, veuillez utiliser la commande Geth suivante pour autoriser les requêtes provenant de Remix :
it: Se si utilizzano Geth e https://remix.ethereum.org, utilizzare il seguente comando Geth per consentire le richieste da Remix:

source: Also see [Geth Docs about the http server](https://geth.ethereum.org/docs/rpc/server)
es: Véase también [Docs de Geth sobre el servidor http](https://geth.ethereum.org/docs/rpc/server)
fr: Voir aussi [Geth Docs about the http server] (https://geth.ethereum.org/docs/rpc/server)
it: Si veda anche [Documenti Geth sul server http](https://geth.ethereum.org/docs/rpc/server)

source: To run Remix using https://remix.ethereum.org & a local test node, use this Geth command:
es: Para ejecutar Remix utilizando https://remix.ethereum.org y un nodo de prueba local, utilice este comando Geth:
fr: Pour exécuter Remix à l'aide de https://remix.ethereum.org et d'un nœud de test local, utilisez cette commande Geth :
it: Per eseguire Remix usando https://remix.ethereum.org e un nodo di prova locale, usare questo comando Geth:

source: If you are using remix-alpha or a local version of remix - replace the url of the --http.corsdomain with the url of Remix that you are using.
es: Si está utilizando remix-alpha o una versión local de remix - sustituya la url del --http.corsdomain por la url de Remix que esté utilizando.
fr: Si vous utilisez remix-alpha ou une version locale de remix, remplacez l'url de --http.corsdomain par l'url de Remix que vous utilisez.
it: Se si utilizza remix-alpha o una versione locale di remix - sostituire l'url di --http.corsdomain con l'url di Remix in uso.

source: To run Remix Desktop & a local test node, use this Geth command:
es: Para ejecutar Remix Desktop & un nodo de prueba local, utilice este comando Geth:
fr: Pour exécuter Remix Desktop et un nœud de test local, utilisez cette commande Geth :
it: Per eseguire Remix Desktop e un nodo di prova locale, utilizzate questo comando Geth:

source: Also see [Geth Docs on Dev mode](https://geth.ethereum.org/getting-started/dev-mode)
es: Consulte también [Geth Docs on Dev mode](https://geth.ethereum.org/getting-started/dev-mode)
fr: Voir aussi [Geth Docs on Dev mode] (https://geth.ethereum.org/getting-started/dev-mode)
it: Si veda anche [Documenti Geth in modalità Dev](https://geth.ethereum.org/getting-started/dev-mode)

source: The Web3 Provider Endpoint for a local node is **http://localhost:8545**
es: El punto final del proveedor Web3 para un nodo local es **http://localhost:8545**
fr: Le point de terminaison du fournisseur Web3 pour un nœud local est **http://localhost:8545**.
it: L'endpoint del provider Web3 per un nodo locale è **http://localhost:8545**

source: **WARNING:** Don't get lazy. It is a bad idea to use the Geth flag <b>--http.corsdomain</b> with a wildcard: `--http.corsdomain *`
es: **ADVERTENCIA:** No sea perezoso. Es una mala idea utilizar la bandera Geth <b>--http.corsdomain</b> con un comodín: `--http.corsdomain *`
fr: **AVERTISSEMENT:** Ne soyez pas paresseux. C'est une mauvaise idée d'utiliser le drapeau Geth <b>--http.corsdomain</b> avec un joker : `--http.corsdomain *`
it: **ATTENZIONE:** Non siate pigri. È una cattiva idea usare il flag di Geth <b>--http.corsdomain</b> con un carattere jolly: `--http.corsdomain *`

source: If you put the wildcard `*`, it means everyone can request the node. Whereas, if you put a URL, it restricts the urls to just that one - e.g. `--http.corsdomain 'https://remix-alpha.ethereum.org'`
es: Si pone el comodín `*`, significa que todo el mundo puede solicitar el nodo. Mientras que si pone una URL, restringe las urls sólo a esa - por ejemplo `--http.corsdomain 'https://remix-alpha.ethereum.org'`.
fr: Si vous mettez le joker `*`, cela signifie que tout le monde peut demander le noeud. Par contre, si vous mettez une URL, cela restreint les urls à cette seule URL - par exemple `--http.corsdomain 'https://remix-alpha.ethereum.org'`
it: Se si mette il carattere jolly `*`, significa che tutti possono richiedere il nodo. Invece, se si mette un URL, si restringe l'url solo a quello - ad esempio `--http.corsdomain 'https://remix-alpha.ethereum.org'`

source: Only use `--http.corsdomain *` when using a **test chain** AND using only **test accounts**. For real accounts or on the mainchain **specify the url**.
es: Sólo utilice `--http.corsdomain *` cuando utilice una **cadena de prueba** Y utilizando sólo **cuentas de prueba**. Para cuentas reales o en la cadena principal **especifique la url**.
fr: N'utilisez `--http.corsdomain *` que lorsque vous utilisez une **chaîne de test** ET que vous n'utilisez que des **comptes de test**. Pour les comptes réels ou sur la chaîne principale **spécifiez l'url**.
it: Utilizzare `--http.corsdomain *` solo quando si utilizza una **catena di prova** E si utilizzano solo **account di prova**. Per gli account reali o sulla catena principale **specificare l'url**.

source: Account:
es: Cuenta:
fr: Compte :

source: Account: the list of accounts associated with the current environment (and their associated balances). On the Remix VM, you have a choice of 5 accounts. If using Injected Web3 with MetaMask, you need to change the account in MetaMask.
es: Cuenta: la lista de cuentas asociadas al entorno actual (y sus saldos asociados). En la Remix VM, puede elegir entre 5 cuentas. Si utiliza Injected Web3 con MetaMask, deberá cambiar la cuenta en MetaMask.
fr: Compte : la liste des comptes associés à l'environnement actuel (et leurs soldes associés). Sur la VM Remix, vous avez le choix entre 5 comptes. Si vous utilisez Injected Web3 avec MetaMask, vous devez changer le compte dans MetaMask.
it: Account: la lista degli account associati all'ambiente corrente (e i relativi saldi). Nella macchina virtuale Remix è possibile scegliere tra 5 conti. Se si utilizza Web3 iniettato con MetaMask, è necessario modificare l'account in MetaMask.

source: Gas Limit:
es: Límite de gas:
fr: Limite de gaz :
it: Limite del Gas:

source: This sets the maximum amount of gas that will be allowed for all the transactions created in Remix.
es: Esto fija la cantidad máxima de gas que se permitirá para todas las transacciones creadas en Remix.
fr: Ceci définit la quantité maximale de gaz qui sera autorisée pour toutes les transactions créées dans Remix.
it: Questo imposta la quantità massima di gas consentita per tutte le transazioni create in Remix.

source: Value:
es: Valor:
fr: Valeur :
it: Valore:

source: This sets the amount of ETH, WEI, GWEI etc that is sent to a contract or a payable function. <br> **Note:** payable functions have a red button.
es: Establece la cantidad de ETH, WEI, GWEI, etc. que se envía a un contrato o a una función pagadera. <br> **Nota:** las funciones pagaderas tienen un botón rojo.
fr: Ceci définit le montant d'ETH, WEI, GWEI etc. qui est envoyé à un contrat ou à une fonction de paiement. <br> **Les fonctions payables ont un bouton rouge.
it: Questo imposta la quantità di ETH, WEI, GWEI ecc. che viene inviata a un contratto o a una funzione pagabile. <br> **Nota:** le funzioni pagabili hanno un pulsante rosso.

source: The **Value** field is always reset to 0 after each transaction execution. <br> The **Value** field is **NOT** for gas.
es: El campo **Valor** se pone siempre a 0 después de cada ejecución de transacción. <br> El campo **Valor** es **NO** para el gas.
fr: Le champ **Valeur** est toujours remis à 0 après l'exécution de chaque transaction. <br> Le champ **Valeur** est **NOT** pour le gaz.
it: Il campo **Value** (Valore) viene sempre resettato a 0 dopo l'esecuzione di ogni transazione. <br> Il campo **Value** **NON** è per il gas.

source: Deploy & AtAddress
es: Despliegue y AtAddress
fr: Déployer et AtAddress
it: Distribuzione e All'indirizzo
