Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run.po
Languages: es, fr, it

source: In the image above, the select box is set to **Ballot**. This select box will contain the list of compiled contracts.
es: En la imagen de arriba, el cuadro de selección está configurado como **Baloto**. Este cuadro de selección contendrá la lista de contratos compilados.
fr: Dans l'image ci-dessus, la boîte de sélection est définie sur **Ballot**. Cette boîte de sélection contient la liste des contrats compilés.
it: Nell'immagine sopra, la casella di selezione è impostata su **Ballot** (Votazione). Questa casella di selezione conterrà l'elenco dei contratti compilati.

source: `Deploy` sends a transaction that deploys the selected contract. When the transaction is mined, the newly created instance will be added (this might take several seconds). <br>**Note:** If the contract's constructor function has parameters, you need to specify them.
es: `Deploy` envía una transacción que despliega el contrato seleccionado. Cuando se extraiga la transacción, se añadirá la instancia recién creada (esto puede tardar varios segundos). <br>**Nota:** Si la función constructora del contrato tiene parámetros, deberá especificarlos.
fr: `Deploy` envoie une transaction qui déploie le contrat sélectionné. Lorsque la transaction est analysée, l'instance nouvellement créée est ajoutée (cela peut prendre plusieurs secondes). <br>**Note:** Si la fonction de construction du contrat a des paramètres, vous devez les spécifier.
it: `Deploy` (distribuisci) invia una transazione che distribuisce il contratto selezionato. Quando la transazione viene minata, l'istanza appena creata viene aggiunta (questo potrebbe richiedere alcuni secondi). <br> **Nota: ** Se la funzione costruttore del contratto ha dei parametri, è necessario specificarli.

source: `At Address` is used to access a contract that has already been deployed. Because the contract is already deployed, accessing a contract with **AtAddress** does not cost gas.
es: `At Address` se utiliza para acceder a un contrato que ya ha sido desplegado. Como el contrato ya está desplegado, acceder a un contrato con **AtAddress** no cuesta gas.
fr: `At Address` est utilisé pour accéder à un contrat qui a déjà été déployé. Comme le contrat est déjà déployé, l'accès à un contrat avec **AtAddress** ne coûte pas de gaz.
it: `At Address` (All'indirizzo) è usato per accedere ad un contratto che è già stato distribuito. Poiché il contratto è già distribuito, l'accesso a un contratto con **AtAddress** non costa gas.

source: **Note:** When using AtAddress, be sure you trust the contract at that address.
es: **Nota:** Cuando utilice AtAddress, asegúrese de que confía en el contrato de esa dirección.
fr: **Note:** Lorsque vous utilisez AtAddress, assurez-vous que vous avez confiance dans le contrat à cette adresse.
it: **Nota: ** Quando si utilizza AtAddress (All'indirizzo), assicurarsi di avere fiducia nel contratto a quell'indirizzo.

source: To use **AtAddress**, you need to have the **source code** or **ABI** of the deployed contract **in the active tab** of the editor. When using the source code, it must be compiled with the same compilation settings as the deployed contract that you are trying access.
es: Para utilizar **AtAddress**, necesita tener el **código fuente** o **ABI** del contrato desplegado **en la pestaña activa** del editor. Cuando utilice el código fuente, debe estar compilado con los mismos ajustes de compilación que el contrato desplegado al que está intentando acceder.
fr: Pour utiliser **AtAddress**, vous devez avoir le **code source** ou **ABI** du contrat déployé **dans l'onglet actif** de l'éditeur. Lorsque vous utilisez le code source, il doit être compilé avec les mêmes paramètres de compilation que le contrat déployé auquel vous essayez d'accéder.
it: Per utilizzare **AtAddress** (All'indirizzo), è necessario che il **codice sorgente** o **ABI** del contratto distribuito sia **nella scheda attiva** dell'editor. Quando si usa il codice sorgente, questo deve essere compilato con le stesse impostazioni di compilazione del contratto distribuito a cui si sta cercando di accedere.

source: Using the ABI with AtAddress
es: Uso de la ABI con AtAddress
fr: Utilisation de l'ABI avec AtAddress
it: Utilizzo dell'ABI con AtAddress (All'indirizzo)

source: The **ABI** is a JSON array which describes the contract's interface.
es: El **ABI** es una matriz JSON que describe la interfaz del contrato.
fr: Le **ABI** est un tableau JSON qui décrit l'interface du contrat.
it: L'**ABI** è un array JSON che descrive l'interfaccia del contratto.

source: To interact with a contract using the ABI, create a new file in Remix with extension ***.abi** and copy the ABI content to it.
es: Para interactuar con un contrato utilizando la ABI, cree un nuevo archivo en Remix con extensión ***.abi** y copie en él el contenido de la ABI.
fr: Pour interagir avec un contrat à l'aide de l'ABI, créez un nouveau fichier dans Remix avec l'extension ***.abi** et copiez-y le contenu de l'ABI.
it: Per interagire con un contratto utilizzando l'ABI, creare un nuovo file in Remix con estensione ***.abi** e copiare in esso il contenuto dell'ABI.

source: Make sure this file is the active tab in the editor. Then, in the field next to `At Address`, input the contract's address and click on `At Address`. If successful, an instance of the contract will appear below - in the list of **Deployed Contracts**.
es: Asegúrese de que este archivo es la pestaña activa en el editor. A continuación, en el campo situado junto a "En la dirección", introduzca la dirección del contrato y haga clic en "En la dirección". Si tiene éxito, aparecerá una instancia del contrato a continuación, en la lista de **Contratos desplegados**.
fr: Assurez-vous que ce fichier est l'onglet actif dans l'éditeur. Ensuite, dans le champ à côté de `At Address`, entrez l'adresse du contrat et cliquez sur `At Address`. Si vous réussissez, une instance du contrat apparaîtra ci-dessous - dans la liste des **Contrats déployés**.
it: Assicurarsi che questo file sia la scheda attiva nell'editor. Quindi, nel campo accanto a `At Address` (All'indirizzo), inserire l'indirizzo del contratto e cliccare su `At Address`. In caso di successo, un'istanza del contratto apparirà in basso - nell'elenco dei **Contratti distribuiti**.

source: **Note:** To generate the ABI, in the Solidity compiler, after a contract is compiled, click on the **Compilation Details** button. A modal will come up with that contains the ABI among other info.
es: **Nota:** Para generar la ABI, en el compilador Solidity, después de compilar un contrato, haga clic en el botón **Detalles de compilación**. Aparecerá un modal que contiene la ABI entre otra información.
fr: **Note:** Pour générer l'ABI, dans le compilateur Solidity, après la compilation d'un contrat, cliquez sur le bouton **Détails de compilation**. Une fenêtre modale contenant l'ABI parmi d'autres informations apparaîtra.
it: **Nota:** Per generare l'ABI, nel compilatore Solidity, dopo che un contratto è stato compilato, cliccare sul pulsante **Compilation Details**(Dettagli di compilazione). Verrà visualizzata una finestra contenente l'ABI e altre informazioni.

source: Pending Instances
es: Instancias pendientes
fr: Instances en attente
it: Istanze in corso

source: Validating a transaction takes several seconds. During this time, the GUI shows it in a pending mode. When the transaction is mined, the number of pending transactions is updated and the transaction is added to the log ([see terminal](terminal.html)).
es: La validación de una transacción tarda varios segundos. Durante este tiempo, la interfaz gráfica de usuario la muestra en modo pendiente. Cuando la transacción es minada, el número de transacciones pendientes se actualiza y la transacción se añade al registro ([ver terminal](terminal.html)).
fr: La validation d'une transaction prend plusieurs secondes. Pendant ce temps, l'interface graphique l'affiche en mode "pending" (en attente). Lorsque la transaction est traitée, le nombre de transactions en attente est mis à jour et la transaction est ajoutée au journal ([voir terminal](terminal.html)).
it: La convalida di una transazione richiede alcuni secondi. Durante questo tempo, la GUI la mostra in modalità pending (in corso). Quando la transazione viene minata, il numero di transazioni pending viene aggiornato e la transazione viene aggiunta al log ([vedi terminale](terminale.html)).

source: Using the Recorder
es: Uso de la grabadora
fr: Utilisation de l'enregistreur
it: Utilizzo del registratore

source: The Recorder is a tool used to save a bunch of transactions in a JSON file and re-run them later either in the same environment or in another.
es: El grabador es una herramienta que se utiliza para guardar un grupo de transacciones en un archivo JSON y volver a ejecutarlas más tarde, ya sea en el mismo entorno o en otro.
fr: L'enregistreur est un outil utilisé pour enregistrer un ensemble de transactions dans un fichier JSON et les réexécuter plus tard, soit dans le même environnement, soit dans un autre.
it: Il Recorder (Registratore) è uno strumento utilizzato per salvare un gruppo di transazioni in un file JSON e rieseguirle successivamente nello stesso ambiente o in un altro.

source: Saving to the JSON file ( by default its called scenario.json) allows one to easily check the transaction list, tweak input parameters, change linked library, etc...
es: Guardar en el archivo JSON (por defecto se llama scenario.json) permite comprobar fácilmente la lista de transacciones, ajustar los parámetros de entrada, cambiar la biblioteca vinculada, etc.
fr: L'enregistrement dans le fichier JSON (appelé par défaut scenario.json) permet de vérifier facilement la liste des transactions, d'ajuster les paramètres d'entrée, de changer la bibliothèque liée, etc...
it: Il salvataggio nel file JSON (che per impostazione predefinita è chiamato scenario.json) permette di verificare facilmente l'elenco delle transazioni, di modificare i parametri di input, di cambiare la libreria collegata, ecc...

source: There are many use cases for the recorder.
es: Hay muchos casos de uso para la grabadora.
fr: L'enregistreur peut être utilisé dans de nombreux cas.
it: Ci sono molti casi di utilizzo del registratore.

source: For instance:
es: Por ejemplo:
fr: Par exemple :
it: Per esempio:

source: After having coded and tested contracts in a constrained environment (like the Remix VM), you could then change the environment and redeploy it to a more realistic environment like a public testnet or to a Geth node. By using the generated **scenario.json** file, you will be using all the same settings that you used in the Remix VM. And this means that you won't need to click the interface 100 times or whatever to get the state that you achieved originally. So the recorder could be a tool to protect your sanity.
es: Después de haber codificado y probado los contratos en un entorno restringido (como la Remix VM), podría cambiar el entorno y volver a desplegarlo en un entorno más realista como una red de pruebas pública o en un nodo Geth. Al utilizar el archivo **scenario.json** generado, estará utilizando todos los mismos ajustes que utilizó en la Remix VM. Y esto significa que no necesitará hacer clic en la interfaz 100 veces o lo que sea para obtener el estado que consiguió originalmente. Así que la grabadora podría ser una herramienta para proteger su cordura.
fr: Après avoir codé et testé des contrats dans un environnement contraint (comme la VM Remix), vous pouvez changer l'environnement et le redéployer dans un environnement plus réaliste comme un réseau de test public ou un nœud Geth. En utilisant le fichier **scenario.json** généré, vous utiliserez tous les mêmes paramètres que ceux utilisés dans la VM Remix. Cela signifie que vous n'aurez pas besoin de cliquer sur l'interface 100 fois ou autre pour obtenir l'état que vous avez atteint à l'origine. L'enregistreur pourrait donc être un outil pour protéger votre santé mentale.
it: Dopo aver codificato e testato i contratti in un ambiente limitato (come la VM Remix), si può cambiare l'ambiente e distribuirlo nuovamente in un ambiente più realistico, come una testnet pubblica o un nodo Geth. Utilizzando il file **scenario.json** generato, si useranno tutte le stesse impostazioni utilizzate nella VM Remix. Ciò significa che non sarà necessario cliccare sull'interfaccia 100 volte o altro per ottenere lo stato ottenuto in origine. Quindi il registratore potrebbe essere uno strumento per proteggere la vostra sanità mentale.

source: You can also change the settings in the scenario.json file to customize the playback.
es: También puede cambiar los ajustes del archivo scenario.json para personalizar la reproducción.
fr: Vous pouvez également modifier les paramètres du fichier scenario.json pour personnaliser la lecture.
it: È inoltre possibile modificare le impostazioni nel file scenario.json per personalizzare la riproduzione.

source: Deploying contract does often require more than creating one transaction and so the recorder will automate this deployment.
es: El despliegue de un contrato suele requerir más que la creación de una transacción, por lo que el registrador automatizará este despliegue.
fr: Le déploiement d'un contrat nécessite souvent plus que la création d'une transaction et l'enregistreur automatise donc ce déploiement.
it: La distribuzione di un contratto richiede spesso più della creazione di una transazione, per cui il registratore automatizzerà questa distribuzione.

source: Working in a dev environment often requires setting up the state in a first place.
es: Trabajar en un entorno de desarrollo requiere a menudo establecer el estado en primer lugar.
fr: Pour travailler dans un environnement de développement, il faut souvent commencer par mettre en place l'état.
it: Lavorare in un ambiente di sviluppo spesso richiede di impostare lo stato in un primo momento.

source: When checked, the option `Run transactions using the last compilation result` allows you to develop a contract and easily set the state using **the latest compiled versions of the contracts.**
es: Cuando está marcada, la opción `Ejecutar transacciones utilizando el último resultado de compilación` le permite desarrollar un contrato y establecer fácilmente el estado utilizando **las últimas versiones compiladas de los contratos.**
fr: Lorsqu'elle est cochée, l'option `Exécuter les transactions en utilisant le dernier résultat de compilation` vous permet de développer un contrat et d'en définir facilement l'état en utilisant **les dernières versions compilées des contrats**.
it: Se selezionata, l'opzione `Run transactions using the last compilation result` (Esegui le transazioni usando l'ultimo risultato della compilazione) consente di sviluppare un contratto e di impostare facilmente lo stato usando **le ultime versioni compilate dei contratti**

source: scenario.json
es: escenario.json

source: To create this file in the recorder, you first of course need to have run some transactions. In the image above - it has a `0` next to **Transactions Recorded**. So this isn't the right moment to save transactions because - well because there aren't any. Each time you make a transaction, that number will increment. Then when you are ready, click the floppy disk icon and the scenario.json file will be created.
es: Para crear este archivo en el registrador, primero necesita, por supuesto, haber ejecutado algunas transacciones. En la imagen de arriba - tiene un `0` al lado de **Transacciones Registradas**. Así que este no es el momento adecuado para grabar transacciones porque - bueno porque no hay ninguna. Cada vez que realice una transacción, ese número se incrementará. Entonces, cuando esté listo, haga clic en el icono del disquete y se creará el archivo scenario.json.
fr: Pour créer ce fichier dans l'enregistreur, vous devez bien sûr avoir effectué quelques transactions. Dans l'image ci-dessus - il y a un `0` à côté de **Transactions enregistrées**. Ce n'est donc pas le bon moment pour enregistrer des transactions parce que - eh bien, parce qu'il n'y en a pas. Chaque fois que vous effectuez une transaction, ce nombre s'incrémente. Lorsque vous êtes prêt, cliquez sur l'icône de la disquette et le fichier scenario.json sera créé.
it: Per creare questo file nel registratore, ovviamente è necessario aver eseguito prima alcune transazioni. Nell'immagine sopra - c'è uno `0` accanto a **Transactions Recorded** (Transazioni registrate). Quindi questo non è il momento giusto per salvare le transazioni - perché non ce ne sono. Ogni volta che si effettua una transazione, il numero aumenterà. Quando si è pronti, fare cliccare sull'icona del floppy disk e il file scenario.json verrà creato.

source: The JSON file below is an example of the scenario.json file.
es: El siguiente archivo JSON es un ejemplo del archivo scenario.json.
fr: Le fichier JSON ci-dessous est un exemple du fichier scenario.json.
it: Il file JSON sotto è un esempio del file scenario.json.

source: In it, 3 transactions are executed:
es: En él se ejecutan 3 transacciones:
fr: Trois transactions y sont exécutées :
it: In esso, vengono eseguite 3 transazioni:

source: The first corresponds to the deployment of the lib `testLib`.
es: La primera corresponde al despliegue de la lib `testLib`.
fr: Le premier correspond au déploiement de la librairie `testLib`.
it: La prima corrisponde alla distribuzione della libreria `testLib`.

source: The second corresponds to the deployment of the contract `test` with the first parameter of the constructor set to 11. That contract depends on a library. The linkage is done using the property `linkReferences`. In that case we use the address of the previously created library : `created{1512830014773}`. The number is the id (timestamp) of the transaction that led to the creation of the library.
es: El segundo corresponde al despliegue del contrato `test` con el primer parámetro del constructor fijado en 11. Ese contrato depende de una biblioteca. La vinculación se realiza mediante la propiedad `linkReferences`. En ese caso utilizamos la dirección de la biblioteca creada previamente: `created{1512830014773}`. El número es el id (marca de tiempo) de la transacción que llevó a la creación de la biblioteca.
fr: Le second correspond au déploiement du contrat `test` dont le premier paramètre du constructeur est fixé à 11. Ce contrat dépend d'une bibliothèque. Le lien est fait en utilisant la propriété `linkReferences`. Dans ce cas, nous utilisons l'adresse de la bibliothèque précédemment créée : `created{1512830014773}`. Le numéro est l'identifiant (timestamp) de la transaction qui a conduit à la création de la bibliothèque.
it: La seconda corrisponde al deployment del contratto `test` con il primo parametro del costruttore impostato a 11. Questo contratto dipende da una libreria. Il collegamento è fatto usando la proprietà `linkReferences`. In questo caso si utilizza l'indirizzo della libreria precedentemente creata: `created{1512830014773}`. Il numero è l'id (timestamp) della transazione che ha portato alla creazione della libreria.

source: The third record corresponds to the call to the function `set` of the contract `test` (the property to is set to: `created{1512830015080}`) . Input parameters are `1` and `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`
es: El tercer registro corresponde a la llamada a la función `set` del contrato `test` (la propiedad to se establece en: `created{1512830015080}`) . Los parámetros de entrada son `1` y `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`.
fr: Le troisième enregistrement correspond à l'appel à la fonction `set` du contrat `test` (la propriété to est fixée à : `created{1512830015080}`). Les paramètres d'entrée sont `1` et `xca35b7d915458ef540ade6068dfe2f44e8fa733c`
it: Il terzo record corrisponde alla chiamata alla funzione `set` del contratto `test` (la proprietà a è impostata a: `created{1512830015080}`). I parametri di ingresso sono `1` e `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`

source: All these transactions are created using the value of the accounts `account{0}`.
es: Todas estas transacciones se crean utilizando el valor de la cuenta `account{0}`.
fr: Toutes ces transactions sont créées en utilisant la valeur des comptes `compte{0}`.
it: Tutte queste transazioni sono create utilizzando il valore dell'account `account{0}`.

source: ![](images/a-contract.png)
fr: ![](images/a-contrat.png)
