Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run_proxy_contracts.po
Languages: es, fr, it

source: Deploy & Run Proxy Contracts
es: Despliegue y ejecución de contratos proxy
fr: Déployer et exécuter des contrats proxy
it: Distribuisci & Esegui Contratti Proxy

source: Remix IDE has functionality to assist in the handeling of proxy contracts that use the UUPS pattern.
es: Remix IDE dispone de funcionalidades para ayudar en el manejo de contratos proxy que utilizan el patrón UUPS.
fr: Remix IDE dispose d'une fonctionnalité pour aider à la gestion des contrats proxy qui utilisent le modèle UUPS.
it: Remix IDE dispone di funzionalità che aiutano a gestire i contratti proxy che utilizzano lo schema UUPS.

source: A UUPS proxy contract is the implementation side of an [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).
es: Un contrato proxy UUPS es la parte de implementación de un [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).
fr: Un contrat proxy UUPS est le côté implémentation d'un [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).
it: Un contratto UUPS proxy è il lato di implementazione di un [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).

source: Once you have deployed a UUPS implementation contract, Remix will deploy a ERC1967 with your implementation contract's address.
es: Una vez que haya desplegado un contrato de implementación UUPS, Remix desplegará un ERC1967 con la dirección de su contrato de implementación.
fr: Une fois que vous avez déployé un contrat d'implémentation UUPS, Remix déploiera un ERC1967 avec l'adresse de votre contrat d'implémentation.
it: Una volta distribuito un contratto di implementazione UUPS, Remix distribuirà un ERC1967 con l'indirizzo del contratto di implementazione.

source: To interact with the functions in the **implementation contract**, use the deployed instance of the **ERC1967 instance** not on the implementation contract.
es: Para interactuar con las funciones del **contrato de implementación**, utilice la instancia desplegada de la instancia **ERC1967** que no se encuentra en el contrato de implementación.
fr: Pour interagir avec les fonctions du **contrat de mise en œuvre**, utilisez l'instance déployée de l'instance **ERC1967** qui ne figure pas dans le contrat de mise en œuvre.
it: Per interagire con le funzioni del **contratto di implementazione**, utilizza l'istanza distribuita dell'istanza **ERC1967** non presente nel contratto di implementazione.

source: When its time to upgrade you contract, Remix has a UI for this.
es: Cuando llega el momento de actualizar su contrato, Remix dispone de una interfaz de usuario para ello.
fr: Lorsqu'il est temps de mettre à jour votre contrat, Remix dispose d'une interface utilisateur pour cela.
it: Quando è il momento di aggiornare il tuo contratto, Remix ha un'interfaccia utente per questo.

source: To try this out, you will need to get a proxy contract. Go to wizard.openzeppelin.com and select a contract. Then, in the Upgradeability section, check the UUPS option. Then, copy and paste the file into Remix. Compile the file and go to Deploy & Run.
es: Para probarlo, deberá obtener un contrato proxy. Vaya a wizard.openzeppelin.com y seleccione un contrato. A continuación, en la sección Actualizabilidad, marque la opción UUPS. A continuación, copie y pegue el archivo en Remix. Compile el archivo y vaya a Desplegar y ejecutar.
fr: Pour l'essayer, vous devez obtenir un contrat de proxy. Rendez-vous sur wizard.openzeppelin.com et sélectionnez un contrat. Ensuite, dans la section Upgradeability, cochez l'option UUPS. Copiez et collez ensuite le fichier dans Remix. Compilez le fichier et allez dans Deploy & Run.
it: Per provarlo, è necessario ottenere un contratto proxy. Vai su wizard.openzeppelin.com e seleziona un contratto. Quindi, nella sezione Aggiornabilità, seleziona l'opzione UUPS. Poi, copia e incolla il file in Remix. Compila il file e vai su Distribuisci & Esegui.

source: Deploying
es: Desplegando
fr: Déploiement
it: Distribuzione

source: When a UUPS contract is selected in Deploy & Run's Contract select box, you'll see some checkboxes below the Deploy button:
es: Cuando se selecciona un contrato UUPS en el cuadro de selección de contratos de Despliegue y Ejecución, verá algunas casillas de verificación debajo del botón de Despliegue:
fr: Lorsqu'un contrat UUPS est sélectionné dans la boîte de sélection des contrats de Deploy & Run, vous verrez des cases à cocher sous le bouton Deploy :
it: Quando si seleziona un contratto UUPS nella casella di selezione dei contratti di Distribuisci & Esegui, si vedranno alcune caselle di controllo sotto il pulsante Distribuisci:

source: Check the box for **Deploy with Proxy**. This will create two transactions: one for the implementation (your contract) and the other for the ERC1967 proxy contract. You will get two modals to check through:
es: Marque la casilla de **Implementación con proxy**. Esto creará dos transacciones: una para la implementación (su contrato) y otra para el contrato proxy ERC1967. Obtendrá dos modales para comprobar:
fr: Cochez la case **Déployer avec Proxy**. Cela créera deux transactions : une pour l'implémentation (votre contrat) et l'autre pour le contrat proxy ERC1967. Vous obtiendrez deux fenêtres modales à parcourir :
it: Seleziona la casella **Distribuisci con Proxy**. Verranno create due transazioni: una per l'implementazione (il tuo contratto) e l'altra per il contratto proxy ERC1967. Si otterranno due modali da controllare:

source: and then
es: y luego
fr: et ensuite
it: e poi

source: If you are deploying to the **Remix VM**, these modals will appear one after the other. If you are connected to the mainnet or a public testnet, then the second modal will appear after the first transaction has gone through.
es: Si está desplegando en la **VM Remix**, estos modales aparecerán uno tras otro. Si está conectado a la red principal o a una red de prueba pública, el segundo modal aparecerá después de que se haya realizado la primera operación.
fr: Si vous effectuez un déploiement sur la **Remix VM**, ces fenêtres apparaîtront l'une après l'autre. Si vous êtes connecté au réseau principal ou à un réseau de test public, la deuxième fenêtre s'affichera une fois que la première transaction aura été effectuée.
it: Se si sta eseguendo la distribuzione sulla **Macchina Virtuale di Remix**, queste finestre compariranno una dopo l'altra. Se si è connessi alla rete principale o a una rete di prova pubblica, il secondo messaggio apparirà dopo che la prima transazione è stata eseguita.

source: After the ERC1967 proxy contract is deployed, in the Deployed Contracts section, you'll see two deployed instances.
es: Una vez desplegado el contrato proxy ERC1967, en la sección Contratos desplegados, verá dos instancias desplegadas.
fr: Une fois le contrat proxy ERC1967 déployé, dans la section Contrats déployés, vous verrez deux instances déployées.
it: Dopo che il contratto proxy ERC1967 è stato distribuito, nella sezione Contratti Distribuiti, si vedranno due istanze distribuite.

source: To interact with your implementation contract **DO NOT** use the instance of your contract. Instead, you should **use the ERC1967 Proxy**. The proxy will have all the functions of your implementation.
es: Para interactuar con su contrato de implementación **NO** utilice la instancia de su contrato. En su lugar, debe **utilizar el proxy ERC1967**. El proxy tendrá todas las funciones de su implementación.
fr: Pour interagir avec votre contrat de mise en œuvre, **N'UTILISEZ PAS** l'instance de votre contrat. Au lieu de cela, vous devez **utiliser le proxy ERC1967**. Le proxy disposera de toutes les fonctions de votre implémentation.
it: Per interagire con il proprio contratto di implementazione **NON** utilizzare l'istanza del proprio contratto. Si deve invece **usare il Proxy ERC1967**. Il proxy avrà tutte le funzioni della tua implementazione.

source: Upgrading
es: Actualización de
fr: Mise à niveau
it: Aggiornamento

source: To upgrade, check the Upgrade with Proxy box and dial down the caret to see the options:
es: Para actualizar, marque la casilla Actualizar con proxy y marque hacia abajo el signo de intercalación para ver las opciones:
fr: Pour effectuer la mise à niveau, cochez la case Mise à niveau avec proxy et descendez le curseur pour voir les options :
it: Per eseguire l'aggiornamento, seleziona la casella Aggiornamento con Proxy e trascina il cursore verso il basso per visualizzare le opzioni:

source: You'll either need to use the last deployed ERC1967 contract, or input the address of the ERC1967 contract that you want to use.
es: Deberá utilizar el último contrato ERC1967 desplegado o introducir la dirección del contrato ERC1967 que desee utilizar.
fr: Vous devrez soit utiliser le dernier contrat ERC1967 déployé, soit saisir l'adresse du contrat ERC1967 que vous souhaitez utiliser.
it: Dovrai usare l'ultimo contratto ERC1967 distribuito, oppure inserire l'indirizzo del contratto ERC1967 che vuoi utilizzare.
