Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/running_js_scripts.po
Languages: fr, it

source: Running Scripts
fr: Exécution de scripts
it: Eseguire Script

source: _JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions._
fr: JavaScript (JS) est un langage de programmation léger, interprété ou compilé en flux tendu, doté de fonctions de premier ordre.
it: JavaScript (JS) è un linguaggio di programmazione leggero, interpretato o compilato just-in-time con funzioni di prima classe

source: Remix IDE supports execution of JS scripts.
fr: Remix IDE supporte l'exécution de scripts JS.
it: Remix IDE supporta l'esecuzione di script JS.

source: Write & Run a script
fr: Écrire et exécuter un script
it: Scrivi & Esegui uno script

source: Create a file with `.js` extension and put your logic inside it. Once ready, there are two ways to run this script:
fr: Créez un fichier avec l'extension `.js` et mettez-y votre logique. Une fois prêt, il y a deux façons d'exécuter ce script :
it: Crea un file con estensione `.js` e metti la tua logica al suo interno. Una volta pronto, ci sono due modi per eseguire questo script:

source: Make the script the active file in the editor and run `remix.exeCurrent()` from Remix terminal
fr: Faites du script le fichier actif dans l'éditeur et exécutez `remix.exeCurrent()` depuis le terminal Remix.
it: Rendi lo script il file attivo nell'editor ed esegui `remix.exeCurrent()` dal terminale di Remix

source: Just right click on the script name in the `Files Explorers` plugin and click on the **Run** option. **ShortCut**: `Ctrl+Shift+S` when the script is displayed in the editor.
fr: Faites un clic droit sur le nom du script dans le plugin `Files Explorers` et cliquez sur l'option **Exécuter**. **Raccourci** : `Ctrl+Shift+S` lorsque le script est affiché dans l'éditeur.
it: È sufficiente fare clic con il pulsante destro del mouse sul nome dello script nel plugin `Esplora File` e fare clic sull'opzione **Esegui**. **Scorciatoia**: `Ctrl+Maiusc+S` quando lo script è visualizzato nell'editor.

source: Here is a sample script:
fr: Voici un exemple de script :
it: Ecco uno script di esempio:

source: Running it using one of options mentioned above will show result in Remix terminal
fr: Si vous l'exécutez en utilisant l'une des options mentionnées ci-dessus, le résultat s'affichera dans le terminal Remix.
it: Eseguirlo utilizzando una delle opzioni sopra menzionate mostrerà il risultato nel terminale di Remix

source: Why run JavaScript Scripts in Remix?
fr: Pourquoi exécuter des scripts JavaScript dans Remix ?
it: Perché eseguire script JavaScript in Remix?

source: To mimic how the front-end of your dapp will use web3.js or ethers.js
fr: Pour imiter la façon dont le front-end de votre application utilisera web3.js ou ethers.js
it: Per imitare il modo in cui il front-end della tua dapp utilizzerà web3.js o ethers.js

source: To quickly deploy and interact with a bunch of instances of a contract without going through the Remix GUI.
fr: Pour déployer et interagir rapidement avec plusieurs instances d'un contrat sans passer par l'interface graphique de Remix.
it: Per distribuire e interagire rapidamente con un gruppo di istanze di un contratto senza passare per la GUI di Remix.

source: To run some tests on a previous deployed contract.
fr: Pour effectuer des tests sur un contrat précédemment déployé.
it: Per eseguire alcuni test su un contratto distribuito in precedenza.

source: Script to deploy a contract
fr: Script de déploiement d'un contrat
it: Script per distribuire un contratto

source: Remix accepts async/await scripts to run [web3.js](https://web3js.readthedocs.io/) or [ethers.js](https://docs.ethers.io/) commands. The script needs to be wrapped in a self executing function.
fr: Remix accepte les scripts asynchrones/attendus pour exécuter les commandes [web3.js](https://web3js.readthedocs.io/) ou [ethers.js](https://docs.ethers.io/). Le script doit être enveloppé dans une fonction qui s'exécute elle-même.
it: Remix accetta script async/await per eseguire comandi [web3.js](https://web3js.readthedocs.io/) o [ethers.js](https://docs.ethers.io/). Lo script deve essere racchiuso in una funzione autoesecutiva.

source: Setup
fr: Mise en place
it: Configurazione

source: These scripts will need to access the contract's ABI. The ABI is located in the contract's metadata file. Make sure that this metadata file will be created by going to the **Settings** module and checking that the **Generate contract metadata** option is indeed **checked**.
fr: Ces scripts devront accéder à l'ABI du contrat. L'ABI se trouve dans le fichier de métadonnées du contrat. Assurez-vous que ce fichier de métadonnées sera créé en allant dans le module **Paramètres** et en vérifiant que l'option **Générer les métadonnées du contrat** est bien **cochée**.
it: Questi script dovranno accedere all'ABI del contratto. L'ABI si trova nel file dei metadati del contratto. Assicurarsi che questo file di metadati venga creato andando nel modulo **Impostazioni** e controllando che l'opzione **Genera metadati del contratto** sia effettivamente **selezionata**.

source: Compile a Solidity file - to generate the contract metadata.
fr: Compiler un fichier Solidity - pour générer les métadonnées du contrat.
it: Compila un file Solidity - per generare i metadati del contratto.

source: In the Deploy & Run plugin, choose the Environment.
fr: Dans le plugin Deploy & Run, choisissez l'environnement.
it: Nel plugin Distribuisci & Esegui, scegliere l'Ambiente.

source: Async/await scripts work on in all of the Environments: the Remix VM, Injected Provider (usually MetaMask), and External HTTP Provider.
fr: Les scripts Async/await fonctionnent dans tous les environnements : la VM Remix, le fournisseur injecté (généralement MetaMask) et le fournisseur HTTP externe.
it: Gli script Async/await funzionano in tutti gli ambienti: Macchina Virtuale di Remix, Injected Provider (di solito MetaMask) e Provider HTTP Esterno.

source: JS Scripts in the File Explorers
fr: Scripts JS dans l'explorateur de fichiers
it: Script JS negli Esplora File

source: In the **scripts** folder of a **workspace**, there are 2 example files: one using **web3.js** and the other using **ethers.js**.
fr: Dans le dossier **scripts** d'un **espace de travail**, il y a 2 fichiers d'exemple : l'un utilisant **web3.js** et l'autre utilisant **ethers.js**.
it: Nella cartella **scripts** di un **ambiente di lavoro**, ci sono 2 file di esempio: uno che usa **web3.js** e l'altro che usa **ethers.js**.

source: Compile a contract and run a script on the fly
fr: Compiler un contrat et exécuter un script à la volée
it: Compila un contratto ed esegui uno script al volo

source: It is often convenient when drafting a contract to run a script just after the compilation succeeded.
fr: Il est souvent pratique, lors de la rédaction d'un contrat, d'exécuter un script juste après que la compilation a réussi.
it: Spesso è conveniente, durante la stesura di un contratto, eseguire uno script subito dopo la compilazione.

source: That way one can quickly deploy and call several contracts in order to set them in a desired state for testing purpose.
fr: De cette manière, il est possible de déployer et d'appeler rapidement plusieurs contrats afin de les placer dans l'état souhaité à des fins de test.
it: In questo modo è possibile distribuire e richiamare rapidamente diversi contratti per impostarli nello stato desiderato a scopo di test.

source: Also if the script contains Mocha tests, those will also be run.
fr: Si le script contient des tests Mocha, ceux-ci seront également exécutés.
it: Inoltre, se lo script contiene dei test Mocha, verranno eseguiti anche quelli.

source: In order to do so, add the NatSpec tag `@custom:dev-run-script` to the contract followed by the absolute file path, like:
fr: Pour ce faire, ajoutez la balise NatSpec `@custom:dev-run-script` au contrat, suivie du chemin absolu du fichier, comme suit :
it: Per farlo, aggiungere il tag NatSpec `@custom:dev-run-script` al contratto seguito dal percorso assoluto del file, come ad esempio:

source: **ShortCut**: `Ctrl+Shift+S` , when editing a solidity file, will compile that file and then will run the script. In contrast, Ctrl+S will only start the compiling.
fr: **ShortCut** : Ctrl+Shift+S` , lors de l'édition d'un fichier solidity, compile ce fichier et exécute le script. En revanche, Ctrl+S ne fait que lancer la compilation.
it: **Scorciatoia**: `Ctrl+Shift+S`, quando si modifica un file di Solidity, compila il file e poi esegue lo script. Al contrario, Ctrl+S avvia solo la compilazione.

source: An Example Script
fr: Un exemple de script
it: Uno Script di Esempio

source: The example below deploys a solidity contract named **CustomERC20.sol**. This example is using the web3.js library. Ethers.js could also be used.
fr: L'exemple ci-dessous déploie un contrat Solidity nommé **CustomERC20.sol**. Cet exemple utilise la bibliothèque web3.js. Ethers.js peut également être utilisée.
it: L'esempio seguente distribuisce un contratto solidity denominato **CustomERC20.sol**. Questo esempio utilizza la libreria web3.js. È possibile utilizzare anche Ethers.js.

source: For more information about this example, please see: [running async/await scripts](https://medium.com/remix-ide/running-js-async-await-scripts-in-remix-ide-3115b5dd7687?source=friends_link&sk=04e650dfa65905fdab0ecd5b10513d41)
fr: Pour plus d'informations sur cet exemple, veuillez consulter : [exécution de scripts asynchrones/attendus] (https://medium.com/remix-ide/running-js-async-await-scripts-in-remix-ide-3115b5dd7687?source=friends_link&sk=04e650dfa65905fdab0ecd5b10513d41)
it: Per ulteriori informazioni su questo esempio, vedere: [esecuzione di script async/await](https://medium.com/remix-ide/running-js-async-await-scripts-in-remix-ide-3115b5dd7687?source=friends_link&sk=04e650dfa65905fdab0ecd5b10513d41)

source: For more script examples, please see [Frequently Asked Scripts](FAS.html).
fr: Pour plus d'exemples de scripts, veuillez consulter [Frequently Asked Scripts](FAS.html).
it: Per ulteriori esempi di script, vedere [Script Richiesti Frequentemente, in inglese "Frequently Asked Scripts"](FAS.html).

source: `require` in scripts at Remix
fr: `require` dans les scripts chez Remix
it: `require` negli script su Remix

source: `require` statement is supported in a limited manner for Remix supported modules with Remix Scripts.
fr: L'instruction `require` est supportée de manière limitée pour les modules supportés par Remix avec les Scripts Remix.
it: L'istruzione `require' è supportata in modo limitato per i moduli supportati da Remix con script Remix.

source: For now, modules supported by Remix are ethers, web3, swarmgw, chai, remix and hardhat only for hardhat.ethers object/plugin.
fr: Pour l'instant, les modules supportés par Remix sont ethers, web3, swarmgw, chai, remix et hardhat uniquement pour l'objet/plugin hardhat.ethers.
it: Per ora i moduli supportati da Remix sono ethers, web3, swarmgw, chai, remix e hardhat solo per l'oggetto/plugin hardhat.ethers.

source: For unsupported modules, this error `<module_name> module require is not supported by Remix IDE` will be shown.
fr: Pour les modules non supportés, cette erreur `<module_name> module require is not supported by Remix IDE` sera affichée.
it: Per i moduli non supportati, verrà mostrato l'errore `<module_name> il modulo richiesto non è supportato da Remix IDE`.
