Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/security.po
Languages: es, fr, it

source: Using Remix Safely
es: Utilizar Remix con seguridad
fr: Utiliser Remix en toute sécurité
it: Usare Remix in modo sicuro

source: It is dangerous to send transactions on contracts you don't understand (even if it's a get rich quick scheme that you've copied & pasted from a Discord DM or a youtube video and you really really want to get rich).
es: Es peligroso enviar transacciones sobre contratos que no entiende (incluso si se trata de un esquema para hacerse rico rápidamente que ha copiado y pegado de un DM de Discord o de un vídeo de youtube y realmente quiere hacerse rico).
fr: Il est dangereux d'envoyer des transactions sur des contrats que vous ne comprenez pas (même s'il s'agit d'un plan d'enrichissement rapide que vous avez copié et collé à partir d'un DM Discord ou d'une vidéo youtube et que vous voulez vraiment devenir riche).
it: È pericoloso inviare transazioni su contratti che non si comprendono (perfino se si tratta di uno schema per diventare ricchi velocemente che avete copiato e incollato da un DM di Discord o da un video di youtube e volete davvero diventare ricchi).

source: Check our [article](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797) on a current scam promoting "liquidity front runner bots".
es: Consulte nuestra página [article](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797) sobre una estafa actual que promueve los "robots de liquidez de primera línea".
fr: Consultez notre site [article](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797) sur une escroquerie actuelle promouvant les "liquidity front runner bots".
it: Consultate il nostro [articolo](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797) su una truffa attuale che promuove i "bot per liquiditità front runner".

source: Always check that you are loading Remix over HTTPS unless you have a specific reason for accessing it with HTTP (e.g. for using Remix locally or for a connection you trust).
es: Compruebe siempre que está cargando Remix a través de HTTPS a menos que tenga una razón específica para acceder con HTTP (por ejemplo, para utilizar Remix localmente o para una conexión en la que confía).
fr: Vérifiez toujours que vous chargez Remix via HTTPS, sauf si vous avez une raison particulière d'y accéder via HTTP (par exemple, pour utiliser Remix localement ou pour une connexion en laquelle vous avez confiance).
it: Controllate sempre di caricare Remix su HTTPS, a meno che non abbiate un motivo specifico per accedervi con HTTP (ad esempio, per usare Remix localmente o per una connessione di cui vi fidate).

source: Make sure all your imports include the **version number** otherwise you don't know what version of files you are getting and the builds are not reproducible.
es: Asegúrese de que todas sus importaciones incluyen el **número de versión**, de lo contrario no sabrá qué versión de archivos está obteniendo y las construcciones no serán reproducibles.
fr: Assurez-vous que tous vos imports incluent le **numéro de version** sinon vous ne savez pas quelle version de fichiers vous obtenez et les builds ne sont pas reproductibles.
it: Assicurarsi che tutti gli import includano il **numero di versione**, altrimenti non si sa quale versione dei file si sta utilizzando e quanto sviluppato non è riproducibile.

source: So **do not** use an import like this:<br> `import "@openzeppelin/contracts/token/ERC20/ERC20.sol";`
es: Así que **no** utilice una importación como ésta<br> `import "@openzeppelin/contratos/token/ERC20/ERC20.sol";`.
fr: Donc **n'utilisez pas** un import comme celui-ci :<br> `import "@openzeppelin/contrats/token/ERC20/ERC20.sol";`
it: Quindi **non** usare un import come questo: <br> `import "@openzeppelin/contracts/token/ERC20/ERC20.sol";`

source: Rather, **use one** like this:<br> `import "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`
es: Más bien, **utilice uno** como éste:<br> `importar "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`
fr: Au contraire, **utilisez-en un** comme ceci :<br> `import "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`
it: Piuttosto, **utilizzane uno** come questo: <br> `import "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`

source: When connecting a contract to an existing deployment, ensure that the thing you are connecting to is correct AND is the correct version.
es: Cuando conecte un contrato a una implantación existente, asegúrese de que lo que está conectando es correcto Y es la versión correcta.
fr: Lorsque vous connectez un contrat à un déploiement existant, assurez-vous que l'élément auquel vous vous connectez est correct ET qu'il s'agit de la bonne version.
it: Quando si collega un contratto a una distribuzione di contratto esistente, assicurarsi che la cosa a cui ci si collega sia corretta E che sia la versione corretta.

source: Always be sure to address or understand every warning.
es: Asegúrese siempre de atender o comprender todas las advertencias.
fr: Veillez toujours à prendre en compte ou à comprendre chaque avertissement.
it: Accertatevi sempre di aver preso in considerazione o di aver compreso tutti gli avvertimenti.

source: Remix is a subdomain of ethereum.org - so the only valid Remix urls are:
es: Remix es un subdominio de ethereum.org - por lo que las únicas urls Remix válidas son:
fr: Remix est un sous-domaine de ethereum.org - les seules urls Remix valides sont donc :
it: Remix è un sottodominio di ethereum.org - quindi gli unici url validi di Remix sono:

source: If you are directed to some site that looks like Remix but has a **similar but different URL** - it is NOT Remix and is likely a scam.
es: Si le dirigen a algún sitio que se parece a Remix pero tiene una URL **similar pero diferente** - NO es Remix y es probable que sea una estafa.
fr: Si vous êtes dirigé vers un site qui ressemble à Remix mais dont l'URL est **similaire mais différente**, il ne s'agit PAS de Remix et il est probable qu'il s'agisse d'une escroquerie.
it: Se venite indirizzati a un sito che sembra Remix ma ha un URL **simile ma diverso**, NON è Remix e probabilmente è una truffa.

source: Remix's ease makes its users a target
es: La facilidad de Remix convierte a sus usuarios en un objetivo
fr: La facilité de Remix fait de ses utilisateurs une cible
it: La facilità di Remix rende i suoi utenti un obiettivo

source: Because Remix has no setup, it has a large community of noobies to smart contract development. This is great, but it provides a target audience for scammers exploit. Without Remix, the scammers would first need to instruct victims to set up a local dev environment, which would severely limit the success rate of the scam.
es: Como Remix no tiene configuración, cuenta con una gran comunidad de novatos en el desarrollo de contratos inteligentes. Esto es estupendo, pero proporciona un público objetivo que los estafadores pueden explotar. Sin Remix, los estafadores tendrían que instruir primero a las víctimas para que configuren un entorno de desarrollo local, lo que limitaría mucho la tasa de éxito de la estafa.
fr: Parce que Remix n'a pas d'installation, il a une grande communauté de novices dans le développement de contrats intelligents. C'est une bonne chose, mais cela constitue un public cible que les escrocs peuvent exploiter. Sans Remix, les escrocs devraient d'abord demander aux victimes de mettre en place un environnement de développement local, ce qui limiterait considérablement le taux de réussite de l'escroquerie.
it: Poiché Remix non ha alcun setup, ha un'ampia community di principianti nello sviluppo di contratti intelligenti. Questo è fantastico, ma fornisce un bersaglio da sfruttare per i truffatori. Senza Remix, i truffatori dovrebbero prima istruire le vittime a creare un ambiente di sviluppo locale, il che limiterebbe notevolmente il tasso di successo della truffa.

source: **Scams lose their effectiveness when potential victims are educated about scams and about how to read and understand code. Learn Solidity and learn it well!**
es: **Las estafas pierden su eficacia cuando se educa a las víctimas potenciales sobre las estafas y sobre cómo leer y entender el código. Aprenda Solidity y apréndalo bien!**
fr: **Les escroqueries perdent leur efficacité lorsque les victimes potentielles sont informées sur les escroqueries et sur la manière de lire et de comprendre le code. Apprenez Solidity et apprenez-le bien !
it: **Le truffe perdono la loro efficacia quando le potenziali vittime sono istruite sulle truffe e su come leggere e comprendere il codice. Studiate Solidity e studiatelo bene!**

source: For Solidity Tutorials in Remix, go to the LearnEth plugin.
es: Para obtener tutoriales de Solidity en Remix, vaya al plugin LearnEth.
fr: Pour les tutoriels Solidity dans Remix, allez sur le plugin LearnEth.
it: Per le esercitazioni di Solidity in Remix, andare al plugin LearnEth.
