Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/settings.po
Languages: es, fr, it

source: Settings
es: Ajustes
fr: Paramètres
it: Impostazioni

source: To get to **Settings** click the gear at the very bottom of the icon panel.
es: Para llegar a **Configuración** haga clic en el engranaje situado en la parte inferior del panel de iconos.
fr: Pour accéder aux **Réglages**, cliquez sur la roue dentée située tout en bas du panneau d'icônes.
it: Per accedere alle **Impostazioni** clicca sull'ingranaggio in fondo al pannello delle icone.

source: Reset Button
es: Botón de reinicio
fr: Bouton de réinitialisation
it: Pulsante di reset

source: The Reset button at the top of the Setting panel will reset all of the settings back to the default.
es: El botón Restablecer situado en la parte superior del panel Configuración restablecerá todos los ajustes a los valores predeterminados.
fr: Le bouton Réinitialiser situé en haut du panneau de configuration permet de réinitialiser tous les paramètres par défaut.
it: Il pulsante Resetta nella parte superiore del pannello delle Impostazioni ripristina tutte le impostazioni predefinite.

source: General Settings
es: Ajustes generales
fr: Paramètres généraux
it: Impostazioni generali

source: Generate contract metadata is used for deploying with libraries. See our blog post on the subject: [Deploying with Libraries](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730)
es: Generar metadatos de contrato se utiliza para el despliegue con bibliotecas. Consulte nuestra entrada de blog sobre el tema: [Deploying with Libraries](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730)
fr: Générer des métadonnées de contrat est utilisé pour le déploiement avec des bibliothèques. Consultez notre article de blog sur le sujet : [Deploying with Libraries](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730)
it: I metadati dei contratti generati vengono utilizzati per la distribuzione con le librerie. Visita il post con oggetto: [Distribuire con le librerie](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730) nel nostro blog

source: Always use Remix VM at Load: will make the Remix VM the selected **environment** when Remix loads.
es: Utilizar siempre Remix VM al cargar: hará que Remix VM sea el **entorno** seleccionado cuando se cargue Remix.
fr: Toujours utiliser la VM Remix au chargement : fera de la VM Remix l'**environnement** sélectionné lors du chargement de Remix.
it: Usa sempre Remix VM durante il caricamento: renderà Remix VM l'**ambiente** selezionato al caricamento di Remix.

source: Text wrap: controls if the text in the editor should be wrapped.
es: Ajuste de texto: controla si el texto en el editor debe ser ajustado.
fr: Enveloppe du texte : permet de contrôler si le texte dans l'éditeur doit être enveloppé.
it: Testo a capo: controlla se il testo nell'editor deve essere mandato a capo automaticamente.

source: Personal mode: can be used when one is connecting to a **local node**. It is used to have Remix temporarily save the passphrase - so that you don't need to **unlock** the account in GETH. Remix will not persist the passphrase - so if you refresh your browser the passphrase will be gone.
es: Modo personal: puede utilizarse cuando uno se está conectando a un **nodo local**. Se utiliza para que Remix guarde temporalmente la frase de contraseña - de forma que no sea necesario **desbloquear** la cuenta en GETH. Remix no persistirá la frase de contraseña - por lo que si actualiza su navegador la frase de contraseña habrá desaparecido.
fr: Mode personnel : peut être utilisé lorsque l'on se connecte à un **nœud local**. Il est utilisé pour que Remix enregistre temporairement la phrase de passe - de sorte que vous n'ayez pas besoin de **débloquer** le compte dans GETH. Remix ne conservera pas la phrase d'authentification - donc si vous rafraîchissez votre navigateur, la phrase d'authentification disparaîtra.
it: Modalità personale: può essere utilizzata quando ci si connette a un **nodo locale**. Viene usato per far sì che Remix salvi temporaneamente la frase segreta - in modo da non dover **sbloccare** l'account in GETH. Remix non preserverà la frase segreta, quindi se si aggiorna il browser la frase segreta sparirà.

source: Matomo Analytics: This is where you can turn off and on your approval for us to use Matomo. We do not collect any personally identifiable information (PII) and our reports are public. See our [blog post on the subject](https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).
es: Matomo Analytics: Aquí es donde puede activar y desactivar su aprobación para que utilicemos Matomo. No recogemos ninguna información personal identificable (IPI) y nuestros informes son públicos. Consulte nuestra [entrada de blog sobre el tema](https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).
fr: Matomo Analytics : C'est ici que vous pouvez désactiver ou activer votre autorisation d'utiliser Matomo. Nous ne collectons aucune information personnelle identifiable (PII) et nos rapports sont publics. Consultez notre [article de blog sur le sujet] (https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).
it: Matomo Analytics: qui è dove è possibile disattivare ed attivare l'autorizzazione all'uso di Matomo. Non raccogliamo nessuna informazione di identificazione personale (PII) e i nostri rapporti sono pubblici. Visita il nostro [post del blog sull'argomento] (https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).

source: Github Access Token
es: Token de acceso a Github
fr: Jeton d'accès Github
it: Token di accesso a Github

source: When performing Git operations on Github and when creating GISTs, it may be necessary to input an access token. This token has the specific permissions for your Git commands. Depending on the operation, you may also need to input your Github username & email address. Remix does not save your password info outside of your browser's localstorage. [https://github.com/settings/tokens](https://github.com/settings/tokens)
es: Al realizar operaciones Git en Github y al crear GISTs, puede ser necesario introducir un token de acceso. Este token tiene los permisos específicos para sus comandos Git. Dependiendo de la operación, puede que también necesite introducir su nombre de usuario y dirección de correo electrónico de Github. Remix no guarda la información de su contraseña fuera del almacenamiento local de su navegador. [https://github.com/settings/tokens](https://github.com/settings/tokens)
fr: Lorsque vous effectuez des opérations Git sur Github et que vous créez des GIST, il peut être nécessaire de saisir un jeton d'accès. Ce jeton possède les permissions spécifiques pour vos commandes Git. En fonction de l'opération, vous pouvez également avoir besoin d'entrer votre nom d'utilisateur Github et votre adresse e-mail. Remix n'enregistre pas votre mot de passe en dehors du stockage local de votre navigateur. [https://github.com/settings/tokens](https://github.com/settings/tokens)
it: Quando si eseguono operazioni Git su Github e si creano GIST, potrebbe essere necessario inserire un token di accesso. Questo token ha i permessi specifici per i tuoi comandi Git. A seconda dell'operazione, potrebbe essere necessario inserire anche il tuo nome utente e l'indirizzo e-mail di Github. Remix non salva la tua password al di fuori della memoria locale del tuo browser. [https://github.com/settings/tokens](https://github.com/settings/tokens)

source: Etherscan Access Token
es: Token de acceso Etherscan
fr: Jeton d'accès Etherscan
it: Token di accesso a Etherscan

source: You need to input your Etherscan access token when debugging verified contracts with the Remix Debugger. When verifying a contract with the Etherscan plugin, you need to put the API key in that plugin and not in the Settings panel.
es: Necesita introducir su token de acceso a Etherscan cuando depure contratos verificados con el depurador Remix. Cuando verifique un contrato con el plugin Etherscan, necesita poner la clave API en ese plugin y no en el panel de Configuración.
fr: Vous devez saisir votre clé d'accès Etherscan lorsque vous déboguez des contrats vérifiés avec le Remix Debugger. Lorsque vous vérifiez un contrat avec le plugin Etherscan, vous devez entrer la clé API dans ce plugin et non dans le panneau Settings.
it: Quando si esegue il debug dei contratti verificati con il Debugger di Remix, è necessario inserire il token di accesso a Etherscan. Quando si verifica un contratto con il plugin di Etherscan, è necessario inserire la chiave API nel plugin e non nel pannello delle impostazioni.

source: Click [here](https://etherscan.io/myapikey) to get your Etherscan API key.
es: Haga clic en [here](https://etherscan.io/myapikey) para obtener su clave API Etherscan.
fr: Cliquez sur [here](https://etherscan.io/myapikey) pour obtenir votre clé d'API Etherscan.
it: Clicca [here] (https://etherscan.io/myapikey) per ricevere la chiave API di Etherscan.

source: Swarm Settings
es: Configuración del enjambre
fr: Paramètres de l'essaim
it: Impostazioni di Swarm

source: In the Solidity Compiler, after the compilation is completed, there is a button to publish to Swarm.
es: En el compilador de Solidity, una vez finalizada la compilación, hay un botón para publicar en Swarm.
fr: Dans le Solidity Compiler, une fois la compilation terminée, il y a un bouton pour publier sur Swarm.
it: Nel compilatore Solidity, al termine della compilazione, c'è un pulsante per pubblicare su Swarm.

source: Without putting in an address & postage stamp, you'll be using the public gateway, which may not persist you content as surely as if you put in your own info.
es: Si no pone una dirección y un sello de correos, estará utilizando el portal público, que puede no perseguirle el contenido con tanta seguridad como si pusiera su propia información.
fr: Si vous n'indiquez pas d'adresse ni de timbre-poste, vous utiliserez la passerelle publique, qui risque de ne pas vous offrir un contenu aussi sûr que si vous indiquiez vos propres informations.
it: Senza inserire un indirizzo & timbro postale, utilizzerai il gateway pubblico, il quale potrebbe non mantenere il tuo contenuto tanto quanto se lo mettessi nelle tue informazioni.

source: IPFS Settings
es: Ajustes IPFS
fr: Paramètres IPFS
it: Impostazioni IPFS

source: Just like the Swarm settings above, IPFS settings are for publishing your contracts to IPFS from the Solidity Compiler.
es: Al igual que los ajustes de Swarm anteriores, los ajustes de IPFS sirven para publicar sus contratos en IPFS desde Solidity Compiler.
fr: Tout comme les paramètres Swarm ci-dessus, les paramètres IPFS permettent de publier vos contrats sur IPFS depuis le Solidity Compiler.
it: Proprio come le impostazioni di Swarm, le impostazioni IPFS servono per pubblicare i contratti su IPFS dal compilatore Solidity.

source: If you do not put in any settings here, you will be using the public INFURA node. This will not guarantee your data will persist.
es: Si no introduce ninguna configuración aquí, utilizará el nodo público INFURA. Esto no garantizará que sus datos persistan.
fr: Si vous n'indiquez aucun paramètre ici, vous utiliserez le nœud public INFURA. Cela ne garantit pas la persistance de vos données.
it: Se qui non si inserisce nessuna impostazione, si utilizzerà il nodo pubblico di INFURA. Questo non garantisce la persistenza dei dati.

source: Other options are to:
es: Otras opciones son
fr: D'autres options s'offrent à vous :
it: Altre opzioni sono:

source: Use your own INFURA IPFS node. This requires a subscription. [Learn more](https://infura.io/product/ipfs)
es: Utilice su propio nodo INFURA IPFS. Esto requiere una suscripción. [Más información](https://infura.io/product/ipfs)
fr: Utilisez votre propre nœud INFURA IPFS. Ceci nécessite un abonnement. [En savoir plus] (https://infura.io/product/ipfs)
it: Utilizzare il proprio nodo IPFS di INFURA. Questo richiede un'iscrizione. [Per saperne di più](https://infura.io/product/ipfs)

source: Use any external IPFS which doesn’t require any authentification.
es: Utilice cualquier IPFS externo que no requiera autentificación.
fr: Utilisez n'importe quel IPFS externe qui ne nécessite pas d'authentification.
it: Utilizzare qualsiasi IPFS esterno che non richieda alcuna autenticazione.

source: Use your own local ipfs node (which usually runs under http://localhost:5001)
es: Utilice su propio nodo local ipfs (que normalmente se ejecuta bajo http://localhost:5001)
fr: Utilisez votre propre nœud ipfs local (qui tourne généralement sous http://localhost:5001).
it: Usare il proprio nodo ipfs locale (che di solito viene eseguito con http://localhost:5001)

source: Themes
es: Temas
fr: Thèmes
it: Temi

source: Choose themes here. The Dark & Light themes are the themes that the Remix team actively maintains.
es: Elija los temas aquí. Los temas Oscuro y Claro son los temas que el equipo Remix mantiene activamente.
fr: Choisissez les thèmes ici. Les thèmes Dark & Light sont les thèmes que l'équipe Remix maintient activement.
it: Scegliere i temi qui. I temi Scuro e Chiaro sono i temi che il team di Remix mantiene attivamente.
