Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/solidity_editor.po
Languages: es, it

source: Remix uses the Monaco editor. This is the same editor used by VSCode.
es: Remix utiliza el editor Monaco. Es el mismo editor que utiliza VSCode.
it: Remix utilizza l'editor Monaco. È lo stesso editor utilizzato da VSCode.

source: Remix saves the current file every 5 seconds.
es: Remix guarda el archivo actual cada 5 segundos.
it: Remix salva il file corrente ogni 5 secondi.

source: The Remix Editor will highlight keywords in Soldiity, JS, and TS.
es: El Editor Remix resaltará las palabras clave en Soldiity, JS y TS.
it: L'editor Remix evidenzierà le parole chiave in Soldiity, JS e TS.

source: Editor displays information from other plugins
es: El editor muestra información de otros plugins
it: L'editor mostra informazioni da altri plugin

source: The main purpose of the Editor is, of course, to edit code. But it also works with other plugins, notably, the Soldity Compiler and the Debugger.
es: El propósito principal del Editor es, por supuesto, editar código. Pero también funciona con otros plugins, en particular, el Compilador Soldity y el Depurador.
it: Lo scopo principale dell'Editor è, ovviamente, quello di modificare il codice. Ma funziona anche con altri plugin, in particolare con il compilatore Soldity e il debugger.

source: The Solidity Compiler will display warnings and errors in the Editor's gutter at the problematic line.
es: El compilador de Solidity mostrará advertencias y errores en el medianil del editor en la línea problemática.
it: Il compilatore Solidity visualizzerà gli avvertimenti e gli errori nel riquadro dell'editor in corrispondenza della riga problematica.

source: Breakpoints for the Debugger are input in the Editor's gutter.
es: Los puntos de interrupción para el depurador se introducen en el canalón del editor.
it: I punti di interruzione per il Debugger vengono inseriti nel riquadro dell'editor.

source: When stepping through code in the Debugger, the relevant code will be highlighted in the Editor.
es: Al recorrer el código en el depurador, el código relevante aparecerá resaltado en el editor.
it: Quando si scorre il codice nel Debugger, il codice pertinente viene evidenziato nell'Editor.

source: General Operations
es: Operaciones generales
it: Operazioni Generali

source: Files are open as tabs. When there are too many tabs to display, scrolling with a mouse wheel will horizontally scroll the tabs.
es: Los archivos se abren como pestañas. Cuando haya demasiadas pestañas para mostrar, el desplazamiento con la rueda del ratón desplazará horizontalmente las pestañas.
it: I file vengono aperti come schede. Quando ci sono troppe schede da visualizzare, lo scorrimento con la rotella del mouse fa scorrere orizzontalmente le schede.

source: The Play button works on the active tab. If a Solidity file is active, clicking Play will compile it. If a TS or JS file is active, Play will run the script.
es: El botón Reproducir funciona en la ficha activa. Si un archivo Solidity está activo, al hacer clic en Reproducir se compilará. Si un archivo TS o JS está activo, Play ejecutará el script.
it: Il pulsante Riproduci funziona sulla scheda attiva. Se è attivo un file Solidity, facendo clic su Play lo si compila. Se è attivo un file TS o JS, Play eseguirà lo script.

source: The magnifying glass icons (+/-) on the top left corner are to increase/decrease the font size.
es: Los iconos de lupa (+/-) de la esquina superior izquierda sirven para aumentar/disminuir el tamaño de la letra.
it: Le icone a forma di lente d'ingrandimento (+/-) nell'angolo in alto a sinistra servono ad aumentare/diminuire la dimensione dei caratteri.

source: The small type on the far right of the Editor is clickable to jump to a section.
es: Se puede hacer clic en la letra pequeña del extremo derecho del Editor para saltar a una sección.
it: Il carattere piccolo all'estrema destra dell'editor è cliccabile per passare a una sezione.

source: The Editor and Script Runner support TypeScript, which means that you can write TypeScript, have some auto-completion, and run it straight from Remix. As stated above, there is syntax highlighting in TS.
es: El Editor y el Script Runner soportan TypeScript, lo que significa que puede escribir TypeScript, tener autocompletado y ejecutarlo directamente desde Remix. Como se dijo anteriormente, hay resaltado de sintaxis en TS.
it: L'editor e lo script runner supportano TypeScript, il che significa che è possibile scrivere TypeScript, avere un completamento automatico ed eseguirlo direttamente da Remix. Come già detto, in TS è presente l'evidenziazione della sintassi.

source: The default Workspace contains example TypeScript files.
es: El espacio de trabajo predeterminado contiene archivos TypeScript de ejemplo.
it: L'area di lavoro predefinita contiene file TypeScript di esempio.

source: Editor & Autocompile
es: Editor y autocompilación
it: Editor & Compilazione Automatica

source: When autocompile is enabled (in the Settings panel), compilation will occur each time the current file is changed, or another file is selected.
es: Cuando la compilación automática está activada (en el panel Configuración), la compilación se producirá cada vez que se modifique el archivo actual o se seleccione otro archivo.
it: Quando la compilazione automatica è attivata (nel pannello Impostazioni), la compilazione avverrà ogni volta che il file corrente viene modificato o viene selezionato un altro file.

source: Autocomplete
es: Autocompletar
it: Completamento automatico

source: Autocompleting Solidity code happens when you start typing in the Editor. The Compiler will run in the background, and process any imports you have. You will see these imports appear in the .deps directory in the File Explorer.
es: El autocompletado del código Solidity ocurre cuando usted comienza a escribir en el Editor. El Compilador se ejecutará en segundo plano y procesará las importaciones que tenga. Verá que estas importaciones aparecen en el directorio .deps en el Explorador de archivos.
it: Il completamento automatico del codice Solidity avviene quando si inizia a digitare nell'editor. Il compilatore viene eseguito in background ed elabora tutte le importazioni presenti. Queste importazioni appariranno nella cartella .deps nell'Esplora File.

source: **Tip:** If you start with a Solidity file that contains errors, the Compiler might not be able to compile it. In that case, the Editor's autocomplete features will not fully work until after the file is successfully compiled. After that, autocomplete will work even if there are errors, but only for the elements the Compiler already understands. For example, if you add a new function in a file that contains errors, autocomplete will not be able to find that function because it can’t compile the file.
es: **Consejo:** Si comienza con un archivo Solidity que contiene errores, es posible que el compilador no pueda compilarlo. En ese caso, las funciones de autocompletar del Editor no funcionarán completamente hasta que el archivo se haya compilado correctamente. Después de eso, autocompletar funcionará aunque haya errores, pero sólo para los elementos que el Compilador ya entienda. Por ejemplo, si añade una nueva función en un archivo que contiene errores, autocompletar no podrá encontrar esa función porque no puede compilar el archivo.
it: **Consiglio:** Se si inizia con un file Solidity che contiene errori, il compilatore potrebbe non essere in grado di compilarlo. In questo caso, le funzioni di completamento automatico dell'editor non funzioneranno in modo completo fino a quando il file non sarà compilato correttamente. In seguito, il completamento automatico funzionerà anche in presenza di errori, ma solo per gli elementi già compresi dal compilatore. Ad esempio, se si aggiunge una nuova funzione in un file che contiene errori, il completamento automatico non sarà in grado di trovare quella funzione perché non può compilare il file.

source: Auto complete on imports
es: Autocompletar en las importaciones
it: Completamento automatico sulle importazioni

source: The Editor's autocomplete will offer the option to bring in OpenZeppelin contracts, Uniswap contracts, and the paths to all the files in the current Workspace.
es: La función de autocompletar del editor le ofrecerá la opción de introducir los contratos OpenZeppelin, los contratos Uniswap y las rutas de todos los archivos del espacio de trabajo actual.
it: Il completamento automatico dell'editor offrirà l'opzione di inserire i contratti OpenZeppelin, i contratti Uniswap e i percorsi di tutti i file nell'area di lavoro corrente.

source: So, when choosing @openzeppelin, you’ll get this:
es: Así, al elegir @openzeppelin, obtendrá lo siguiente:
it: Quindi, scegliendo @openzeppelin, si otterrà questo:

source: And the same with Uniswap:
es: Y lo mismo con Uniswap:
it: E lo stesso vale per Uniswap:

source: Errors and Warnings
es: Errores y advertencias
it: Errori e Avvisi

source: You can tell the file was successfully compiled if no errors or warnings are displayed in the Editor. Errors are displayed using squiggly lines. A red line indicates an error, a yellow line is a warning.
es: Puede saber que el archivo se compiló correctamente si no aparecen errores ni advertencias en el Editor. Los errores se muestran mediante líneas garabateadas. Una línea roja indica un error, una línea amarilla es una advertencia.
it: Si può dire che la compilazione del file è avvenuta correttamente se nell'editor non vengono visualizzati errori o avvertimenti. Gli errori vengono visualizzati con linee ondulate. Una linea rossa indica un errore, una linea gialla un avvertimento.

source: Hovering over the squiggly line shows you the message from the Compiler.
es: Si pasa el ratón por encima de la línea garabateada, verá el mensaje del compilador.
it: Passando il mouse sulla linea ondulata si visualizza il messaggio del compilatore.

source: Tabs and the File Explorer will also will also display whether a file contains errors or warnings.
es: Las pestañas y el Explorador de archivos también mostrarán si un archivo contiene errores o advertencias.
it: Le schede e l'Esplora File mostrano anche se un file contiene errori o avvertimenti.

source: Errors on Imported Files
es: Errores en los archivos importados
it: Errori nei file importati

source: A file with errors in one of the files that it imports will also trigger an error in the Editor. Your main file might not compile, but you will see there is a problem immediately.
es: Un archivo con errores en uno de los archivos que importa también provocará un error en el Editor. Puede que su archivo principal no compile, pero verá que hay un problema inmediatamente.
it: Un file che presenta errori in uno dei file che importa genera un errore anche nell'editor. Il vostro file principale potrebbe non essere compilato, ma vi accorgerete subito che c'è un problema.

source: Hovering over an Error Number in the File Explorer
es: Pasar el ratón por encima de un número de error en el Explorador de archivos
it: Passare sopra un Numero di Errore nell'Esplora File

source: The number of errors in a file is also reported in the File Explorer. Hovering over the number, which indicates the amount of errors/warnings, will display the information from the Compiler.
es: El número de errores de un archivo también se indica en el Explorador de archivos. Al pasar el ratón por encima del número, que indica la cantidad de errores/avisos, se mostrará la información del compilador.
it: Il numero di errori in un file è riportato anche nell'Esplora File. Passando il mouse sul numero, che indica la quantità di errori/avvertimenti, si visualizzeranno le informazioni del compilatore.

source: Gas Estimates
es: Estimaciones de gas
it: Stime del Carburante

source: Gas estimates are displayed on the same line where a function is declared.
es: Las estimaciones de gas se muestran en la misma línea en la que se declara una función.
it: Le stime del carburante sono visualizzate sulla stessa linea in cui viene dichiarata una funzione.

source: Constructor gas estimates are also displayed, and consist of two components: creation cost and code deposit cost.
es: También se muestran las estimaciones de gas del constructor, que constan de dos componentes: el coste de creación y el coste de depósito del código.
it: Vengono visualizzate anche le stime del carburante del costruttore, che consistono in due componenti: costo di creazione e costo di deposito del codice.

source: Go to Definition and References
es: Ir a Definición y referencias
it: Vai a Definizione e Riferimenti

source: Definitions
es: Definiciones
it: Definizioni

source: By right-clicking, you can go to a definition. You can also use the shortcut displayed.
es: Haciendo clic con el botón derecho, puede ir a una definición. También puede utilizar el acceso directo que aparece.
it: Facendo clic con il tasto destro del mouse, è possibile accedere a una definizione. È anche possibile utilizzare la scorciatoia visualizzata.

source: You can also right-click on the filename of an import statement and jump to that file.
es: También puede hacer clic con el botón derecho en el nombre de archivo de una declaración de importación y saltar a ese archivo.
it: È anche possibile fare clic con il pulsante destro del mouse sul nome del file di un'istruzione di importazione e passare a quel file.

source: You can also ‘peek’ at the definition inline in the Editor. You can then jump to a definition by double-clicking on the right hand side of the line.
es: También puede 'echar un vistazo' a la definición en línea en el Editor. A continuación, puede saltar a una definición haciendo doble clic a la derecha de la línea.
it: È anche possibile "sbirciare" la definizione in linea nell'editor. È possibile passare a una definizione facendo doppio clic sul lato destro della riga.

source: References
es: Referencias
it: Riferimenti

source: By right-clicking, you can display all the references. You can also use the shortcut displayed.
es: Haciendo clic con el botón derecho, podrá visualizar todas las referencias. También puede utilizar el acceso directo que se muestra.
it: Facendo clic con il tasto destro del mouse, è possibile visualizzare tutti i riferimenti. È anche possibile utilizzare la scorciatoia visualizzata.

source: You can jump to a reference by double-clicking on the right hand side of the line.
es: Puede saltar a una referencia haciendo doble clic a la derecha de la línea.
it: È possibile passare a un riferimento facendo doppio clic sul lato destro della riga.

source: Highlighted References
es: Referencias destacadas
it: Riferimenti Evidenziati

source: References are highlighted in the Editor.
es: Las referencias aparecen resaltadas en el Editor.
it: I riferimenti sono evidenziati nell'Editor.

source: Hovering
es: Sobrevolando
it: Passare sopra

source: When you hover over a term with a definition, the definition will pop up. Hovering over code that has triggered an error (underlined with a red squiggly line) will show the error message.
es: Al pasar el ratón por encima de un término con definición, ésta aparecerá. Al pasar el ratón por encima del código que ha provocado un error (subrayado con una línea garabateada roja) aparecerá el mensaje de error.
it: Quando si passa il mouse su un termine con una definizione, viene visualizzata la definizione. Se si passa il mouse sul codice che ha generato un errore (sottolineato da una linea rossa), viene visualizzato il messaggio di errore.

source: Files with Errors turn Red
es: Los archivos con errores se vuelven rojos
it: I file con Errori diventano Rossi

source: When a file contains an error, its name will turn red, both in the File Explorer and on its tab at the top of the Editor.
es: Cuando un archivo contenga un error, su nombre se volverá rojo, tanto en el Explorador de archivos como en su pestaña en la parte superior del Editor.
it: Quando un file contiene un errore, il suo nome diventa rosso, sia nell'Esplora File che nella sua scheda in alto nell'Editor.

source: More about the Editor updates in this article: Major Updates to Remix Editor
es: Más información sobre las actualizaciones del Editor en este artículo: Principales actualizaciones del Editor Remix
it: Maggiori informazioni sugli aggiornamenti dell'editor in questo articolo: Aggiornamenti Importanti dell'Editor Remix
