Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/static_analysis.po
Languages: fr

source: Solidity Static Analysis
fr: Analyse statique de Solidity

source: Static code analysis is a process to debug the code by examining it and without actually executing the code.
fr: L'analyse statique du code est un processus qui permet de déboguer le code en l'examinant sans l'exécuter.

source: `Solidity Static Analysis` plugin performs static analysis on Solidity smart contracts once they are compiled. It checks for security vulnerabilities and bad development practices, among other issues. It can be activated from Remix `Plugin Manager`.
fr: Le plugin `Solidity Static Analysis` effectue une analyse statique des contrats intelligents Solidity une fois qu'ils sont compilés. Il vérifie les vulnérabilités de sécurité et les mauvaises pratiques de développement, entre autres. Il peut être activé à partir du Remix `Plugin Manager`.

source: This plugin comes with `Solidity` environment of Remix IDE.
fr: Ce plugin est livré avec l'environnement `Solidity` de l'IDE Remix.

source: How to use
fr: Comment l'utiliser ?

source: If you select this plugin, you will see a number of modules listed along with checkboxes, one `Auto run` checkbox and a `Run` button. `Run` button will be disabled as there is no compiled contract for now.
fr: Si vous sélectionnez ce plugin, vous verrez un certain nombre de modules listés avec des cases à cocher, une case à cocher "Auto run" et un bouton "Run". Le bouton `Run` sera désactivé car il n'y a pas de contrat compilé pour l'instant.

source: By default, all modules are selected for analysing a smart contract.
fr: Par défaut, tous les modules sont sélectionnés pour l'analyse d'un contrat intelligent.

source: One can select/deselect the modules under which contract should be analyzed and can run the analysis for last compiled contract by clicking on `Run`.
fr: Vous pouvez sélectionner/désélectionner les modules sous lesquels le contrat doit être analysé et lancer l'analyse pour le dernier contrat compilé en cliquant sur "Exécuter".

source: If `Auto run` checkbox is checked, analysis will be performed each time a contract is compiled. Uncheck the checkbox if you want to stop this behaviour.
fr: Si la case `Auto run` est cochée, l'analyse sera effectuée à chaque fois qu'un contrat est compilé. Décochez la case si vous voulez arrêter ce comportement.

source: Run
fr: Exécuter

source: If `Auto run` checkbox is checked, analysis will be performed on compiling a contract and result will be shown as badge to the plugin icon. This number tells warnings count for the contract (e.g; `12` in attached image below) .
fr: Si la case `Auto run` est cochée, l'analyse sera effectuée lors de la compilation d'un contrat et le résultat sera affiché sous forme de badge sur l'icône du plugin. Ce nombre indique le nombre d'avertissements pour le contrat (par exemple, `12` dans l'image jointe ci-dessous).

source: By visiting the plugin UI, the details of the warning can be seen along with the category name for each warning.
fr: En visitant l'interface utilisateur du plugin, vous pouvez voir les détails de l'avertissement ainsi que le nom de la catégorie pour chaque avertissement.

source: Clicking on warning details will highlight the relevant code in the editor.
fr: En cliquant sur les détails de l'avertissement, le code correspondant apparaît en surbrillance dans l'éditeur.

source: Analysis Modules
fr: Modules d'analyse

source: Currently, with Remix IDE v0.10.1, there are 21 analysis modules listed under 4 categories. Categories are: `Security`, `Gas & Economy`, `ERC` & `Miscellaneous`.
fr: Actuellement, avec Remix IDE v0.10.1, il y a 21 modules d'analyse répertoriés dans 4 catégories. Les catégories sont : `Sécurité`, `Gaz & Economie`, `ERC` et `Divers`.

source: Here is the list of modules under each category along with the example code which **should be avoided or used very carefully while development**:
fr: Voici la liste des modules de chaque catégorie ainsi que l'exemple de code qui **doit être évité ou utilisé avec précaution lors du développement** :

source: Category: Security
fr: Catégorie : Sécurité

source: **Transaction origin: 'tx.origin' is used**
fr: **Origine de la transaction : 'tx.origin' est utilisé**

source: `tx.origin` is useful only in very exceptional cases. If you use it for authentication, you usually want to replace it by "msg.sender", because otherwise any contract you call can act on your behalf.
fr: `tx.origin` n'est utile que dans des cas très exceptionnels. Si vous l'utilisez pour l'authentification, vous voulez généralement le remplacer par "msg.sender", parce que sinon n'importe quel contrat que vous appelez peut agir en votre nom.

source: _Example:_
fr: Exemple:________________.

source: **Check effects: Potential reentrancy bugs**
fr: **Vérifiez les effets : Bogues potentiels de réentrance**

source: Potential Violation of Checks-Effects-Interaction pattern can lead to re-entrancy vulnerability.
fr: La violation potentielle du modèle Checks-Effects-Interaction peut entraîner une vulnérabilité de réentrance.

source: **Inline assembly: Inline assembly used**
fr: **Assemblage en ligne : Assemblage en ligne utilisé**

source: Use of inline assembly is advised only in rare cases.
fr: L'utilisation de l'assemblage en ligne n'est conseillée que dans de rares cas.

source: **Block timestamp: Semantics maybe unclear**
fr: **Heure du bloc : La sémantique n'est peut-être pas claire**

source: `now` does not mean current time. `now` is an alias for `block.timestamp`. `block.timestamp` can be influenced by miners to a certain degree, be careful.
fr: `now` ne signifie pas l'heure actuelle. `now` est un alias de `block.timestamp`. `block.timestamp` peut être influencé par les mineurs dans une certaine mesure, soyez prudent.

source: **Low level calls: Semantics maybe unclear**
fr: **Appels de bas niveau : La sémantique n'est peut-être pas claire**

source: Use of low level `call`, `callcode` or `delegatecall` should be avoided whenever possible. `send` does not throw an exception when not successful, make sure you deal with the failure case accordingly. Use `transfer` whenever failure of the ether transfer should rollback the whole transaction.
fr: L'utilisation de `call`, `callcode` ou `delegatecall` de bas niveau doit être évitée autant que possible. `send` ne lève pas d'exception en cas d'échec, assurez-vous de traiter le cas d'échec en conséquence. Utilisez `transfer` lorsque l'échec du transfert d'éther doit annuler toute la transaction.

source: **Blockhash usage: Semantics maybe unclear**
fr: **Utilisation de Blockhash : La sémantique n'est peut-être pas claire**

source: `blockhash` is used to access the last 256 block hashes. A miner computes the block hash by "summing up" the information in the current block mined. By summing up the information in a clever way a miner can try to influence the outcome of a transaction in the current block.
fr: `blockhash` est utilisé pour accéder aux 256 derniers hashs de blocs. Un mineur calcule le hachage du bloc en "résumant" les informations contenues dans le bloc en cours de minage. En résumant les informations de manière intelligente, un mineur peut essayer d'influencer le résultat d'une transaction dans le bloc en cours.

source: **Selfdestruct: Beware of caller contracts**
fr: **L'autodestruction : Méfiez-vous des contrats d'appel**

source: `selfdestruct` can block calling contracts unexpectedly. Be especially careful if this contract is planned to be used by other contracts (i.e. library contracts, interactions). Selfdestruction of the callee contract can leave callers in an inoperable state.
fr: `selfdestruct` peut bloquer les contrats appelants de manière inattendue. Soyez particulièrement prudent si ce contrat est prévu pour être utilisé par d'autres contrats (par exemple, des contrats de bibliothèque, des interactions). L'autodestruction du contrat de l'appelant peut laisser les appelants dans un état inopérant.

source: Category: Gas & Economy
fr: Catégorie : Gaz et économie

source: **Gas costs: Too high gas requirement of functions**
fr: **Coûts du gaz : Besoins en gaz trop élevés pour les fonctions**

source: If the gas requirement of a function is higher than the block gas limit, it cannot be executed. Please avoid loops in your functions or actions that modify large areas of storage
fr: Si le besoin en gaz d'une fonction est supérieur à la limite de gaz du bloc, elle ne peut pas être exécutée. Veuillez éviter les boucles dans vos fonctions ou les actions qui modifient de grandes zones de stockage.

source: **This on local calls: Invocation of local functions via 'this'**
fr: **Ceci sur les appels locaux : Invocation de fonctions locales via 'this'**.

source: Never use `this` to call functions in the same contract, it only consumes more gas than normal local calls.
fr: N'utilisez jamais `this` pour appeler des fonctions dans le même contrat, cela ne fait que consommer plus de gaz que les appels locaux normaux.

source: **Delete on dynamic Array: Use require/assert appropriately**
fr: **Suppression d'un tableau dynamique : Utilisez require/assert de manière appropriée**

source: The `delete` operation when applied to a dynamically sized array in Solidity generates code to delete each of the elements contained. If the array is large, this operation can surpass the block gas limit and raise an OOG exception. Also nested dynamically sized objects can produce the same results.
fr: L'opération `delete` lorsqu'elle est appliquée à un tableau de taille dynamique dans Solidity génère du code pour supprimer chacun des éléments contenus. Si le tableau est grand, cette opération peut dépasser la limite de gaz du bloc et soulever une exception OOG. Des objets imbriqués de taille dynamique peuvent également produire les mêmes résultats.

source: **For loop over dynamic array: Iterations depend on dynamic array's size**
fr: **Boucle de forçage sur un tableau dynamique : Les itérations dépendent de la taille du tableau dynamique**

source: Loops that do not have a fixed number of iterations, for example, loops that depend on storage values, have to be used carefully: Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can stall the complete contract at a certain point. Additionally, using unbounded loops can incur in a lot of avoidable gas costs. Carefully test how many items at maximum you can pass to such functions to make it successful.
fr: Les boucles qui n'ont pas un nombre fixe d'itérations, par exemple les boucles qui dépendent des valeurs de stockage, doivent être utilisées avec précaution : En raison de la limite de gaz par bloc, les transactions ne peuvent consommer qu'une certaine quantité de gaz. Le nombre d'itérations dans une boucle peut dépasser la limite de gaz par bloc, ce qui peut bloquer le contrat complet à un certain moment. En outre, l'utilisation de boucles non bornées peut entraîner de nombreux coûts de gaz qui pourraient être évités. Testez soigneusement le nombre maximum d'éléments que vous pouvez transmettre à ces fonctions pour qu'elles soient efficaces.

source: **Ether transfer in loop: Transferring Ether in a for/while/do-while loop**
fr: **Transfert d'Ether dans une boucle : Transfert d'Ether dans une boucle for/while/do-while**.

source: Ether payout should not be done in a loop. Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can cause the complete contract to be stalled at a certain point. If required, make sure that number of iterations are low and you trust each address involved.
fr: Le paiement des éthers ne doit pas être effectué en boucle. En raison de la limite de gaz par bloc, les transactions ne peuvent consommer qu'une certaine quantité de gaz. Le nombre d'itérations dans une boucle peut dépasser la limite de gaz par bloc, ce qui peut entraîner le blocage du contrat complet à un certain moment. Le cas échéant, assurez-vous que le nombre d'itérations est faible et que vous faites confiance à chaque adresse concernée.

source: Category: ERC
fr: Catégorie : ERC

source: **ERC20: 'decimals' should be 'uint8'**
fr: **ERC20 : "decimals" doit être remplacé par "uint8"**.

source: ERC20 Contracts `decimals` function should have `uint8` as return type.
fr: Contrats ERC20 La fonction `decimals` devrait avoir `uint8` comme type de retour.

source: Category: Miscellaneous
fr: Catégorie : Divers

source: **Constant/View/Pure functions: Potentially constant/view/pure functions**
fr: **Fonctions constantes/vues/pures : Fonctions potentiellement constantes/vues/pures**

source: It warns for the methods which potentially should be constant/view/pure but are not.
fr: Il met en garde contre les méthodes qui devraient potentiellement être constantes/visibles/pures mais qui ne le sont pas.

source: **Similar variable names: Variable names are too similar**
fr: **Noms de variables similaires : Les noms de variables sont trop similaires**

source: It warns on the usage of similar variable names.
fr: Il met en garde contre l'utilisation de noms de variables similaires.

source: **No return: Function with 'returns' not returning**
fr: **Pas de retour : La fonction avec des "retours" ne renvoie pas d'information**

source: It warns for the methods which define a return type but never explicitly return a value.
fr: Il met en garde contre les méthodes qui définissent un type de retour mais ne renvoient jamais explicitement une valeur.

source: **Guard conditions: Use 'require' and 'assert' appropriately**
fr: **Respectez les conditions : Utilisez les termes "exiger" et "affirmer" de manière appropriée**.

source: Use `assert(x)` if you never ever want x to be false, not in any circumstance (apart from a bug in your code). Use `require(x)` if x can be false, due to e.g. invalid input or a failing external component.
fr: Utilisez `assert(x)` si vous ne voulez jamais que x soit faux, en aucune circonstance (à part un bug dans votre code). Utilisez `require(x)` si x peut être faux, à cause par exemple d'une entrée invalide ou d'un composant externe défaillant.

source: **Result not used: The result of an operation not used**
fr: **Résultat non utilisé : Le résultat d'une opération non utilisée**

source: A binary operation yields a value that is not used in the following. This is often caused by confusing assignment (=) and comparison (==).
fr: Une opération binaire produit une valeur qui n'est pas utilisée dans la suite. Cela est souvent dû à une confusion entre l'affectation (=) et la comparaison (==).

source: **String Length: Bytes length != String length**
fr: **Longueur de la chaîne : Longueur des octets != Longueur de la chaîne**

source: Bytes and string length are not the same since strings are assumed to be UTF-8 encoded (according to the ABI definition) therefore one character is not necessarily encoded in one byte of data.
fr: Les octets et la longueur de la chaîne ne sont pas les mêmes puisque les chaînes sont supposées être encodées en UTF-8 (selon la définition de l'ABI) et qu'un caractère n'est donc pas nécessairement encodé dans un octet de données.

source: **Delete from dynamic array: 'delete' on an array leaves a gap**
fr: **Suppression d'un tableau dynamique : 'delete' sur un tableau laisse un vide**

source: Using `delete` on an array leaves a gap. The length of the array remains the same. If you want to remove the empty position you need to shift items manually and update the length property.
fr: L'utilisation de `delete` sur un tableau laisse un vide. La longueur du tableau reste la même. Si vous souhaitez supprimer la position vide, vous devez décaler les éléments manuellement et mettre à jour la propriété length.

source: **Data Truncated: Division on int/uint values truncates the result**
fr: **Données tronquées : La division sur des valeurs int/uint tronque le résultat**

source: Division of integer values yields an integer value again. That means e.g. 10 / 100 = 0 instead of 0.1 since the result is an integer again. This does not hold for division of (only) literal values since those yield rational constants.
fr: La division de valeurs entières donne à nouveau une valeur entière. Cela signifie que, par exemple, 10 / 100 = 0 au lieu de 0,1 puisque le résultat est à nouveau un nombre entier. Ce n'est pas le cas pour la division de valeurs littérales (uniquement), qui donnent des constantes rationnelles.

source: Remix-analyzer
fr: Analyseur de remix

source: `remix-analyzer` is the library which works underneath of remix-ide `Solidity Static Analysis` plugin.
fr: `remix-analyzer` est la bibliothèque qui fonctionne sous le plugin `Solidity Static Analysis` de remix-ide.

source: `remix-analyzer` is an [NPM package](https://www.npmjs.com/package/@remix-project/remix-analyzer). It can be used as a library in a solution supporting node.js. Find more information about this type of usage in the [remix-analyzer repository](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
fr: `remix-analyzer` est un [paquet NPM] (https://www.npmjs.com/package/@remix-project/remix-analyzer). Il peut être utilisé comme bibliothèque dans une solution supportant node.js. Vous trouverez plus d'informations sur ce type d'utilisation dans le [dépôt remix-analyzer](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
