Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/testing_using_Chai_&_Mocha.po
Languages: es, fr, it

source: Testing using Chai & Mocha
es: Pruebas con Chai y Mocha
fr: Test avec Chai & Moka
it: Testare con Chai e Mocha

source: _(Supported since Remix IDE v0.22.0)_
es: _(Soportado desde Remix IDE v0.22.0)_
fr: (Supporté depuis Remix IDE v0.22.0)

source: Remix supports testing of your files in JavaScript using assertion library [Chai](https://www.chaijs.com/) & test framework [Mocha](https://mochajs.org/)
es: Remix admite la comprobación de sus archivos en JavaScript mediante la biblioteca de aserción [Chai](https://www.chaijs.com/) y el marco de pruebas [Mocha](https://mochajs.org/)
fr: Remix permet de tester vos fichiers en JavaScript à l'aide de la bibliothèque d'assertions [Chai](https://www.chaijs.com/) et du cadre de test [Mocha](https://mochajs.org/).
it: Remix supporta il test dei file in JavaScript utilizzando la libreria di asserzioni [Chai](https://www.chaijs.com/) e il framework di test [Mocha](https://mochajs.org/)

source: _Chai is a BDD / TDD assertion library for node and the browser that can be delightfully paired with any javascript testing framework._
es: _Chai es una librería de aserción BDD / TDD para node y el navegador que puede ser deliciosamente emparejada con cualquier framework de pruebas javascript._
fr: Chai est une bibliothèque d'assertions BDD / TDD pour node et le navigateur qui peut être délicieusement associée à n'importe quel framework de test javascript.
it: _Chai è una libreria di asserzioni BDD / TDD per il nodo e il browser che può essere meravigliosamente abbinata a qualsiasi framework di test javascript._

source: _Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun._
es: _Mocha es un marco de pruebas JavaScript rico en funciones que se ejecuta en Node.js y en el navegador, haciendo que las pruebas asíncronas sean sencillas y divertidas._
fr: Mocha est un framework de test JavaScript riche en fonctionnalités, fonctionnant sur Node.js et dans le navigateur, qui rend les tests asynchrones simples et amusants.
it: _Mocha è un framework di test JavaScript ricco di funzionalità che gira su Node.js e nel browser, eseguendo i test asincroni semplici e divertenti._

source: Write tests
es: Escribir pruebas
fr: Rédiger des tests
it: Scrivere i test

source: Create a js file in your project workspace. Better to create it inside `scripts` folder. Lets name it `sample.test.js`.
es: Cree un archivo js en el espacio de trabajo de su proyecto. Es mejor crearlo dentro de la carpeta `scripts`. Llamémoslo `sample.test.js`.
fr: Créez un fichier js dans l'espace de travail de votre projet. Il est préférable de le créer dans le dossier `scripts`. Nommons-le `sample.test.js`.
it: Creare un file js nella tua area di lavoro del progetto. È meglio crearlo all'interno della cartella `scripts`. Nominiamolo `sample.test.js`.

source: Write your tests in the file. Here is a sample:
es: Escriba sus pruebas en el archivo. Aquí tiene un ejemplo:
fr: Écrivez vos tests dans le fichier. Voici un exemple :
it: Scrivete i vostri test nel file. Ecco un esempio:

source: Run tests
es: Ejecutar pruebas
fr: Exécuter les tests
it: Eseguire i test

source: Once done with writing the tests, right click on file name in `File Explorers` plugin. It will show some options along with option to `Run`. This `Run` option is used to run the JS scripts
es: Una vez que haya terminado de escribir las pruebas, haga clic con el botón derecho del ratón sobre el nombre del archivo en el plugin `Explorador de archivos`. Mostrará algunas opciones junto con la opción de `Ejecutar`. Esta opción `Run` se utiliza para ejecutar los scripts JS
fr: Une fois les tests écrits, faites un clic droit sur le nom du fichier dans le plugin `File Explorers`. Il affichera quelques options ainsi que l'option `Run`. Cette option `Run` est utilisée pour exécuter les scripts JS.
it: Una volta terminata la scrittura dei test, cliccate con il pulsante destro del mouse sul nome del file nel plugin `File Explorers` (Esplora File). Verranno mostrate alcune opzioni insieme all'opzione `Run` (Esegui). L'opzione `Esegui` viene utilizzata per eseguire gli script JS

source: Click on `Run`, tests will be executed and result will be shown on Terminal.
es: Haga clic en `Ejecutar`, las pruebas se ejecutarán y el resultado se mostrará en el Terminal.
fr: Cliquez sur "Exécuter", les tests seront exécutés et les résultats s'afficheront sur le terminal.
it: Cliccando su`Run` (Esegui), i test verranno eseguiti e i risultati saranno visualizzati sul terminale.

source: Test a contract
es: Probar un contrato
fr: Tester un contrat
it: Testare un contratto

source: Similarly unit tests can be written to test the functionality of a smart contract. An example to test default `1_Storage.sol` contract can be as:
es: De forma similar se pueden escribir pruebas unitarias para probar la funcionalidad de un contrato inteligente. Un ejemplo para probar el contrato por defecto `1_Storage.sol` puede ser como:
fr: De même, des tests unitaires peuvent être écrits pour tester la fonctionnalité d'un contrat intelligent. Un exemple pour tester le contrat par défaut `1_Storage.sol` peut être le suivant :
it: Allo stesso modo, i test unitari possono essere scritti per testare la funzionalità di uno contratto intelligente. Un esempio per testare il contratto predefinito `1_Storage.sol` può essere il seguente:

source: Result will be as:
es: El resultado será el siguiente:
fr: Le résultat sera le suivant :
it: Il risultato sarà come:

source: Debugging a test transaction
es: Depuración de una transacción de prueba
fr: Débogage d'une transaction de test
it: Debug di una transazione di test

source: To debug a transaction in one of the tests, print the transaction hash and input that in the [Remix Debugger plugin](https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).
es: Para depurar una transacción en una de las pruebas, imprima el hash de la transacción e introdúzcalo en el [Remix Debugger plugin](https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).
fr: Pour déboguer une transaction dans l'un des tests, imprimez le hachage de la transaction et saisissez-le dans le [plugin Remix Debugger] (https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).
it: Per eseguire il debug di una transazione in uno dei test, stampare l'hash della transazione e inserirlo nel plugin [Debug di Remix](https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).

source: Hardhat-ethers support
es: Soporte para cascos
fr: Soutien aux casques et aux éthers
it: Supporto Hardhat-ethers

source: Remix also supports methods of [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) plugin of Hardhat framework. Available methods under this plugin are:
es: Remix también soporta métodos del plugin [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) del framework Hardhat. Los métodos disponibles bajo este plugin son:
fr: Remix prend également en charge les méthodes du plugin [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) du cadre Hardhat. Les méthodes disponibles dans le cadre de ce plugin sont les suivantes :
it: Remix supporta anche i metodi del plugin [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) del framework Hardhat. I metodi disponibili in questo plugin sono:

source: With this, one can run the tests for a hardhat project easily using Remix.
es: Con esto, uno puede ejecutar las pruebas para un proyecto hardhat fácilmente usando Remix.
fr: Ainsi, il est possible d'exécuter facilement les tests d'un projet hardhat à l'aide de Remix.
it: In questo modo, si possono eseguire facilmente i test per un progetto hardhat utilizzando Remix.

source: Example to test `Storage` contract with this plugin methods can be as:
es: Ejemplo para probar el contrato `Storage` con este plugin los métodos pueden ser como:
fr: Exemple de test du contrat `Storage` avec ce plugin : les méthodes peuvent être les suivantes :
it: Un esempio per testare il contratto `Storage` con i metodi di questo plugin può essere il seguente:
