Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/truffle.po
Languages: es, fr, it

source: Truffle
es: Trufa
fr: Truffe

source: _(Supported since Remix IDE v0.23.0 and Remixd v0.6.0)_
es: _(Compatible desde Remix IDE v0.23.0 y Remixd v0.6.0)_
fr: (Supporté depuis Remix IDE v0.23.0 et Remixd v0.6.0)
it: _(Supportato a partire dalla versione Remix IDE v0.23.0 e Remixd v0.6.0)_

source: Remixd and Truffle
es: Remixd y Trufa
fr: Remixd et Truffle
it: Remixd e Truffle

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
es: **Nota:** Si no ha utilizado `remixd` antes, lea más sobre él [here](./remixd.html)
fr: **Note:** Si vous n'avez pas encore utilisé `remixd`, lisez-en plus sur [here](./remixd.html)
it: **Nota:** Se non si è mai usato `remixd` prima d'ora, leggi di più su di esso [qui](./remixd.html)

source: If `remixd` is running locally on your device and shared folder is a **Truffle project**, an additional websocket plugin will be listening on port `65524`. According to its documentation,
es: Si `remixd` se está ejecutando localmente en su dispositivo y la carpeta compartida es un **proyecto Truffle**, un plugin websocket adicional estará escuchando en el puerto `65524`. Según su documentación
fr: Si `remixd` est exécuté localement sur votre appareil et que le dossier partagé est un **projet Truffle**, un plugin websocket supplémentaire écoutera sur le port `65524`. Selon sa documentation,
it: Se `remixd` è in esecuzione localmente sul tuo dispositivo e la cartella condivisa è un **progetto Truffle**, un plugin websocket aggiuntivo sarà in ascolto sulla porta `65524`. Secondo la sua documentazione,

source: _Truffle projects are projects with a truffle-config.js file._
es: _Los proyectos truffle son proyectos con un archivo truffle-config.js._
fr: Les projets Truffle sont des projets avec un fichier truffle-config.js.
it: _I progetti Truffle sono progetti con un file truffle-config.js._

source: Remixd looks for the `truffle-config.js` file in shared folder. If found, the Truffle websocket listener will run.
es: Remixd busca el archivo `truffle-config.js` en la carpeta compartida. Si lo encuentra, se ejecutará el escuchador de websocket Truffle.
fr: Remixd recherche le fichier `truffle-config.js` dans le dossier partagé. S'il est trouvé, le Truffle websocket listener sera exécuté.
it: Remixd cerca il file `truffle-config.js` nella cartella condivisa. Se lo trova, esegue il processo websocket di Truffle.

source: The Truffle websocket listener is a websocket plugin similar to `remixd` and is used to perform Truffle specific actions with Remix IDE.
es: El escuchador de websocket de Truffle es un plugin de websocket similar a `remixd` y se utiliza para realizar acciones específicas de Truffle con Remix IDE.
fr: Le Truffle websocket listener est un plugin websocket similaire à `remixd` et est utilisé pour effectuer des actions spécifiques à Truffle avec Remix IDE.
it: Il processo websocket di Truffle è un plugin websocket simile a `remixd` e viene usato per eseguire azioni specifiche di Truffle con l'IDE Remix.

source: It doesn't need any separate installation as it is shipped with [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module.
es: No necesita ninguna instalación por separado ya que se entrega con el módulo [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).
fr: Il ne nécessite aucune installation séparée car il est livré avec le module [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).
it: Non ha bisogno di alcuna installazione separata, poiché viene fornito con il modulo [NPM remixd] (https://www.npmjs.com/package/@remix-project/remixd).

source: Enable Truffle Compilation
es: Habilitar la compilación de trufas
fr: Activer la compilation Truffle
it: Abilita la Compilazione Truffle

source: Prerequisites
es: Requisitos previos
fr: Conditions préalables
it: Prerequisiti

source: To use Truffle compilation with Remix IDE efficiently:
es: Para utilizar eficazmente la compilación Truffle con Remix IDE:
fr: Pour utiliser efficacement la compilation Truffle avec Remix IDE :
it: Per utilizzare in modo efficiente la compilazione di Truffle con l'IDE Remix:

source: **Truffle** should be installed locally on the system [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)
es: **Truffle** debe instalarse localmente en el sistema [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)
fr: **Truffle** doit être installé localement sur le système [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)
it: **Truffle** deve essere installato localmente sul sistema [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)

source: Shared folder should be a Truffle project containing `truffle-config.js`
es: La carpeta compartida debe ser un proyecto Truffle que contenga `truffle-config.js`.
fr: Le dossier partagé doit être un projet Truffle contenant `truffle-config.js`
it: La cartella condivisa dovrebbe essere un progetto Truffle contenente `truffle-config.js`

source: `Remixd` Truffle websocket listener should be running at `65524`
es: El `Remixd` Truffle websocket listener debería estar ejecutándose en `65524`.
fr: L'auditeur Truffle websocket `Remixd` devrait être lancé à `65524`.
it: Il processo websocket di `Truffle per Remixd` dovrebbe essere in esecuzione alla porta `65524`

source: How to use
es: Cómo utilizarlo
fr: Comment l'utiliser ?
it: Come usare

source: If a truffle project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Compiler` plugin with the label `Enable Truffle Compilation`.
es: Si se comparte un proyecto de trufa a través de remixd y se carga el espacio de trabajo `localhost` en Remix IDE, aparecerá una casilla de verificación extra en el plugin `Solidity Compiler` con la etiqueta `Enable Truffle Compilation`.
fr: Si un projet Truffle est partagé via remixd et que l'espace de travail `localhost` est chargé dans Remix IDE, il y aura une case à cocher supplémentaire dans le plugin `Solidity Compiler` avec le libellé `Enable Truffle Compilation`.
it: Se un progetto truffle è condiviso tramite remixd e l'area di lavoro `localhost` è caricato nell'IDE Remix, nel plugin `Solidity Compiler` (Compilatore Solidity) sarà visualizzata una casella di controllo aggiuntiva con l'etichetta `Enable Truffle Compilation` (abilita la compilazione Truffle).

source: There is an info icon along side the label which redirects to a specific section of Remix official documentation that explains how to use Truffle compilation.
es: Hay un icono de información junto a la etiqueta que redirige a una sección específica de la documentación oficial de Remix que explica cómo utilizar la compilación Truffle.
fr: Il y a une icône info à côté de l'étiquette qui redirige vers une section spécifique de la documentation officielle de Remix qui explique comment utiliser la compilation Truffle.
it: C'è un'icona informativa accanto all'etichetta che reindirizza a una sezione specifica della documentazione ufficiale di Remix che spiega come usare la compilazione Truffle.

source: One can check the `Enable Truffle Compilation` box to run the compilation for Truffle along with the Remix using the compiler configuration in `Solidity Compiler` plugin.
es: Se puede marcar la casilla `Habilitar compilación Truffle` para ejecutar la compilación para Truffle junto con el Remix utilizando la configuración del compilador en el plugin `Solidity Compiler`.
fr: Vous pouvez cocher la case "Enable Truffle Compilation" pour lancer la compilation pour Truffle en même temps que le Remix en utilisant la configuration du compilateur dans le plugin "Solidity Compiler".
it: Si può selezionare la casella `Enable Truffle Compilation` (Abilita la compilazione Truffle) per eseguire la compilazione di Truffle insieme a Remix usando la configurazione del compilatore nel plugin `Solidity Compiler` (Compilatore Solidity).

source: On clicking `Compile` button, a file named as `remix-compiler.config.js` will be created on the project root which will be storing compiler configuration set in Remix's `Solidity Compiler` plugin. It is passed to Truffle for compilation.
es: Al pulsar el botón `Compilar`, se creará un archivo llamado `remix-compiler.config.js` en la raíz del proyecto que almacenará la configuración del compilador establecida en el plugin `Solidity Compiler` de Remix. Se pasa a Truffle para la compilación.
fr: En cliquant sur le bouton `Compile`, un fichier nommé `remix-compiler.config.js` sera créé à la racine du projet qui stockera la configuration du compilateur définie dans le plugin `Solidity Compiler` de Remix. Il est transmis à Truffle pour la compilation.
it: Cliccando sul pulsante `Compile` (Compila), viene creato un file dal nome `remix-compiler.config.js` nella radice del progetto, che memorizza la configurazione del compilatore impostata nel plugin `Solidity Compiler` (Compilatore Solidity) di Remix. Esso viene passato a Truffle per la compilazione.

source: The result of the compilation will be shown in the Remix IDE terminal
es: El resultado de la compilación se mostrará en el terminal del IDE Remix
fr: Le résultat de la compilation sera affiché dans le terminal de l'IDE Remix.
it: Il risultato della compilazione sarà mostrato nel terminale dell'IDE Remix

source: and also in the **remixd** terminal.
es: y también en el terminal **remixd**.
fr: et aussi dans le terminal **remixd**.
it: ed anche nel terminale **remixd**.

source: Ganache Provider
es: Proveedor de ganache
fr: Fournisseur de ganache
it: Fornitore Ganache

source: _In Truffle, contracts are deployed by connecting to a built-in personal blockchain, i.e. Ganache. Read more about it in [Truffle documentation](https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_
es: _En Truffle, los contratos se despliegan conectándose a una blockchain personal incorporada, es decir, Ganache. Lea más sobre ello en [documentación de Truffle](https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_
fr: Dans Truffle, les contrats sont déployés en se connectant à une blockchain personnelle intégrée, c'est-à-dire Ganache. Pour en savoir plus, consultez la [documentation Truffle] (https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_
it: _In Truffle, i contratti vengono distribuiti collegandosi a una blockchain personale integrata, per esempio, Ganache. Per saperne di più, consultare la [Documentazione Truffle](https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_

source: **Ganache Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Truffle's built-in Ganache blockchain. `Ganache Provider` can be chosen from the list of environments in `Deploy & Run Transactions` plugin.
es: **Ganache Provider** es un plugin en Remix IDE que permite a los usuarios desplegar el contrato en la blockchain Ganache incorporada de Truffle. `Ganache Provider` puede elegirse de la lista de entornos del plugin `Deploy & Run Transactions`.
fr: **Ganache Provider** est un plugin sur Remix IDE qui permet aux utilisateurs de déployer le contrat sur la blockchain Ganache intégrée à Truffle. `Ganache Provider` peut être choisi dans la liste des environnements dans le plugin `Deploy & Run Transactions`.
it: Il **Ganache Provider** (Fornitore di Ganache) è un plugin dell'IDE Remix che consente agli utenti di distribuire il contratto sulla blockchain **Ganache** integrata di Truffle. Il `Ganache Provider` può essere selezionato dall'elenco degli ambienti nel plugin `Deploy & Run Transactions` (Distribuisci e avvia le transazioni).

source: As soon as you select `Ganache Provider`, a modal is opened asking for the `Ganache JSON-RPC Endpoint`.
es: En cuanto seleccione `Ganache Provider`, se abrirá un modal preguntándole por el `Ganache JSON-RPC Endpoint`.
fr: Dès que vous sélectionnez `Ganache Provider`, une fenêtre modale s'ouvre pour vous demander le `Ganache JSON-RPC Endpoint`.
it: Non appena si seleziona `Ganache Provider` (Fornitore Ganache), si apre una finestra che chiede lo `Ganache JSON-RPC Endpoint`(Endpoint JSON-RPC di Ganache).

source: If Ganache node is running with default options, the default endpoint value in modal will not need any change. In case, Ganache node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
es: Si el nodo Ganache está funcionando con las opciones por defecto, el valor del endpoint por defecto en el modal no necesitará ningún cambio. En caso de que el host y el puerto del nodo Ganache sean diferentes, el punto final JSON-RPC deberá actualizarse en el cuadro de texto del modal.
fr: Si le nœud Ganache fonctionne avec les options par défaut, la valeur du point final par défaut dans la fenêtre modale n'a pas besoin d'être modifiée. Si l'hôte et le port du nœud Ganache sont différents, le point de terminaison JSON-RPC doit être mis à jour dans la zone de texte de la fenêtre modale.
it: Se il nodo Ganache è in esecuzione con le opzioni predefinite, il valore dell'endpoint predefinito nella maschera non necessita di modifiche. Se l'host e la porta del nodo Ganache sono diversi, l'endpoint JSON-RPC deve essere aggiornato nella casella di testo.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Ganache node will be loaded in the `ACCOUNT` section. Network id will also be shown.
es: Una vez rellenado el punto final correcto en el modal, pulse `OK` y las cuentas del nodo Ganache se cargarán en la sección `ACCOUNT`. También se mostrará el identificador de red.
fr: Une fois que le bon endpoint est rempli dans le modal, cliquez simplement sur `OK` et les comptes du noeud Ganache seront chargés dans la section `ACCOUNT`. L'identifiant du réseau sera également affiché.
it: Una volta inserito l'endpoint corretto nella maschera, è sufficiente cliccare su `OK` e gli account del nodo Ganache verranno caricati nella sezione `ACCOUNT`. Inoltre verrà mostrato anche l'identificativo (id) della rete.

source: Now, one can start deploying the contract from Remix IDE to the local Ganache node as usual.
es: Ahora, se puede empezar a desplegar el contrato desde Remix IDE al nodo Ganache local como de costumbre.
fr: Maintenant, vous pouvez commencer à déployer le contrat depuis Remix IDE vers le nœud Ganache local comme d'habitude.
it: A questo punto, si può iniziare a distribuire il contratto dall'IDE Remix al nodo locale di Ganache come di consueto.
