Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/tutorial_debug.po
Languages: it

source: Debugging Transactions
it: Debug delle Transazioni

source: (also see this page's companion: [the Debugger Tour](debugger.html))
it: (si veda anche la pagina di accompagnamento di questa: [il tour del Debugger](debugger.html))

source: There are two ways to start a debugging session, each one corresponds to a different use case.
it: Esistono due modi per avviare una sessione di debug, ognuno dei quali corrisponde a un caso d'uso diverso.

source: Use Case 1: for debugging a transaction made in Remix - click the **Debug button** in the transaction log in Remix's Terminal.
it: Caso d'uso 1: per eseguire il debug di una transazione effettuata in Remix, fare clic sul pulsante **Debug** nel registro delle transazioni nel Terminale di Remix.

source: Use Case 2: for debugging a transaction where you have a **txn hash** from **verified contract** or where you have the txn hash and the compiled source code with the same compilation settings as the deployed contract.
it: Caso d'uso 2: per il debug di una transazione in cui si dispone di un'**hash di transazione** da un **contratto verificato** o in cui si dispone dell'hash di transazione e del codice sorgente compilato con le stesse impostazioni di compilazione del contratto distribuito.

source: Initiate Debugging from the transaction log in the Terminal
it: Avviare il debug dal registro delle transazioni nel Terminale

source: Let's start with a basic contract ( or replace the contract below with your own )
it: Cominciamo con un contratto di base (o sostituisci il contratto qui sotto con il tuo)

source: Make a new file in Remix and copy the code above into it.
it: Crea un nuovo file in Remix e copiaci dentro il codice di cui sopra.

source: Compile the code.
it: Compila il codice.

source: Go to the Run & Deploy module.
it: Vai al modulo Esegui & Distribuisci.

source: For the purpose of this tutorial, we will run the `Remix VM`.
it: Per lo scopo di questa esercitazione, eseguiremo la `Remix VM`.

source: Deploy the contract:
it: Distribuisci il contratto:

source: Click the `Deploy` button
it: Fare clic sul pulsante `Distribuisci`

source: You'll see the deployed instance (AKA the udapp).
it: Si vedrà l'istanza distribuita (alias udapp).

source: Then open it up (by clicking the caret).
it: Quindi aprilo (facendo clic sul cursore).

source: We are going to call the `Donate` function and will send 2 Ethers.
it: Invocheremo la funzione `Dona` e invieremo 2 Ether.

source: To do this: in the value input box put in **2** and **select Ether** as the unit (DO NOT LEAVE THE DEFAULT unit as **gwei** or the change will be hard to detect).
it: Per farlo: nella casella di inserimento del valore immettere **2** e **selezionare Ether** come unità (NON LASCIARE L'UNITÀ DI DEFAULT come **gwei** o la modifica sarà difficile da rilevare).

source: Then click the `Donate` button.
it: Quindi clicca sul pulsante `Dona`.

source: This will send the Ether to the function.
it: Questo invierà l'Ether alla funzione.

source: Because we are using the `Remix VM`, everything happens almost instantly. (If we had been using Injected Web 3, then we would have to need to approve the transaction, pay for gas and wait for the transaction to get mined.)
it: Poiché stiamo utilizzando la `Remix VM`, tutto avviene quasi istantaneamente. (Se avessimo usato Injected Web 3, avremmo dovuto approvare la transazione, pagare il carburante e aspettare che la transazione venisse processata.)

source: Remix displays information related to each transaction result in the terminal.
it: Remix visualizza le informazioni relative a ciascun risultato della transazione nel terminale.

source: Check in the **terminal** where the transaction you just made is logged.
it: Controlla nel **terminale** dove è registrata la transazione appena effettuata.

source: Click the **debug button**.
it: Clicca sul **pulsante di debug**.

source: But before we get to the actual debugging tool, the next section shows how to start a debugging session directly from the Debugger.
it: Ma prima di passare allo strumento di debug vero e proprio, la prossima sezione mostra come avviare una sessione di debug direttamente dal Debugger.

source: Initiate Debugging from the Debugger
it: Avviare il debug dal Debugger

source: Click the bug icon in the icon panel to get to the debugger in the side panel.
it: Fai clic sull'icona del bug nel pannello delle icone per accedere al debugger nel pannello laterale.

source: If you don't see the bug icon, go to the plugin manager and activate the debugger.
it: Se non si vede l'icona del bug, vai nel gestore dei plugin e attiva il debugger.

source: You can start a debug session by providing a `transaction hash`.
it: È possibile avviare una sessione di debug fornendo un `hash di transazione`.

source: To find a transaction hash:
it: Per trovare un hash di transazione:

source: Go to a transaction in the terminal.
it: Vai a una transazione nel terminale.

source: Click a line with a transaction - to expand the log.
it: Fai clic su una riga con una transazione - per espandere il registro.

source: The transaction hash is there - copy it.
it: L'hash di transazione è lì: copialo.

source: Then click in the debugger paste the hash and click on the `Start debugging` button.
it: Quindi fai clic nel debugger per incollare l'hash e premi il pulsante `Avvia il debug`.

source: Using the debugger
it: Utilizzare il debugger

source: The debugger allows one to see detailed informations about the transaction's execution. It uses the editor to display the location in the source code where the current execution is.
it: Il debugger consente di visualizzare informazioni dettagliate sull'esecuzione della transazione. Esso utilizza l'editor per visualizzare la posizione nel codice sorgente in cui si trova l'esecuzione attuale.

source: The navigation part contains a slider and buttons that can be used to step through the transaction execution.
it: La parte di navigazione contiene un cursore e dei pulsanti che possono essere utilizzati per procedere con l'esecuzione della transazione.

source: Explanation of Debugger button capabilities
it: Spiegazione delle funzionalità del pulsante Debugger

source: Step Over Back Returns to the previous step, but ignores/steps over function calls: the debugger WILL NOT enter a function
it: Passa Sopra Indietro Ritorna al passo precedente, ma ignora/passa sopra le chiamate di funzione: il debugger NON inserirà una funzione

source: Step Back Returns to the previous step. Does not ignore function calls: the debugger WILL enter any function along the way
it: Passa Indietro Ritorna al passo precedente. Non ignora le chiamate della funzione: il debugger INSERIRÀ qualunque funzione lungo il percorso

source: Step Into Forwards to the next step. Does not ignore function calls: the debugger WILL enter any function along the way
it: Passa Dentro Avanza al prossimo passo. Non ignora le chiamate di funzione: il debugger INSERIRÀ qualsiasi funzione lungo il percorso

source: Step Over Forward Forwards to the next step, but ignores/steps over function calls: the debugger WILL NOT enter a function
it: Passa Sopra Avanti Avanzerà verso il prossimo passo, ma ignora/passa sopra le chiamate di funzione: il debugger NON inserirà una funzione

source: Jump to the Previous Breakpoint Sends the debugger to the last visited breakpoint. Note that breakpoints may be set by clicking the line number in source code
it: Salta al punto di interruzione precedente Invia il debugger all'ultimo punto di interruzione visitato. Si noti che i punti di interruzione possono essere impostati facendo clic sul numero di riga nel codice sorgente

source: Jump Out Sends the debugger to the function's end
it: Salta fuori Invia il debugger alla fine della funzione

source: Jump to the Next Breakpoint Sends the debugger to the next breakpoint
it: Salta al punto di interruzione successivo Invia il debugger al punto di interruzione successivo

source: 11 panels give detailed information about the execution:
it: 11 pannelli forniscono informazioni dettagliate sull'esecuzione:

source: Instructions
it: Istruzioni

source: The Instructions panel displays the bytecode of the current executing contract- with the current step highlighted.
it: Il pannello Istruzioni visualizza il bytecode del contratto in esecuzione, con il passaggio attuale evidenziato.

source: Important note: When this panel is hidden, the slider will have a coarser granularity and only stop at *expression boundaries*, even if they are compiled into multiple EVM instructions. When the panel is displayed, it will be possible to step over every instruction, even those that refers to the same expression.
it: Nota importante: quando questo pannello è nascosto, il cursore avrà una granularità più grossolana e si fermerà solo ai *confini delle espressioni*, anche se queste sono compilate in più istruzioni EVM. Quando il pannello è visualizzato, sarà possibile passare sopra ogni istruzione, anche quelle che fanno riferimento alla stessa espressione.

source: The Solidity Locals panel displays local variables associated with the current context.
it: Il pannello "Solidity Locals" visualizza le variabili locali associate al contesto attuale.

source: Solidity State
it: Stato di Solidity

source: The Solidity State panel displays state variables of the current executing contract.
it: Il pannello Stato di Solidity visualizza le variabili di stato del contratto in esecuzione.

source: Low level panels
it: Pannelli di basso livello

source: These panels display low level informations about the execution:
it: Questi pannelli mostrano informazioni di basso livello sull'esecuzione:

source: Storages Changes
it: Modifiche dell'Archiviazione

source: Memory
it: Memoria

source: Call Data
it: Dati d'Invocazione

source: Call Stack
it: Pila d'Invocazione

source: Return Value (only if the current step is a RETURN opcode)
it: Valore Restituito (solo se il passaggio corrente è un codice operativo RETURN)

source: Full Storages Changes (only at the end of the execution & it displays the all the storage changes)
it: Modifiche agli Archivi Completi (solo alla fine dell' esecuzione & mostra tutte le modifiche all' archiviazione)

source: Reverted Transaction
it: Transazione Stornata

source: A transaction can be `reverted` (because of an *out of gas exception*, a Solidity `revert` statement or a low level exception).
it: Una transazione può essere `stornata` (a causa di un'eccezione *carburante esaurito*, di un'istruzione `revert` di Solidity o di un'eccezione di basso livello).

source: It is important to be aware of the exception and to locate where the exception is in the source code.
it: È importante essere consapevoli dell'eccezione e individuare la posizione dell'eccezione nel codice sorgente.

source: Remix will warn you when the execution throws an exception. The `warning` button will jump to the last opcode before the exception happened.
it: Remix ti avviserà quando l'esecuzione genera un'eccezione. Il pulsante di avvertimento salta all'ultimo codice operativo prima che si verificasse l'eccezione.

source: Breakpoints
it: Punti di interruzione

source: The two last buttons from the navigation area are used to jump either back to the previous breakpoint or forward to the next breakpoint.
it: Gli ultimi due pulsanti dell'area di navigazione servono per tornare al punto di interruzione precedente o per passare al punto di interruzione successivo.

source: Breakpoints can be added and removed by clicking on the line number in the **Editor**.
it: I punti di interruzione possono essere aggiunti e rimossi facendo clic sul numero di riga nell'Editor**.

source: When using a debug session with breakpoints, the execution will jump to the first encountered breakpoint.
it: Quando si utilizza una sessione di debug con punti d'interruzione, l'esecuzione salta al primo punto d'interruzione incontrato.

source: **Important note:** If you add a breakpoint to a line that declares a variable, it might be triggered twice: Once for initializing the variable to zero and a second time for assigning the actual value.
it: **Nota importante:** se si aggiunge un punto d'interruzione a una riga che dichiara una variabile, questo potrebbe essere attivato due volte: una prima volta per inizializzare la variabile a zero e una seconda volta per assegnare il valore effettivo.

source: Here's an example of this issue. If you are debugging the following contract:
it: Ecco un esempio di questo problema. Se stai facendo debug del seguente contratto:

source: And breakpoints are set for the lines
it: E punti d'interruzione sono impostati per le linee

source: then clicking on the `Jump to the next breakpoint` button will stop at the following lines in the given order:
it: allora, facendo clic sul pulsante `Salta al prossimo punto di interruzione`, si fermerà alle righe seguenti nell'ordine indicato:

source: `uint p = 45;` (declaration of p)
it: `uint p = 45;` (dichiarazione di p)

source: `uint l = 34;` (declaration of l)
it: `uint l = 34;` (dichiarazione di l)

source: `uint p = 45;` (45 assigned to p)
it: `uint p = 45;` (45 assegnato a p)

source: `m = 89;` (89 assigned to m)
it: `m = 89;` (89 assegnato a m)

source: `uint l = 34;` (34 assigned to l)
it: `uint l = 34;` (34 assegnato a l)
