Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittesting_examples.po
Languages: it

source: Here are some examples which can give you better understanding to plan your tests.
it: Ecco alcuni esempi che possono farvi comprendere meglio come pianificare i vostri test.

source: **Note:** Examples in this section are intended to give you a push for development. We don't recommend to rely on them without verifying at your end.
it: **Nota:** Gli esempi di questa sezione hanno lo scopo di fornire una spinta allo sviluppo. È sconsigliato fare affidamento su di essi senza averli verificati.

source: 1. Simple example
it: 1. Esempio semplice

source: In this example, we test setting & getting variables.
it: In questo esempio, testiamo l'impostazione e l'ottenimento delle variabili.

source: Contract/Program to be tested: `Simple_storage.sol`
it: Contratto/Programma da testare: `Simple_storage.sol`

source: Test contract/program: `simple_storage_test.sol`
it: Test del contratto/programma: `simple_storage_test.sol`

source: 2. Testing a method involving `msg.sender`
it: 2. Testare un metodo che coinvolga `msg.sender`

source: In Solidity, `msg.sender` plays a great role in access management of a smart contract methods interaction. Different `msg.sender` can help to test a contract involving multiple accounts with different roles. Here is an example for testing such case:
it: In Solidity, `msg.sender` svolge un ruolo importante nella gestione dell'accesso ai metodi di interazione di un contratto intelligente. Diversi `msg.sender` possono aiutare a testare un contratto che coinvolge più account con ruoli diversi. Ecco un esempio per testare questo scenario:

source: Contract/Program to be tested: `Sender.sol`
it: Contratto/programma da testare: `Sender.sol

source: Test contract/program: `Sender_test.sol`
it: Test del contratto/programma: `Sender_test.sol`

source: 3. Testing method execution
it: 3. Testare il metodo esecuzione

source: With Solidity, one can directly verify the changes made by a method in storage by retrieving those variables from a contract. But testing for a successful method execution takes some strategy. Well that is not entirely true, when a test is successful - it is usually obvious why it passed. However, when a test fails, it is essential to understand why it failed.
it: Con Solidity, si possono verificare direttamente le modifiche apportate da un metodo in memoria, recuperando le variabili da un contratto. Ma verificare che l'esecuzione di un metodo abbia successo richiede una certa strategia. Bene, questo non è del tutto vero: quando un test ha successo, di solito è ovvio il motivo per cui è stato superato. Tuttavia, quando un test fallisce, è essenziale capire perché è fallito.

source: To help in such cases, Solidity introduced the `try-catch` statement in version `0.6.0`. Previously, we had to use low-level calls to track down what was going on.
it: Per aiutare in questi casi, Solidity ha introdotto l'istruzione `try-catch` nella versione `0.6.0`. In precedenza, dovevamo usare chiamate di basso livello per capire cosa stesse succedendo.

source: Here is an example test file that use both **try-catch** blocks and **low level calls**:
it: Ecco un esempio di file di test che utilizza sia blocchi **try-catch** che **chiamate di basso livello**:

source: Contract/Program to be tested: `AttendanceRegister.sol`
it: Contratto/programma da testare: `AttendanceRegister.sol

source: Test contract/program: `AttendanceRegister_test.sol`
it: Test del contratto/programma: `AttendanceRegister_test.sol`

source: 4. Testing a method involving `msg.value`
it: 4. Testare un metodo che coinvolga `msg.value

source: In Solidity, ether can be passed along with a method call which is accessed inside contract as `msg.value`. Sometimes, multiple calculations in a method are performed based on `msg.value` which can be tested with various values using Remix's Custom transaction context. See the example:
it: In Solidity, gli ether possono essere passati insieme a una chiamata di metodo, a cui si accede all'interno del contratto come `msg.value`. A volte, calcoli multipli in un metodo vengono eseguiti sulla base di `msg.value`, che può essere testato con vari valori usando il contesto di transazione personalizzato di Remix. Si veda l'esempio:

source: Contract/Program to be tested: `Value.sol`
it: Contratto/programma da testare: `Valore.sol

source: Test contract/program: `Value_test.sol`
it: Test del contratto/programma: `Value_test.sol`

source: 5. Testing a method involving `msg.sender` and `msg.value`
it: 5. Testare un metodo che coinvolga `msg.sender` e `msg.value`

source: In the following test, we will be emulating multiple accounts making deposits in a smart contract to the same recipient and finally having the recipient withdraw the lump sum of all donations. We are also verifying that the donations match the expected amounts. This example really drives home how could you switch between different accounts, while using a set of different msg.value amounts.
it: Nel test seguente, simuleremo più account che effettuano depositi in un contratto intelligente ad uno stesso destinatario ed infine avremo il destinatario che preleverà l'importo forfettario di tutte le donazioni. Verificheremo inoltre che le donazioni corrispondano agli importi previsti. Questo esempio illustra bene come si possa passare da un account ad un altro, utilizzando un insieme di diversi importi di msg.value.

source: Contract/Program to be tested: `Donations.sol`
it: Contratto/programma da testare: `Donations.sol`

source: Test contract/program: `Donations_test.sol`
it: Test del contratto/programma: `Donations_test.sol`
