Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittesting.po
Languages: es, fr, it

source: Unit Testing Plugin
es: Plugin de pruebas unitarias
fr: Plugin de test unitaire
it: Plugin Unit Testing

source: Click the ![](images/a-user-testing-icon.png) (double check) icon from icon bar to move to the `Solidity Unit Testing` plugin.
es: Haga clic en el icono ![](images/a-user-testing-icon.png) (doble check) de la barra de iconos para pasar al plugin `Solidity Unit Testing`.
fr: Cliquez sur l'icône ![](images/a-user-testing-icon.png) (double vérification) de la barre d'icônes pour accéder au plugin `Solidity Unit Testing`.
it: Clicca l' ![](images/a-user-testing-icon.png) (ricontrolla) icona dalla barra delle icone per spostarti al plugin `Solidity Unit Testing`.

source: If you haven't used this plugin before and are not seeing `double check` icon, you have to activate it from Remix plugin manager.
es: Si no ha utilizado este plugin antes y no ve el icono de `doble check`, tiene que activarlo desde el gestor de plugins de Remix.
fr: Si vous n'avez pas utilisé ce plugin auparavant et que vous ne voyez pas l'icône `double check`, vous devez l'activer depuis le gestionnaire de plugins Remix.
it: Se non hai mai usato questo plugin e non vedi l'icona della `doppia spunta`, devi attivarlo dal gestore dei plugin di Remix.

source: Go to the plugin manager by clicking the ![](images/a-plug.png) (plug) icon and activate `Solidity Unit Testing` plugin.
es: Vaya al gestor de plugins haciendo clic en el icono ![](images/a-plug.png) (plug) y active el plugin `Solidity Unit Testing`.
fr: Allez dans le gestionnaire de plugins en cliquant sur l'icône ![](images/a-plug.png) (plug) et activez le plugin `Solidity Unit Testing`.
it: Vai al plugin manager cliccando sull'icona ![](images/a-plug.png) (plug) e attiva il plugin `Solidity Unit Testing`.

source: Now `double check` icon will appear on the left side icon bar. Clicking on icon will load the plugin in the side panel.
es: Ahora aparecerá el icono `doble check` en la barra de iconos del lado izquierdo. Al hacer clic en el icono se cargará el plugin en el panel lateral.
fr: L'icône `double check` apparaît alors sur la barre d'icônes de gauche. En cliquant sur l'icône, le plugin sera chargé dans le panneau latéral.
it: A questo punto, nella barra delle icone di sinistra apparirà l'icona della ` doppia spunta `. Facendo clic sull'icona si caricherà il plugin nel pannello laterale.

source: <i>Alternatively, just select `Solidity` environment from Remix IDE `Home` tab. This will activate `Solidity Unit Testing` plugin along with `Solidity Compiler`, `Deploy & Run Transactions` & `Solidity Static Analysis` plugins.</i>
es: <i>Alternativamente, sólo tiene que seleccionar el entorno `Solidity` en la pestaña `Home` de Remix IDE. Esto activará el plugin `Solidity Unit Testing` junto con los plugins `Solidity Compiler`, `Deploy & Run Transactions` & `Solidity Static Analysis`.</i>
fr: <i>Alternativement, sélectionnez simplement l'environnement `Solidity` depuis l'onglet `Home` de l'IDE Remix. Cela activera le plugin `Solidity Unit Testing` ainsi que les plugins `Solidity Compiler`, `Deploy & Run Transactions` et `Solidity Static Analysis`.</i>
it: <i>In alternativa, basta selezionare l'ambiente `Solidity` dalla `Pagina Iniziale` di remix IDE. Questo attiverà il plugin `Solidity Unit Testing` insieme ai plugin `Compilatore di Solidity`, `Distribuisci & Esegui Transazioni` e `Analisi Statica di Solidity`.</i>

source: After successful loading, plugin looks like this:
es: Después de cargarlo correctamente, el plugin tiene este aspecto:
fr: Après un chargement réussi, le plugin ressemble à ceci :
it: Dopo averlo caricato con successo, il plugin ha questo aspetto:

source: Test directory
es: Directorio de prueba
fr: Répertoire des tests
it: Cartella dei test

source: Plugin asks you to provide a directory which will be your workspace only for this plugin. To select directory, as soon as you add `/` to the path, it shows the possible options.
es: El plugin le pide que proporcione un directorio que será su espacio de trabajo sólo para este plugin. Para seleccionar el directorio, en cuanto añada `/` a la ruta, le mostrará las opciones posibles.
fr: Le plugin vous demande de fournir un répertoire qui sera votre espace de travail uniquement pour ce plugin. Pour sélectionner le répertoire, dès que vous ajoutez `/` au chemin, il affiche les options possibles.
it: Il plugin ti chiede di fornire una cartella che sarà l'area di lavoro solo per questo plugin. Per selezionare la cartella, non appena si aggiunge `/` al percorso, vengono mostrate le possibili opzioni.

source: Once selected, this directory will be used to load test files and to store newly generated test files.
es: Una vez seleccionado, este directorio se utilizará para cargar los archivos de prueba y para almacenar los archivos de prueba recién generados.
fr: Une fois sélectionné, ce répertoire sera utilisé pour charger les fichiers de test et pour stocker les fichiers de test nouvellement générés.
it: Una volta selezionata, questa cartella verrà utilizzata per caricare i file di test e per archiviare i file di test appena generati.

source: Default test directory is `browser/tests`.
es: El directorio de pruebas por defecto es `browser/tests`.
fr: Le répertoire de test par défaut est `browser/tests`.
it: La directory di test predefinita è `browser/tests`.

source: Generate
es: Genere
fr: Générer
it: Genera

source: Select a solidity file which you want to test and click on the button `Generate`. It will generate a test file dedicated to selected file **in the test directory**.
es: Seleccione el archivo solidity que desea probar y pulse el botón `Generar`. Se generará un archivo de prueba dedicado al archivo seleccionado **en el directorio de prueba**.
fr: Sélectionnez un fichier solidity que vous voulez tester et cliquez sur le bouton `Générer`. Un fichier de test dédié au fichier sélectionné sera généré **dans le répertoire de test**.
it: Selezionare un file di solidity che si desidera testare e fare clic sul pulsante `Genera`. Genererà un file di test dedicato al file selezionato **nella directory dei test**.

source: If no file is selected, it will still create a file with generic name as `newFile_test.sol`.
es: Si no se selecciona ningún archivo, se creará igualmente un archivo con nombre genérico como `nuevoArchivo_prueba.sol`.
fr: Si aucun fichier n'est sélectionné, il créera quand même un fichier avec le nom générique `newFile_test.sol`.
it: Se nessun file è selezionato, verrà comunque creato un file con nome generico come `newFile_test.sol`.

source: This file contains sufficient information to give better understanding about developing tests for a contract.
es: Este archivo contiene información suficiente para comprender mejor la elaboración de pruebas para un contrato.
fr: Ce dossier contient suffisamment d'informations pour vous permettre de mieux comprendre l'élaboration de tests pour un contrat.
it: Questo file contiene informazioni sufficienti per comprendere meglio lo sviluppo di test per un contratto.

source: Generic file looks as:
es: El archivo genérico tiene el siguiente aspecto:
fr: Le fichier générique se présente comme suit :
it: Il file generico sembra come:

source: Write Tests
es: Pruebas de escritura
fr: Rédiger des tests
it: Scrivi dei Test

source: Write sufficient unit tests to ensure that your contract works as expected under different scenarios.
es: Escriba suficientes pruebas unitarias para asegurarse de que su contrato funciona como se espera en diferentes escenarios.
fr: Rédigez suffisamment de tests unitaires pour vous assurer que votre contrat fonctionne comme prévu dans différents scénarios.
it: Scrivi un numero sufficiente di test unitari per garantire che il contratto funzioni come previsto in diversi scenari.

source: Remix injects a built-in `assert` library which can be used for testing. You can visit the library documentation [here](./assert_library).
es: Remix inyecta una biblioteca `assert` incorporada que puede utilizarse para realizar pruebas. Puede visitar la documentación de la biblioteca [here](./assert_library).
fr: Remix injecte une bibliothèque intégrée `assert` qui peut être utilisée pour les tests. Vous pouvez consulter la documentation de la bibliothèque [here](./assert_library).
it: Remix inietta una libreria `assert` integrata che può essere usata per i test. Puoi visitare la documentazione della libreria [here](./assert_library).

source: Apart from this, Remix allows usage of some special functions in the test file to make testing more structural. They are as:
es: Aparte de esto, Remix permite el uso de algunas funciones especiales en el archivo de prueba para hacer las pruebas más estructurales. Son las siguientes:
fr: En outre, Remix permet d'utiliser certaines fonctions spéciales dans le fichier de test afin de rendre les tests plus structurés. Ces fonctions sont les suivantes :
it: Oltre a questo, Remix permette di utilizzare alcune funzioni speciali per rendere i test più strutturali. Esse sono:

source: `beforeEach()` - Runs before each test
es: `beforeEach()` - Se ejecuta antes de cada prueba
fr: `beforeEach()` - S'exécute avant chaque test
it: `beforeEach()` - Eseguita prima di ogni test

source: `beforeAll()` - Runs before all tests
es: `beforeAll()` - Se ejecuta antes de todas las pruebas
fr: `beforeAll()` - S'exécute avant tous les tests
it: `beforeAll()` - Eseguita prima di tutti i test

source: `afterEach()` - Runs after each test
es: `afterEach()` - Se ejecuta después de cada prueba
fr: `afterEach()` - S'exécute après chaque test
it: `afterEach()` - Eseguita dopo ogni test

source: `afterAll()` - Runs after all tests
es: `afterAll()` - Se ejecuta después de todas las pruebas
fr: `afterAll()` - S'exécute après tous les tests
it: `afterAll()` - Eseguita dopo tutti i test

source: To get started, see [this simple example](./unittesting_examples.html#simple-example).
es: Para empezar, consulte [este sencillo ejemplo](./unittesting_examples.html#simple-example).
fr: Pour commencer, consultez [cet exemple simple](./unittesting_examples.html#simple-example).
it: Per iniziare, vedere [questo semplice esempio](./unittesting_examples.html#simple-example).

source: Run
es: Ejecute
fr: Exécuter
it: Esegui

source: Once you are done with writing tests, select the file(s) and click on `Run` to execute the tests. The execution will run in a separate environment. After completing the execution of one file, a test summary will be shown as below:
es: Una vez que haya terminado de escribir las pruebas, seleccione el/los archivo(s) y haga clic en `Ejecutar` para ejecutar las pruebas. La ejecución se llevará a cabo en un entorno independiente. Tras completar la ejecución de un archivo, se mostrará un resumen de la prueba como el que se muestra a continuación:
fr: Une fois que vous avez fini d'écrire les tests, sélectionnez le(s) fichier(s) et cliquez sur `Run` pour exécuter les tests. L'exécution se fera dans un environnement séparé. Après avoir terminé l'exécution d'un fichier, un résumé du test sera affiché comme ci-dessous :
it: Una volta terminata la scrittura dei test, selezionare i file e fare clic su `Esegui` per eseguirli. L'esecuzione avverrà in un ambiente separato. Dopo aver completato l'esecuzione di un file, verrà mostrato un riepilogo dei test come di seguito riportato:

source: For failed tests, there will be more assertion details to analyze the issue. Clicking on failed test will highlight the relevant line of code in the editor.
es: En el caso de las pruebas fallidas, habrá más detalles de las afirmaciones para analizar el problema. Al hacer clic en la prueba fallida se resaltará la línea de código correspondiente en el editor.
fr: Pour les tests qui ont échoué, il y aura plus de détails d'assertion pour analyser le problème. Si vous cliquez sur un test qui a échoué, la ligne de code correspondante sera mise en évidence dans l'éditeur.
it: Per i test falliti, ci saranno più dettagli sull'asserzione per analizzare il problema. Facendo clic su un test fallito, si evidenzierà la relativa riga di codice nell'editor.

source: Stop
fr: Arrêter
it: Interrompi

source: If you have selected multiple files to run the tests and want to stop the execution, click on `Stop` button. It will stop execution after running the tests for current file.
es: Si ha seleccionado varios archivos para ejecutar las pruebas y desea detener la ejecución, pulse el botón `Stop`. Detendrá la ejecución después de ejecutar las pruebas para el archivo actual.
fr: Si vous avez sélectionné plusieurs fichiers pour exécuter les tests et que vous souhaitez arrêter l'exécution, cliquez sur le bouton "Stop". L'exécution s'arrêtera après avoir exécuté les tests pour le fichier en cours.
it: Se hai selezionato più file per eseguire i test e vuoi interrompere l'esecuzione, fai clic sul pulsante `Interrompi`. L'esecuzione verrà interrotta dopo aver eseguito i test per il file attuale.

source: Customization
es: Personalización
fr: Personnalisation
it: Personalizzazione

source: Remix facilitates users with various types of customizations to test a contract properly.
es: Remix facilita a los usuarios varios tipos de personalizaciones para probar un contrato correctamente.
fr: Remix offre aux utilisateurs différents types de personnalisation pour tester correctement un contrat.
it: Remix agevola gli utenti con vari tipi di personalizzazioni per testare correttamente un contratto.

source: **1. Custom Compiler Context**
es: **1. Contexto de compilador personalizado**
fr: **1. Contexte de compilation personnalisé**
it: **1. Contesto del Compilatore Personalizzato**

source: `Solidity Unit Testing` refers to the `Solidity Compiler` plugin for compiler configurations. Configure `Compiler`, `EVM Version`, `Enable Optimization` & `runs` in the `Solidity Compiler` plugin and this will be used in the `Solidity Unit Testing` plugin for contract compilation before running unit tests.
es: `Solidity Unit Testing` hace referencia al plugin `Solidity Compiler` para las configuraciones del compilador. Configure `Compiler`, `EVM Version`, `Enable Optimization` & `runs` en el plugin `Solidity Compiler` y esto se utilizará en el plugin `Solidity Unit Testing` para la compilación de contratos antes de ejecutar las pruebas unitarias.
fr: `Solidity Unit Testing` fait référence au plugin `Solidity Compiler` pour la configuration du compilateur. Configurez `Compiler`, `EVM Version`, `Enable Optimization` & `runs` dans le plugin `Solidity Compiler` et ceci sera utilisé dans le plugin `Solidity Unit Testing` pour la compilation des contrats avant de lancer les tests unitaires.
it: `Solidity Unit Testing` si riferisce al plugin `Compilatori di Solidity` per le configurazioni del compilatore. Configurare `Compilatore`, `Versione EMV`, `Abilita ottimizzazione` & `Esegui` nel plugin `Compilatore di Solidity` e questo sarà usato nel plugin `Solidity Unit Testing` per la compilazione del contratto prima di eseguire i test unitari.

source: **2. Custom Transaction Context**
es: **2. Contexto de transacción personalizado**
fr: **2. Contexte de transaction personnalisé**
it: **2. Contesto della Transazione Personalizzata**

source: For interacting with a contract's method, the prime parameters of a transaction are `from` address, `value` & `gas`. Typically, a method's behaviour is tested with different values of these parameters.
es: Para interactuar con el método de un contrato, los parámetros principales de una transacción son la dirección `from`, `value` y `gas`. Normalmente, el comportamiento de un método se prueba con diferentes valores de estos parámetros.
fr: Pour interagir avec la méthode d'un contrat, les principaux paramètres d'une transaction sont l'adresse `from`, `value` et `gas`. Généralement, le comportement d'une méthode est testé avec différentes valeurs de ces paramètres.
it: Per interagire con il metodo di un contratto, i parametri principali di una transazione sono l'indirizzo `da` cui proviene, il `valore` e il `carburante`. In genere, il comportamento di un metodo viene testato con diversi valori di questi parametri.

source: One can input custom values for `msg.sender` & `msg.value` of transaction using NatSpec comments, like:
es: Se pueden introducir valores personalizados para `msg.sender` & `msg.value` de transacción utilizando comentarios NatSpec, como:
fr: On peut saisir des valeurs personnalisées pour `msg.sender` et `msg.value` de la transaction en utilisant les commentaires NatSpec, comme par exemple :
it: È possibile inserire valori personalizzati per `msg.sender` e `msg.value` della transazione utilizzando i commenti NatSpec, come ad esempio:

source: <b>Instructions to use:</b>
es: <b>Instrucciones de uso:</b>
fr: <b>Mode d'emploi :</b>
it: <b>Istruzioni da usare:</b>

source: Parameters must be defined in the method's NatSpec
es: Los parámetros deben definirse en el NatSpec del método
fr: Les paramètres doivent être définis dans la NatSpec de la méthode
it: I parametri devono essere definiti nella NatSpec del metodo

source: Each parameter key should be prefixed with a hash (**#**) and end with a colon following a space (**:&nbsp;**) like `#sender: ` & `#value: `
es: Cada clave de parámetro debe ir precedida de una almohadilla (**#**) y terminar con dos puntos después de un espacio (**:&nbsp;**) como `#sender: ` & `#value: `
fr: Chaque clé de paramètre doit être préfixée par un hash (**#**) et se terminer par deux points après un espace (** :&nbsp;**) comme `#sender : ` & `#value : `
it: Ogni chiave di parametro deve essere preceduta da un cancelletto (**#**) e terminare con i due punti seguiti da un spazio (**:&nbsp;**), come `#mittente: ` e `#valore: `

source: For now, customization is only available for parameters `sender` & `value`
es: Por ahora, la personalización sólo está disponible para los parámetros `sender` & `value`.
fr: Pour l'instant, la personnalisation n'est disponible que pour les paramètres `sender` et `value`
it: Per il momento, la personalizzazione è disponibile solo per i parametri `mittente` e `valore`

source: Sender is the `from` address of a transaction which is accessed using `msg.sender` inside a contract method. It should be defined in a fixed format as '**account-**<account_index>'
es: El remitente es la dirección `from` de una transacción a la que se accede utilizando `msg.sender` dentro de un método de contrato. Debe definirse en un formato fijo como `**cuenta-**<account_index>'
fr: L'expéditeur est l'adresse `from` d'une transaction à laquelle on accède en utilisant `msg.sender` à l'intérieur d'une méthode de contrat. Il doit être défini dans un format fixe comme "**account-**<account_index>".
it: Il mittente è l'indirizzo `da` cui arriva una transazione e vi si accede utilizzando msg.sender all'interno di un metodo di contratto. Deve essere definito in un formato prestabilito come '**account-**<account_index>'

source: `<account_index>` varies from `0-2` before remix-ide release v0.10.0 and `0-9` afterwards
es: `<account_index>` varía de `0-2` antes del lanzamiento de remix-ide v0.10.0 y `0-9` después
fr: `<account_index>` varie de `0-2` avant la sortie de la version 0.10.0 de remix-ide et de `0-9` après.
it: `<account_index> varia da 0-2 prima della release di remix-ide v0.10.0 e da 0-9 in avanti

source: `remix_accounts.sol` must be imported in your test file to use custom `sender`
es: `remix_accounts.sol` debe ser importado en su archivo de prueba para utilizar `sender` personalizado
fr: `remix_accounts.sol` doit être importé dans votre fichier de test pour utiliser le `sender` personnalisé
it: `remix_accounts.sol deve essere importato nel file di prova per utilizzare il "mittente" personalizzato

source: Value is `value` sent along with a transaction in `wei` which is accessed using `msg.value` inside a contract method. It should be a number.
es: El valor es el `valor` enviado junto con una transacción en `wei` al que se accede utilizando `msg.value` dentro de un método de contrato. Debe ser un número.
fr: La valeur est la `valeur` envoyée avec une transaction dans `wei` et à laquelle on accède en utilisant `msg.value` à l'intérieur d'une méthode de contrat. Il doit s'agir d'un nombre.
it: Il valore è il `valore` inviato con una transazione in `wei`, a cui si accede usando `msg.value` all'interno di un metodo di contratto. Dovrebbe essere un numero.

source: Regarding `gas`, Remix estimates the required gas for each transaction internally. Still if a contract deployment fails with `Out-of-Gas` error, it tries to redeploy it by doubling the gas. Deployment failing with double gas will show error: ```contract deployment failed after trying twice: The contract code couldn't be stored, please check your gas limit```
es: En cuanto al `gas`, Remix estima internamente el gas necesario para cada transacción. Aún así, si el despliegue de un contrato falla con el error `Out-of-Gas`, intenta volver a desplegarlo duplicando el gas. El despliegue que falle con el doble de gas mostrará el error: ``el despliegue del contrato ha fallado tras intentarlo dos veces: El código del contrato no ha podido ser almacenado, por favor compruebe su límite de gas``.
fr: En ce qui concerne `gas`, Remix estime en interne le gaz nécessaire pour chaque transaction. Toujours si le déploiement d'un contrat échoue avec l'erreur `Out-of-Gas`, il essaie de le redéployer en doublant le gaz. Un déploiement qui échoue avec un gaz double affichera l'erreur suivante : ``le déploiement du contrat a échoué après avoir essayé deux fois : le code du contrat n'a pas pu être stocké, veuillez vérifier votre limite de gaz``.
it: Per quanto riguarda il `carburante`, Remix stima internamente il carburante necessario per ogni transazione. Tuttavia, se la distribuzione di un contratto fallisce con un errore di `carburante esaurito`, tenta di distribuirlo nuovamente raddoppiando il carburante. Se la distribuzione fallisce con il doppio del carburante, viene visualizzato l'errore: ```distribuzione del contratto fallita dopo aver provato due volte: Il codice del contratto non ha potuto essere archiviato, si prega di controllare il limite di carburante```

source: Various test examples can be seen in [examples](./unittesting_examples) section.
es: Puede ver varios ejemplos de pruebas en la sección [examples](./unittesting_examples).
fr: Divers exemples de tests peuvent être consultés dans la section [examples](./unittesting_examples).
it: Vari esempi di test possono essere consultati nella sezione [examples](./unittesting_examples).

source: Points to remember
es: Puntos a recordar
fr: Points à retenir
it: Punti da ricordare

source: A test contract cannot have a method with parameters. Having one such method will show error: `Method 'methodname' can not have parameters inside a test contract`
es: Un contrato de prueba no puede tener un método con parámetros. Tener un método de este tipo mostrará el error: `Method 'methodname' can not have parameters inside a test contract`.
fr: Un contrat de test ne peut pas avoir de méthode avec des paramètres. Si vous avez une telle méthode, vous obtiendrez l'erreur suivante : `La méthode 'nom de la méthode' ne peut pas avoir de paramètres à l'intérieur d'un contrat de test`
it: Un contratto di test non può avere un metodo con parametri. Se si ha un metodo di questo tipo, viene mostrato l'errore: `Il metodo 'methodname' non può avere parametri all'interno di un contratto di test`

source: Number of test accounts are `3` before remix-ide release v0.10.0 and `10` afterwards
es: El número de cuentas de prueba es `3` antes del lanzamiento de remix-ide v0.10.0 y `10` después
fr: Le nombre de comptes de test est de `3` avant la sortie de la version 0.10.0 de remix-ide et de `10` après.
it: Il numero di account di prova è di `3` prima del rilascio di remix-ide v0.10.0 e di `10` dopo
