Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittestingAsCLI.po
Languages: es, fr, it

source: Command Line Interface
es: Interfaz de línea de comandos
fr: Interface de ligne de commande
it: Interfaccia a riga di comando

source: `remix-tests` is a tool which can be used as a CLI (Command Line Interface) solution to run the solidity unit tests. This is the same tool which works as a library underneath Remix's `Solidity Unit Testing` plugin. It is available on NPM as `@remix-project/remix-tests`.
es: `remix-tests` es una herramienta que puede ser utilizada como una solución CLI (Command Line Interface) para ejecutar las pruebas unitarias de solidity. Esta es la misma herramienta que funciona como una librería bajo el plugin `Solidity Unit Testing` de Remix. Está disponible en NPM como `@remix-project/remix-tests`.
fr: `remix-tests` est un outil qui peut être utilisé comme une solution CLI (Command Line Interface) pour exécuter les tests unitaires de Solidity. C'est le même outil qui fonctionne comme une bibliothèque sous le plugin `Solidity Unit Testing` de Remix. Il est disponible sur NPM en tant que `@remix-project/remix-tests`.
it: `remix-tests` è uno strumento che può essere usato come CLI (Command Line Interface) per eseguire i test unitari di Solidity. Questo è lo stesso strumento che funziona come libreria sotto il plugin `Solidity Unit Testing` di Remix. Esso è disponibile su NPM come `@remix-project/remix-tests`.

source: Get started
es: Empezar
fr: Commencez
it: Iniziare

source: You can install it using NPM:
es: Puede instalarlo utilizando NPM:
fr: Vous pouvez l'installer en utilisant NPM :
it: È possibile installarlo utilizzando NPM:

source: As a dev dependency:
es: Como dependencia dev:
fr: En tant que dépendance de développement :
it: Come una dipendenza dev:

source: As a global NPM module:
es: Como módulo NPM global:
fr: En tant que module NPM global :
it: Come modulo NPM globale:

source: To confirm installation, run:
es: Para confirmar la instalación, ejecute:
fr: Pour confirmer l'installation, exécutez :
it: Per confermare l'installazione, eseguire:

source: Version should be same as on NPM.
es: La versión debe ser la misma que en NPM.
fr: La version doit être la même que sur NPM.
it: La versione deve essere la stessa di quella su NPM.

source: How to use
es: Cómo utilizarlo
fr: Comment l'utiliser ?
it: Come si usa

source: You can see all available options using `help` command.
es: Puede ver todas las opciones disponibles utilizando el comando `help`.
fr: Vous pouvez voir toutes les options disponibles en utilisant la commande `help`.
it: È possibile vedere tutte le opzioni disponibili utilizzando il comando `help` (aiuto).

source: General structure of a command is as:
es: La estructura general de un comando es la siguiente
fr: La structure générale d'une commande est la suivante :
it: La struttura generale di un comando è:

source: To run all test files inside `examples` directory
es: Para ejecutar todos los archivos de prueba dentro del directorio `examples
fr: Pour exécuter tous les fichiers de test contenus dans le répertoire `examples`, procédez comme suit
it: Per eseguire tutti i file di test all'interno della directory `examples'

source: To run single test file named `simple_storage_test.sol` inside `examples` directory
es: Para ejecutar un único archivo de prueba llamado `simple_storage_test.sol` dentro del directorio `examples
fr: Pour exécuter un seul fichier de test nommé `simple_storage_test.sol` dans le répertoire `examples`.
it: Per eseguire un singolo file di test chiamato `simple_storage_test.sol` all'interno della cartella `examples`

source: **NOTE:** `remix-tests` will assume that name of test(s) file ends with `"_test.sol"`. e.g `simple_storage_test.sol`
es: **NOTA:** `remix-tests` asumirá que el nombre del archivo de la(s) prueba(s) termina en `"_prueba.sol"`. por ejemplo `simple_almacenamiento_prueba.sol`.
fr: **REMARQUE:** `remix-tests` supposera que le nom du fichier de test(s) se termine par `"_test.sol"`. par exemple `simple_storage_test.sol`
it: **NOTA:** `remix-tests` assume che il nome del file di test finisca con `"_test.sol"`. Ad esempio `simple_storage_test.sol`

source: Example
es: Ejemplo
fr: Exemple
it: Esempio

source: Consider for a simple storage contract named `simple_storage.sol`:
es: Considere para un contrato de almacenamiento simple llamado `simple_storage.sol`:
fr: Considérons un contrat de stockage simple nommé `simple_storage.sol` :
it: Si consideri un semplice contratto di archiviazione chiamato `simple_storage.sol`:

source: Test file `simple_storage_test.sol` can be as:
es: Archivo de prueba `simple_storage_test.sol` puede ser como:
fr: Le fichier de test `simple_storage_test.sol` peut être comme :
it: Il file di test `simple_storage_test.sol` può essere:

source: Running `simple_storage_test.sol` file will output as:
es: Si ejecuta el archivo `simple_storage_test.sol` obtendrá el siguiente resultado:
fr: L'exécution du fichier `simple_storage_test.sol` produira le résultat suivant :
it: L'esecuzione del file `simple_storage_test.sol` produrrà un risultato come questo:

source: Custom compiler context
es: Contexto de compilador personalizado
fr: Contexte de compilation personnalisé
it: Contesto del compilatore personalizzato

source: Most of the `remix-tests` options are there to define a custom compiler context. With an extended custom compiler context, execution of above test file will go as:
es: La mayoría de las opciones de `remix-tests` están ahí para definir un contexto de compilador personalizado. Con un contexto de compilador personalizado extendido, la ejecución del archivo de prueba anterior irá como:
fr: La plupart des options de `remix-tests` sont là pour définir un contexte de compilation personnalisé. Avec un contexte de compilateur personnalisé étendu, l'exécution du fichier de test ci-dessus se déroulera comme suit :
it: La maggior parte delle opzioni di `remix-tests' sono presenti per definire un contesto di compilatore personalizzato. Con un contesto di compilatore personalizzato esteso, l'esecuzione del file di test sopra avverrà così:

source: Rememeber, custom compiler version will require internet connection to load compiler.
es: Recuerde, la versión personalizada del compilador requerirá conexión a Internet para cargar el compilador.
fr: N'oubliez pas que la version personnalisée du compilateur nécessite une connexion internet pour charger le compilateur.
it: Ricordate che la versione personalizzata del compilatore richiede una connessione a Internet per caricare il compilatore.

source: As a CI solution
es: Como solución de IC
fr: En tant que solution d'IC
it: Come soluzione CI

source: `remix-tests` can also be used for continuous integration (CI) testing.
es: `remix-tests` también puede utilizarse para pruebas de integración continua (CI).
fr: `remix-tests` peut également être utilisé pour les tests d'intégration continue (CI).
it: `remix-tests` può essere usato anche per i test di integrazione continua (CI).

source: For implementation example, see [Su Squares contract](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) and [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067) that uses `remix-tests` for continuous integration.
es: Para ver un ejemplo de implementación, consulte [Su Squares contract](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) y [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067) que utiliza `remix-tests` para la integración continua.
fr: Pour un exemple d'implémentation, voir [Su Squares contract](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) et [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067) qui utilise `remix-tests` pour l'intégration continue.
it: Per un esempio di implementazione, vedere il [contratto Su Squares](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) e [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067) che usa `remix-tests` per l'integrazione continua.
