Repository: PlanckerLabs/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittesting.po
Languages: es, fr, it

source: While a test file which imports `remix_accounts.sol` might not compile successfully with `Solidity Compiler` plugin, do not worry, this will have no bearing on its success with `Solidity Unit Testing` plugin.
es: Aunque es posible que un archivo de prueba que importe `remix_accounts.sol` no compile correctamente con el plugin `Solidity Compiler`, no se preocupe, esto no influirá en su éxito con el plugin `Solidity Unit Testing`.
fr: Bien qu'un fichier de test qui importe `remix_accounts.sol` puisse ne pas compiler avec succès avec le plugin `Solidity Compiler`, ne vous inquiétez pas, cela n'aura aucune incidence sur son succès avec le plugin `Solidity Unit Testing`.
it: Anche se un file di prova che importa `remix_accounts.sol` non dovesse compilare con successo con il plugin `Compilatore di Solidity`, non preoccuparti, questo non avrà alcun impatto sul suo successo con il plugin `Solidity Unit Testing`.
